import React from "react";
import "./JainSymbol.scss";

function JainSymbol() {
  return (
    <>
      <div class="wrapperclassoFsymbol">
        <div
          class="flexclassofSYMBOL"
          style={{
            overflow: "auto",
          }}
        >
          <div class="spacer">
            <img
              id="imager"
              src="https://png.pngtree.com/png-vector/20220820/ourmid/pngtree-illustration-of-jain-festival-mahavir-jayanti-background-temple-jain-religion-vector-png-image_37639438.jpg"
              alt=""
            />
          </div>
          <div class="flex2">
            <div
              class="spacer"
              style={{
                overflow: "auto",
              }}
            >
              <p class="blurb">
                भगवान महावीर के शुद्ध द्विहजर पर्व, दो हजार पांचसवे निर्वाण दिवस
                के अवसर पर सन नौंबे सहसंवत्सर में, जैन समुदाय ने जैन धर्म के
                प्रतीक के रूप में एक चमकदार झिलमिलाती ध्वज चुना था। यह ध्वज
                अहिंसा के सिद्धान्तों को पालन करते हुए समाधि, मोक्ष का मार्ग
                दिखाते हुए, जैन धर्म के मूल्यों और सिद्धांतों को समाहित किये थे।
              </p>
              <br />
              <p class="blurb">
                जैन प्रतीक की रूपरेखा, जैन शास्त्रों में वर्णित तीन लोक - अधोलोक
                जिसे नरक कहते हैं, मध्यलोक अर्थात भौतिक संसार, और उर्ध्वलोक
                अर्थात स्वर्ग का प्रतिनिधित्व करती है। तीन लोक के सबसे ऊपर
                चंद्राकार आकृति सिद्धशिला में स्थित हैं, जो हमारा अंतिम लक्ष्य
                है। इसी सिद्धशिला के नीचे, तीन बिंदु - सम्यक दर्शन, सम्यक ज्ञान
                और सम्यक चारित्र की प्रतीक हैं।
              </p>
              <br />
              <p class="blurb">
                इसके बाद स्वस्तिक का चिन्ह होता है, जो जैन धर्म का एक पवित्र
                चिन्ह है। स्वस्तिक की 4 बाहुएं, संसारी जीवों का प्रतिनिधित्व
                करती हैं। ये चार पर्याय के संसारी जीव हैं - देव, नरकी, मनुष्य और
                तिर्यंच। यह स्वस्तिक हमें प्रेरित करता है कि हमें संसारिक चक्र
                को छोड़कर सम्यक दर्शन, ज्ञान और चारित्र के साथ सिद्धशिला तक
                पहुँचना है।
              </p>
              <br />
              <p class="blurb">
                खुली हुई हतेली जैन धर्म के महान सिद्धों का संकेत देती है और
                अहिंसा को दर्शाती है, और अहिंसाक आचरण व जीवन के प्रति अग्रषण
                करती है। इसके बाद सिद्धशिला में बना चक्र धर्म चक्र को इंगित करता
                है और ताट उसमें बने चौबीस रेखाओं के द्वारा चौबीस तीर्थंकरों ने
                संसार चक्रों को तोड़कर मोक्ष प्राप्त किया है। इसी प्रकार हम भी
                उनके द्वारा बताए गए मार्ग पर चलकर मुक्त और पुण्यवान सुखी हो सकते
                हैं।
              </p>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}

export default JainSymbol;
