import "./Festivals.scss";

function Festivals() {
  return (
    <>
      <div className="festivalsCLASSSSS">
        <h1>Jain Festivals</h1>
        <ol class="ol-cards alternate">
          <li className="festivalSLIlist">
            <div class="contentOFFESTIVALS">
              आम तौर पर, त्योहार उत्सव और उल्लास होते हैं जिनमें उत्साह, उमंग,
              आनंद और मनोरंजन होता है; लेकिन जैन त्योहारों की विशेषता त्याग,
              तपस्या, शास्त्रों का अध्ययन, पवित्र भजनों की पुनरावृत्ति, ध्यान और
              परमात्मा के प्रति भक्ति व्यक्त करना है। यहां तक कि जो लोग सांसारिक
              जीवन के जाल में फंसे हुए हैं, वे भी अपनी क्षमता और सुविधा के
              अनुसार, यथासंभव हद तक सांसारिक बंधनों से मुक्त हो जाते हैं और पूजा
              और ध्यान में लीन हो जाते हैं। त्याग और तपस्या ही जैन धर्म का आधार
              है।
            </div>
          </li>
        </ol>
        <ol class="ol-cards alternate">
          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#f68121" }}
          >
            <div class="step">
              <i class="fab fa-codepen"></i>
            </div>
            <div class="titleOFFESTIVClass">Paryushana MahaParva</div>
            <div class="contentOFFESTIVALS">
              पर्युषण जैन त्योहारों में सबसे महत्वपूर्ण त्योहार है; और यह
              प्रत्येक चातुर्मास के दौरान मनाया जाता है, जो भाद्रपद में ढलते
              चंद्रमा के पखवाड़े के बारहवें दिन से शुरू होता है और भाद्रपद में
              बढ़ते चंद्रमा के पखवाड़े के चौथे दिन समाप्त होता है। इन आठ दिनों
              में पूरा जैन समाज उत्साह और सत्कार के माहौल में मंत्रमुग्ध हो जाता
              है। सभी जैन, युवा और बूढ़े, अट्ठाई तप करते हैं - एक समय में आठ
              दिनों का उपवास। कुछ पुरुष और महिलाएँ; और यहां तक कि बच्चे भी आठ
              दिनों तक पौषध व्रत का संकल्प लेते हैं। इन दिनों के दौरान,
              आध्यात्मिक गुरु जैनियों के सबसे पवित्र ग्रंथ कल्पसूत्र को पढ़ते
              हैं और विस्तार से समझाते हैं। मण्डली के सभी सदस्य भक्ति भाव से
              अभिभूत होकर उस व्याख्या को सुनते हैं। सात दिन प्राप्ति के दिन हैं
              और आठवां दिन पूर्णता या उपलब्धि का है, इस प्रकार संवत्सरी महापर्व
              वार्षिक उत्सव मनाया जाता है। जब आध्यात्मिक गुरु 1250 मौलिक सूत्रों
              की व्याख्या करते हैं तो उनकी पवित्र वाणी को सुनना; उन लोगों से
              क्षमा मांगने के लिए सांवत्सरिक प्रतिक्रमण (वार्षिक प्रायश्चित)
              करना, जिनसे कोई नफरत करता है या जिनके प्रति कोई द्वेष रखता है; सभी
              घृणा और द्वेष को भूलकर, सांवत्सरिक आराधना - वार्षिक प्रायश्चित का
              गठन करें।
            </div>
          </li>
          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#ed1c24" }}
          >
            <div class="step">
              <i class="fab fa-github"></i>
            </div>
            <div className="titleOFFESTIVClass">Navpad Oli</div>
            <div class="contentOFFESTIVALS">
              इसका वर्णन तपस्या से संबंधित अनुभाग के अंतर्गत किया गया है। इस
              त्यौहार के दिनों में हर दिन नवपद की पूजा की जाती है; और श्रीपाल और
              मायना की कहानी का नाटकीय प्रदर्शन किया जाता है।
            </div>
          </li>
          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#582c8b" }}
          >
            <div class="step">
              <i class="fab fa-html5"></i>
            </div>
            <div className="titleOFFESTIVClass">
              Mahavir Swami Janma Kalyanak
            </div>
            <div class="contentOFFESTIVALS">
              अंतिम तीर्थंकर श्रमण भगवान का जन्मदिन चैत्र माह के शुक्ल पक्ष के
              तेरहवें दिन मनाया जाता है। इस अवसर पर, एक भव्य रथ जुलूस, सामुदायिक
              पूजा, भगवान की महिमा, चर्चा, प्रवचन, सेमिनार और भक्ति और
              आध्यात्मिक गतिविधियों का आयोजन किया जाता है। इस दिन बिहार के
              क्षत्रिय कुंड में एक भव्य उत्सव मनाया जाता है क्योंकि भगवान महावीर
              का जन्म वहीं हुआ था।
            </div>
          </li>
          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#0166b4" }}
          >
            <div class="step">
              <i class="fab fa-css3"></i>
            </div>
            <div className="titleOFFESTIVClass">Deepawali</div>
            <div class="contentOFFESTIVALS">
              दिवाली कार्तिक मास की अमावस्या को मनाई जाती है। उस दिन की रात को,
              महावीरस्वामी ने निर्वाण या मुक्ति प्राप्त की और पूर्ण आनंद की
              स्थिति प्राप्त की। भगवान ने उस रात, पावापुरी में शरीर और सभी
              कर्मों के बंधन को त्याग दिया और मुक्ति या मुक्ति प्राप्त की।
              चतुर्दशी (कार्तिक के कृष्ण पक्ष का चौदहवाँ दिन), पूर्णिमा का दिन
              और नया साल (कार्तिक के शुक्ल पक्ष का पहला दिन - इन तीन दिनों को
              पौषध, उपवास, पवित्र जप की विशेष पुनरावृत्ति के साथ मनाया जाता है)
              भजन, और ध्यान। लोगों को चौफर्दशी (14वें दिन) और अमावस्या के दिन
              उपवास करना चाहिए और उत्तराध्ययन सूत्र को सुनना चाहिए जिसमें भगवान
              महावीर का अंतिम संदेश है। दिवाली की पूरी रात का पाठ करना चाहिए
              श्रमण भगवान महावीर के पवित्र भजन और ध्यान। नए साल के पहले दिन की
              सुबह, भगवान महावीर के पहले शिष्य गणधर गौतम स्वामी को पूर्ण ज्ञान
              प्राप्त हुआ। जैनियों ने नए साल की शुरुआत भगवान गौतम स्वामी की
              महिमा के साथ की ; और नौ स्तोत्र पवित्र भजनों को भक्तिपूर्वक सुनें
              और अपने गुरु महाराज से गौतम स्वामी के शुभ रस (महाकाव्य) को सुनें।
            </div>
          </li>
          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#00a560" }}
          >
            <div class="step">
              <i class="fab fa-creative-commons"></i>
            </div>
            <div className="titleOFFESTIVClass">Bhai Beej</div>
            <div class="contentOFFESTIVALS">
              भाइयों के लिए त्योहार का दिन. जब श्रमण भगवान महावीर के भाई राजा
              नंदिवर्धन अपनी बहन के निर्वाण (मुक्ति की प्राप्ति) के कारण दुःख और
              पीड़ा में डूबे हुए थे, तो सुदर्शन उन्हें अपने घर ले गए और उन्हें
              सांत्वना दी। यह कार्तिक माह के शुक्ल पक्ष के दूसरे दिन हुआ। इस दिन
              को भाई बीज के रूप में मनाया जाता है। यह त्यौहार रक्षाबंधन की तरह
              है. रक्षाबंधन के दिन बहन भाई के पास जाकर रक्षा बांधती है; लेकिन इस
              दिन बहन अपने भाई को सत्कार करने के लिए अपने घर बुलाती है।
            </div>
          </li>

          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#f68121" }}
          >
            <div class="step">
              <i class="fab fa-creative-commons"></i>
            </div>
            <div className="titleOFFESTIVClass">Gyaan Panchami</div>
            <div class="contentOFFESTIVALS">
              (ज्ञान प्राप्ति का पवित्र दिन) ज्ञान पंचमी उस उत्सव को दिया गया
              नाम है जो कार्तिक में शुक्ल पक्ष के 5वें दिन (दिवाली के 5वें दिन)
              मनाया जाता है। यह दिन शुद्ध ज्ञान की आराधना के लिये निश्चित किया
              गया है; और इस दिन ज्ञान की पूजा, उपवास, पौषध का सेवन, देववंदन
              (देवताओं की पूजा करना) किया जाता है। पवित्र पाठ, ध्यान, प्रतिक्रमण
              आदि किये जाते हैं। इसके अतिरिक्त। धार्मिक पुस्तकालयों में संरक्षित
              पुस्तकों को साफ किया जाता है और उनकी पूजा की जाती है।
            </div>
          </li>

          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#ed1c24" }}
          >
            <div class="step">
              <i class="fab fa-creative-commons"></i>
            </div>
            <div className="titleOFFESTIVClass">Ashadh Chaturdasi</div>
            <div class="contentOFFESTIVALS">
              चातुर्मास की पवित्र शुरुआत आषाढ़ माह में शुक्ल पक्ष की 14वीं तिथि
              को होती है। जैन साधु और साध्वियाँ कार्तिक शुक्ल के 14वें दिन तक
              वहीं रहते हैं जहाँ वे उस दिन होते हैं। उन्हें वहीं रहना होगा. इन
              चार महीनों के दौरान. जैनियों में त्याग, तपस्या, धार्मिक अनुष्ठान
              आदि जैसी कई तपस्याएँ आयोजित की जाती हैं। इन दिनों में खाने-पीने को
              लेकर भी कुछ नियम बताए गए हैं।
            </div>
          </li>

          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#582c8b" }}
          >
            <div class="step">
              <i class="fab fa-creative-commons"></i>
            </div>
            <div className="titleOFFESTIVClass">Kartik Poornima</div>
            <div class="contentOFFESTIVALS">
              कार्तिक पूर्णिमा का दिन, आषाढ़ चतुर्दशी से शुरू होने वाला
              चातुर्मास कार्तिक पूर्णिमा के दिन समाप्त होता है। इसके बाद जैन
              साधु और साध्वियां अपनी भ्रमण पदयात्रा यानी पैदल यात्रा शुरू करते
              हैं। इस दिन शत्रुंजय-पालिताना की तीर्थयात्रा का बहुत महत्व माना
              जाता है। इस दिन हजारों जैन तीर्थयात्रा पर जाते हैं। इस दिन को
              कलिकालसर्वज्ञ, आचार्य भगवंत श्रीविजय हेमचंद्रसूरिजी के जन्मदिन के
              रूप में भी मनाया जाता है, जिनका जन्म इसी दिन हुआ था। (विक्रम संवत्
              1134 या 1078 ई. में)।
            </div>
          </li>

          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#0166b4" }}
          >
            <div class="step">
              <i class="fab fa-creative-commons"></i>
            </div>
            <div className="titleOFFESTIVClass">Maun Ekadashi</div>
            <div class="contentOFFESTIVALS">
              (मौन धारण करने का पवित्र दिन) मौन एकादशी मार्गशीर्ष माह में शुक्ल
              पक्ष की रात्रि के 11वें दिन पड़ती है। यह जैनियों के लिए एक
              महत्वपूर्ण दिन है जिस दिन वे पूर्ण मौन-मौन का पालन करते हैं और
              पौषध व्रत, उपवास, देवताओं की पूजा, ध्यान आदि जैसी तपस्या करते हैं।
              यह वह दिन है जिस दिन एक सौ पचास जिनेश्वरों से संबंधित महान घटनाएं
              होती हैं। पवित्र पाठ के माध्यम से मनाया गया। इस दिन से जुड़ी है
              सुव्रत श्रेष्ठी की कहानी.
            </div>
          </li>

          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#00a560" }}
          >
            <div class="step">
              <i class="fab fa-creative-commons"></i>
            </div>
            <div className="titleOFFESTIVClass">Paush Dashami</div>
            <div class="contentOFFESTIVALS">
              यह दिन भगवान पार्श्वनाथ के जन्मदिन के रूप में प्रसिद्ध है। पुष्य
              के 10वें दिन, सैकड़ों और हजारों जैन पुरुष और महिलाएं 3 उपवास-अथम
              (3 दिनों तक लगातार उपवास) की तपस्या करते हैं और पाठ और ध्यान के
              माध्यम से आध्यात्मिक कल्याण प्राप्त करने का प्रयास करते हैं।
              शंखेश्वर में एक भव्य मेला लगता है जो जैनियों का पवित्र स्थान है।
              यहां हजारों लोग एकत्रित होकर अट्ठम की तपस्या करते हैं।
            </div>
          </li>

          <li
            className="festivalSLIlist"
            style={{ "--ol-cards-color-accent": "#f68121" }}
          >
            <div class="step">
              <i class="fab fa-creative-commons"></i>
            </div>
            <div className="titleOFFESTIVClass">Akshay Tritiya</div>
            <div class="contentOFFESTIVALS">
              जो श्रेष्ठ लोग वर्षीतप की तपस्या करते हैं वे इस दिन शत्रुंजय की
              शीतल छाया में गन्ने के रस का सेवन करके तपस्या पूरी करते हैं। भगवान
              ऋषभदेव ने लगातार एक वर्ष तक उपवास करने के बाद इसी दिन पारण (तपस्या
              का समापन) किया था। शत्रुंजय तीर्थ यात्रा पर जाने के लिए यह दिन
              बहुत शुभ माना जाता है। यह वैशाख के शुक्ल पक्ष की तृतीया को पड़ता
              है।
            </div>
          </li>
        </ol>
      </div>
    </>
  );
}

export default Festivals;
