import React, { useEffect, useState } from "react";
import { Link } from "react-router-dom";
import "./JainSects.scss";

function Sects() {
  useEffect(() => {
    ScrollHeight();
    window.addEventListener("resize", ScrollHeight);

    return () => {
      window.removeEventListener("resize", ScrollHeight);
    };
  }, []);

  function ScrollHeight() {
    var content = document.querySelector("#parchment");
    var container = document.querySelector("#contain");
    if (content && container) {
      content.style.height = container.offsetHeight + "px";
    }
  }

  return (
    <>
      <div>
        <div
          className="flx"
          style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
          }}
        >
          <div
            style={{
              display: "flex",
              justifyContent: "center",
              alignItems: "center",
              marginTop: "20px",
              textDecoration: "none",
            }}
          >
            <Link to="/">
              <button
                style={{
                  backgroundImage:
                    "url(https://images.unsplash.com/photo-1546484396-fb3fc6f95f98?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80)",
                  borderRadius: "5px",
                  width: "150px",
                  cursor: "pointer",
                  textDecoration: "none",
                  color: "#fff",
                }}
              >
                Home
              </button>{" "}
            </Link>
          </div>
        </div>
        <div className="verywellknownMain">
          <main>
            <div id="parchment"></div>
            <div id="containingPart">
              <p className="inkTitle">Jain Sects</p>
              <p id="labarum">
                <img
                  src="https://tse1.mm.bing.net/th?id=OIP.gCW9nrXMhTilzvRP9JqtdQHaHd&pid=Api&P=0&h=180"
                  alt="sallekhna"
                  style={{
                    marginBottom: "50px",
                  }}
                />
              </p>
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                जैन धर्म दुनिया के सबसे पुराने धर्मों में से एक है। जैन धर्म को
                श्रमण धर्म, निर्ग्रन्थ धर्म आदि नामों से भी जाना जाता था। यह
                किसी अन्य धर्म की शाखा नहीं है बल्कि एक स्वतंत्र धर्म है जिसे
                अलग-अलग समय अवधि के दौरान इन विभिन्न नामों से पहचाना जाता है।
                इसे जिन तीर्थंकरों द्वारा भी सिखाया गया है जिन्हें जिन भी कहा
                जाता है। जिन के अनुयायी को जैन कहा जाता है और जैनियों द्वारा
                अपनाए जाने वाले धर्म को जैन धर्म कहा जाता है। प्रत्येक तीर्थंकर
                जैन व्यवस्था को पुनर्जीवित करता है। जैन संप्रदाय को जैन संघ के
                नाम से जाना जाता है। वर्तमान जैन संघ की स्थापना भगवान महावीर
                द्वारा की गई थी, जो वर्तमान समय के 24वें और अंतिम तीर्थंकर थे।{" "}
                <br />
                जैन संघ निम्नलिखित चार समूहों से बना है:
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                i)- साधु (भिक्षु) <br />
                ii)-साध्वी (नन) <br />
                iii)- श्रावक (पुरुष गृहस्थ) <br />
                iv)- श्राविकाएं (महिला गृहस्थ)
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                वर्तमान काल के प्रथम तीर्थंकर भगवान ऋषभदेव थे, जिन्हें आदिनाथ भी
                कहा जाता है। अन्य लोकप्रिय तीर्थंकरों के नाम हैं भगवान शांतिनाथ
                (16वें तीर्थंकर), भगवान नेमनाथ (22वें तीर्थंकर), भगवान
                पार्श्वनाथ (23वें तीर्थंकर), और भगवान महावीर (24वें तीर्थंकर)।
                भगवान महावीर हमारे समय के सबसे लोकप्रिय तीर्थंकर हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                भगवान महावीर ने 527 ईसा पूर्व में निर्वाण (सांसारिक अस्तित्व से
                मुक्ति) प्राप्त किया था। उनके ग्यारह गणधर (शिष्य) थे। भगवान
                महावीर के जीवनकाल के दौरान नौ गणधरों ने मुक्ति (मोक्ष) प्राप्त
                की, जबकि अन्य दो गौतमस्वामी और सुधर्मास्वामी जीवित रहे।
                गौतमस्वामी ने पूर्ण ज्ञान और पूर्ण बोध प्राप्त किया और भगवान
                महावीर के निर्वाण की रात ही अरिहंत बन गए। शेष गणधर,
                सुधर्मस्वामी, पूर्ण ज्ञान और पूर्ण धारणा प्राप्त करने वाले अगले
                थे और अरिहंत बन गए। सुधर्मास्वामी के शिष्य जम्बूस्वामी वर्तमान
                आधे समय चक्र के अंतिम अरिहंत थे। जम्बूस्वामी के बाद किसी को भी
                पूर्ण ज्ञान प्राप्त नहीं हुआ और समय बीतने के साथ-साथ ज्ञान
                धीरे-धीरे कम होता गया। भगवान महावीर की शिक्षाएँ उनके गणधरों
                द्वारा शास्त्रों (आगमों) के रूप में हम तक पहुँचाई गईं। उन्हें
                बारह अलग-अलग भागों में संकलित किया गया, जिन्हें द्वादशांगी (बारह
                भाग) के नाम से जाना जाता है। ये बारह रचनाएँ सभी अनुयायियों को
                स्वीकार्य थीं। हालाँकि, द्वादशंगी को लंबे समय तक लिखित रूप में
                नहीं लिखा गया था। जैन विद्यार्थियों ने उन्हें कंठस्थ करके सीखा।
                भगवान महावीर के निर्वाण के लगभग 150 वर्ष बाद 12 वर्षों तक सूखा
                पड़ा। इस दौरान भद्रबाहुस्वामी के साथ कुछ भिक्षु दक्षिण की ओर चले
                गये। सूखा समाप्त होने के बाद कुछ भिक्षु उत्तर की ओर वापस आ गये।
                उन्होंने देखा कि विभिन्न भिक्षुओं द्वारा जैन धर्मग्रंथों के
                मौखिक स्मरण में कुछ विसंगति थी। इससे उन्हें धर्मग्रंथों का संकलन
                करना पड़ा। इसे पूरा करने के लिए, भगवान महावीर के निर्वाण के लगभग
                160 साल बाद पाटलिपुत्र में भिक्षुओं की पहली परिषद (सम्मेलन)
                आयोजित की गई थी। भिक्षु भद्रबाहु, जिन्हें सभी 12 अंगों का ज्ञान
                था, उस बैठक में उपस्थित नहीं हो सके। बाकी भिक्षु स्मरण करके केवल
                पहले ग्यारह अंग ही संकलित कर सके और इस प्रकार, बारहवां अंग खो
                गया। दक्षिण के भिक्षु इस संकलन से सहमत नहीं हुए और जैन धर्म में
                प्रथम विभाजन प्रारम्भ हो गया। जैन दो मुख्य समूहों में विभाजित
                थे, श्वेतांबर और दिगंबर। श्वेतांबर भिक्षु सफेद वस्त्र पहनते थे।
                दिगंबर साधु बिल्कुल भी वस्त्र नहीं पहनते थे।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                जैन संप्रदाय दो प्रमुख संप्रदायों में विभाजित हो गया था।
              </p>
              <br />
              <p>
                1)- श्वेताम्बर सम्प्रदाय
                <br />
                2)- दिगंबर संप्रदाय
              </p>
              <br />
              <h3
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  alignItems: "flex-start",
                  textAlign: "flex-start",
                  fontweight: "600",
                  color: "#281406",
                }}
              >
                श्वेतांबर उप-संप्रदाय -
              </h3>
              <br />
              <p>
                दिगंबर संप्रदाय की तरह, श्वेतांबर संप्रदाय को भी तीन मुख्य
                उप-संप्रदायों में विभाजित किया गया है:
              </p>
              <br />
              <p>
                1)- मूर्तिपूजक,
                <br />
                2)- स्थानकवासी, तथा <br />
                3)-तेरापंथी
              </p>
              <br />
              <h3
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  alignItems: "flex-start",
                  textAlign: "flex-start",
                  fontweight: "600",
                  color: "#281406",
                }}
              >
                मूर्तिपूजक
              </h3>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                श्वेतांबरों के मूल भंडार को मूर्तिपूजक श्वेतांबर के नाम से जाना
                जाता है क्योंकि वे मूर्तियों के पूर्ण उपासक हैं। वे अपनी
                मूर्तियों पर फूल, फल, केसर आदि चढ़ाते हैं और हमेशा उन्हें समृद्ध
                वस्त्रों और रत्नों से सुसज्जित आभूषणों से सजाते हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                उनके साधु बोलते समय अपना मुँह कपड़े की पट्टियों से ढक लेते हैं,
                अन्यथा उन्हें अपने हाथ में रखते हैं। वे मंदिरों में या विशेष रूप
                से आरक्षित इमारतों में रहते हैं जिन्हें उपाश्रय कहा जाता है। वे
                श्रावकों या गृहस्थों के घरों से अपने कटोरे में भोजन इकट्ठा करते
                हैं और अपने रहने के स्थान पर खाते हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                मूर्तिपूजक उप-संप्रदाय को (i) पुजेरा (उपासक), (ii) डेरावासी
                (मंदिर निवासी) जैसे शब्दों से भी जाना जाता है। (iii) चैत्यवासी
                (मंदिर निवासी) और (iv) मंदिर-मार्गी (मंदिर जाने वाले)
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                मूर्तिपूजक श्वेतांबर बड़े शहरी केंद्रों में व्यावसायिक
                उद्देश्यों के लिए पूरे भारत में बिखरे हुए पाए जाते हैं, फिर भी
                वे ज्यादातर गुजरात में केंद्रित हैं।
              </p>
              <br />
              <h3
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  alignItems: "flex-start",
                  textAlign: "flex-start",
                  fontweight: "600",
                  color: "#281406",
                }}
              >
                स्थानकवासी
              </h3>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                स्थानकवासी सीधे तौर पर श्वेतांबरों से नहीं बल्कि एक पुराने
                सुधारक संप्रदाय, अर्थात जैन धर्म के लोंका संप्रदाय के सुधारकों
                के रूप में उभरे। इस लोनका संप्रदाय की स्थापना लगभग 1474 ई. में
                अहमदाबाद के एक अमीर और पढ़े-लिखे व्यापारी लोनकाशाह ने की थी। इस
                संप्रदाय का मुख्य सिद्धांत मूर्ति-पूजा न करना था। बाद में, लोंका
                संप्रदाय के कुछ सदस्यों ने अपने तपस्वियों के जीवन के तरीकों को
                अस्वीकार कर दिया, यह घोषणा करते हुए कि वे महावीर की अपेक्षा से
                कम सख्ती से रहते थे। लोंका संप्रदाय के एक आम आदमी, सूरत के
                विराजी ने यति, यानी एक तपस्वी के रूप में दीक्षा प्राप्त की, और
                अपने जीवन की कठोरता के कारण बहुत प्रशंसा हासिल की। लोंका
                संप्रदाय के कई लोग इस सुधारक में शामिल हो गए और उन्होंने
                स्थानकवासी का नाम लिया, जिसका अर्थ है कि जो लोग अपनी धार्मिक
                गतिविधियाँ मंदिरों में नहीं करते हैं, बल्कि स्थानक नामक स्थानों
                में अपने धार्मिक कर्तव्यों का पालन करते हैं जो प्रार्थना-कक्ष की
                तरह होते हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                स्थानकवासियों को (ए) ढुंढिया (खोजकर्ता) और (बी) साधुमार्गी
                (साधुओं के अनुयायी, यानी तपस्वी) के रूप में भी कहा जाता है।
                मूर्ति-पूजा के महत्वपूर्ण बिंदु को छोड़कर, स्थानकवासी अन्य
                श्वेतांबर जैनों से बहुत अलग नहीं हैं और इसलिए आजकल वे हमेशा खुद
                को श्वेतांबर स्थानकवासी कहते हैं। हालाँकि, स्थानकवासी के बीच कुछ
                अंतर हैं; और कुछ धार्मिक प्रथाओं के पालन में मूर्तिपूजक
                श्वेतांबर। स्थानकवासी मूर्ति-पूजा में बिल्कुल विश्वास नहीं करते।
                जैसे कि उनके पास मंदिर नहीं हैं, बल्कि केवल स्थानक हैं, यानी
                प्रार्थना कक्ष, जहां वे अपने धार्मिक व्रत, त्योहार, प्रथाएं,
                प्रार्थनाएं, प्रवचन आदि करते हैं। इसके अलावा, स्थानकवासी सभी के
                लिए अपने मुंह को कपड़े की पट्टियों से ढकते हैं। समय और वे पीले
                या किसी अन्य रंग के कपड़े का उपयोग नहीं करते (बेशक, सफेद को
                छोड़कर)। इसके अलावा, स्थानकवासी श्वेतांबर के केवल 31 ग्रंथों की
                प्रामाणिकता को स्वीकार करते हैं। इसके अलावा, स्थानकवासी तीर्थ
                स्थानों में विश्वास नहीं रखते हैं और मूर्तिपूजक श्वेतांबर के
                धार्मिक त्योहारों में भाग नहीं लेते हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                श्वेतांबर स्थानकवासी भारत के विभिन्न व्यापारिक केंद्रों में भी
                फैले हुए हैं लेकिन वे मुख्य रूप से गुजरात, पंजाब, हरियाणा और
                राजस्थान में पाए जाते हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                यह ध्यान रखना दिलचस्प है कि दो गैर-मूर्तिपूजक उप-संप्रदाय,
                अर्थात्, दिगंबरों के बीच तरणपंथी और श्वेतांबरों के बीच
                स्थानकवासी, जैन चर्च के इतिहास में बहुत देर से आए और कुछ हद तक
                यह सुरक्षित रूप से कहा जा सकता है कि मोहम्मडन उनके उत्थान के लिए
                भारत के धार्मिक मन पर प्रभाव काफी हद तक जिम्मेदार था। इस संबंध
                में श्रीमती एस. स्टीवेन्सन कहती हैं: “हालांकि, मोहम्मडन विजय का
                एक प्रभाव यह था कि कई जैनियों को मूर्तिभंजकों के सामने अपने साथी
                मूर्ति-पूजकों के साथ घनिष्ठता के लिए प्रेरित किया गया था। दूसरा
                प्रभाव दूसरों को मूर्तिपूजा से पूरी तरह दूर करना था। कोई भी
                प्राच्यवासी मूर्तिपूजा के खिलाफ किसी ओरिएंटला के भावुक आक्रोश को
                बिना किसी संदेह के नहीं सुन सकता था कि इस प्रथा की धार्मिकता
                उसके मन में प्रवेश कर रही थी, स्वाभाविक रूप से गुजरात के
                अहमदाबाद शहर में, जो सबसे अधिक मुस्लिम प्रभाव में था, हम सबसे
                पहले इस हलचल का पता लगा सकते हैं। इन शंकाओं का. लगभग 1474 ई. में
                लोंका संप्रदाय, गैर-मूर्तिपूजक जैन संप्रदायों में से पहला, उभरा
                और उसके बाद 1653 ई. के आसपास ढुंढिया या स्थानकवासी संप्रदाय का
                उदय हुआ, जो यूरोप में लूथरन और प्यूरिटन आंदोलनों के साथ
                आश्चर्यजनक रूप से मेल खाता है। (दिल ऑफ जैनिज्म, पृष्ठ 19)
              </p>
              <br />
              <h3
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  alignItems: "flex-start",
                  textAlign: "flex-start",
                  fontweight: "600",
                  color: "#281406",
                }}
              >
                तेरापंथी
              </h3>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                तेरापंथी उप-संप्रदाय स्थानकवासी से लिया गया है; अनुभाग। तेरापंथी
                उपसंप्रदाय की स्थापना स्वामी भिक्कनजी महाराज ने की थी। स्वामी
                भिक्कनजी पहले एक स्थानकवासी संत थे और उन्होंने अपने गुरु, जिनका
                नाम आचार्य रघुनाथ था, से दीक्षा ली थी। स्थानकवासी तपस्वियों की
                धार्मिक प्रथाओं के कई पहलुओं पर स्वामी भिक्कनजी का अपने गुरु के
                साथ मतभेद था और जब इसने गंभीर रूप ले लिया, तो उन्होंने वी.एस.
                में आषाढ़ महीने की पूर्णिमा के दिन तेरापंथ की स्थापना की। 1817,
                यानी, 1760 ई.
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                जैसा कि आचार्य भक्कनजी ने 13 धार्मिक सिद्धांतों पर जोर दिया,
                अर्थात्, (i) पांच महाव्रत (महान व्रत), (ii) पांच समितियां
                (विनियम) और (iii) तीन गुप्ति (नियंत्रण या संयम), उनके
                उप-संप्रदाय को इस नाम से जाना जाता था तेरा (अर्थ तेरह)-पंथ
                उप-संप्रदाय। इस संबंध में यह ध्यान रखना दिलचस्प है कि
                उप-संप्रदाय के लिए तेरापंथ शब्द के उपयोग की दो अन्य व्याख्याएँ
                दी गई हैं। एक लेख के अनुसार, यह उल्लेख किया गया है कि चूंकि पंथ
                की स्थापना के समय इसमें केवल 13 भिक्षु और 13 आम लोग थे, इसलिए
                इसे तेरा (अर्थात् तेरह) - पंथ कहा जाता था। कभी-कभी तेरापंथ शब्द
                की अन्य व्याख्या भी इसके अनुयायियों द्वारा दी जाती है। तेरा का
                अर्थ है तुम्हारा और पंथा का अर्थ है पथ; दूसरे शब्दों में, इसका
                अर्थ है, “ओह! भगवान महावीर! यह आपका मार्ग है”।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                तेरापंथी मूर्तिपूजक नहीं हैं और एक आचार्य अर्थात धार्मिक प्रमुख
                के पूर्ण निर्देशन में बहुत ही सूक्ष्मता से संगठित होते हैं। 200
                से अधिक वर्षों के अपने इतिहास में, तेरापंथ में संस्थापक आचार्य
                भिक्कनजी से लेकर प्रथम आचार्य और वर्तमान आचार्य तुलसी से लेकर
                9वें आचार्य तक केवल 9 आचार्यों का उत्तराधिकार हुआ है।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                केवल एक आचार्य द्वारा संपूर्ण पंथ को विनियमित करने की यह प्रथा
                तेरापंथ की एक विशिष्ट विशेषता बन गई है और अन्य पंथों द्वारा
                अनुकरण के लिए एक उदाहरण बन गई है। उल्लेखनीय है कि तेरापंथ के सभी
                भिक्षु और भिक्षुणियाँ अपने आचार्य के आदेशों का निष्ठापूर्वक पालन
                करते हैं, उनके मार्गदर्शन में उपदेश देते हैं और उनके निर्देशों
                के अनुसार सभी धार्मिक गतिविधियाँ करते हैं। इसके अलावा, तेरापंथ
                नियमित रूप से एक उल्लेखनीय त्योहार मनाता है जिसे मर्यादा महोत्सव
                के नाम से जाना जाता है। यह विशिष्ट त्योहार हर साल माघ महीने के
                शुक्ल पक्ष के 7वें दिन मनाया जाता है जब सभी तपस्वी और सामान्य
                शिष्य, पुरुष और महिलाएं, एक पूर्व निर्धारित स्थान पर एक साथ
                मिलते हैं और तेरापंथियों की विभिन्न समस्याओं पर चर्चा करते हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                तेरापंथियों की तपस्या अत्यंत कठोर मानी जाती है। तेरापंथी
                साधु-साध्वियों की वेशभूषा स्थानकवासी साधु-साध्वियों के समान होती
                है। लेकिन मुहपट्टी यानी मुंह पर हमेशा रखे रहने वाले सफेद कपड़े
                के टुकड़े की लंबाई में अंतर होता है। तेरापंथियों का मानना है कि
                मूर्तिपूजा से मुक्ति नहीं मिलती और वे ध्यान के अभ्यास को महत्व
                देते हैं। इसके अलावा, इस बात पर जोर दिया जा सकता है कि तेरापंथ
                अपने अनुशासित संगठन के लिए जाना जाता है, जिसमें एक आचार्य (यानी,
                धार्मिक प्रमुख), एक आचार संहिता और एक विचारधारा होती है।
                तेरापंथियों को सुधारवादी माना जाता है क्योंकि वे धर्म में सरलता
                पर जोर देते हैं। उदाहरण के लिए, तेरापंथी अपने भिक्षुओं के लिए
                मठों का निर्माण भी नहीं करते हैं, जो घर के एक हिस्से में रहते
                हैं जिसे गृहस्थ अपने लिए बनाते हैं। हाल ही में उनके धर्मगुरु
                आचार्य तुलसी ने अणुव्रत आंदोलन यानी लघु व्रत आंदोलन शुरू किया
                था. जो भारत में जनता के नैतिक उत्थान के लिए जैनियों के
                आध्यात्मिक सिद्धांतों का उपयोग करने का प्रयास करता है।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                तेरापंथ का उदय श्वेतांबर संप्रदाय में अंतिम बड़ा विभाजन है और यह
                पंथ लोकप्रिय हो रहा है। तेरापंथी अभी भी संख्या में सीमित हैं और
                भले ही वे भारत के विभिन्न शहरों में देखे जाते हैं, वे मुख्य रूप
                से राजस्थान के बीकानेर, जोधपुर और मेवाड़ क्षेत्रों में केंद्रित
                हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                साधु (भिक्षु) और साध्वी (नन) वे लोग हैं जिन्होंने स्वेच्छा से
                अपने घरेलू जीवन और सांसारिक मामलों को त्याग दिया है और
                आध्यात्मिक पथ पर अपनी आत्मा के उत्थान के लिए पांच प्रमुख व्रत
                स्वीकार किए हैं। वे अपने लिए निर्धारित नियमों का सख्ती से पालन
                करते हैं। दूसरी ओर, श्रावक और श्राविकाएं सांसारिक जीवन जीना जारी
                रखते हैं। वे उनके लिए निर्धारित बारह छोटी प्रतिज्ञाओं का पूर्ण
                या सीमित सीमा तक पालन कर सकते हैं।
              </p>
              <br />
              <h3
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  alignItems: "flex-start",
                  textAlign: "flex-start",
                  fontweight: "600",
                  color: "#281406",
                }}
              >
                दिगंबर उप-संप्रदाय
              </h3>
              <br />
              <p>
                हाल की शताब्दियों में दिगंबर संप्रदाय को निम्नलिखित
                उप-संप्रदायों में विभाजित किया गया है:
              </p>{" "}
              <br />
              <p>प्रमुख उप-संप्रदाय:</p>
              <br />
              <p>
                1)- बीसपंथा <br />
                2)- तेरापंथ <br />
                3)- तेरापंथ या सामैयापंथ
              </p>
              <br />
              <p>लघु उप-संप्रदाय:</p>
              <br />
              <p>
                1)- गुमानपंथा <br />
                2)- तोतापंथा
              </p>
              <br />
              <h3
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  alignItems: "flex-start",
                  textAlign: "flex-start",
                  fontweight: "600",
                  color: "#281406",
                }}
              >
                दिगंबर उप-संप्रदाय
              </h3>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                बीसपंथ के अनुयायी धर्म-गुरुओं का समर्थन करते हैं, यानी भट्टारक
                के नाम से जाने जाने वाले धार्मिक अधिकारी, जो जैन मठों के प्रमुख
                भी हैं। धार्मिक मठ. बीसपंथी अपने मंदिरों में तीर्थंकरों की
                मूर्तियों के अलावा क्षेत्रपाल, पद्मावती और अन्य देवताओं की
                मूर्तियों की भी पूजा करते हैं। वे इन पूजाओं को करते समय केसर,
                फूल, फल, मिठाई, सुगंधित 'अगरबत्ती' यानी अगरबत्ती आदि से इन
                मूर्तियों की पूजा करते हैं। बीसापंथी जमीन पर बैठते हैं और खड़े
                नहीं होते। वे रात में भी मंदिर में आरती करते हैं, यानी मूर्ति के
                ऊपर रोशनी लहराते हैं और प्रसाद यानी मूर्तियों को चढ़ाई गई मीठी
                चीजें वितरित करते हैं। कुछ लोगों के अनुसार, बीसपंथ, दिगंबर
                संप्रदाय का मूल रूप है और आज व्यावहारिक रूप से महाराष्ट्र,
                कर्नाटक और दक्षिण भारत के सभी दिगंबर जैन और राजस्थान और गुजरात
                से बड़ी संख्या में दिगंबर जैन बीसपंथ के अनुयायी हैं।
              </p>
              <br />
              <h3
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  alignItems: "flex-start",
                  textAlign: "flex-start",
                  fontweight: "600",
                  color: "#281406",
                }}
              >
                तेरापंथ
              </h3>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                तेरापंथ का उदय उत्तर भारत में विक्रम संवत 1683 में भट्टारकों के
                प्रभुत्व और आचरण के विरुद्ध विद्रोह के रूप में हुआ। यानी दिगंबर
                जैनों के धार्मिक अधिकारी। इस उप-संप्रदाय के परिणामस्वरूप,
                भट्टारक संस्था ने उत्तर भारत में सम्मान खो दिया, हालाँकि दक्षिण
                भारत में भट्टारक एक महत्वपूर्ण भूमिका निभाते रहे। तेरापंथी अपने
                मंदिरों में तीर्थंकरों की मूर्तियाँ स्थापित करते हैं, न कि
                क्षेत्रपाल, पद्मावती और अन्य देवताओं की। आगे। वे मूर्तियों की
                पूजा फूलों, फलों और अन्य हरी सब्जियों (जिन्हें सचित्त चीजें कहा
                जाता है) से नहीं, बल्कि 'अक्षत' नामक पवित्र चावल, लौंग, चंदन,
                बादाम, सूखे नारियल, खजूर आदि से करते हैं। एक नियम के रूप में वे
                अराह नहीं करते हैं। या उनके मंदिरों में प्रसाद वितरित करते हैं।
                फिर पूजा करते समय वे खड़े ही रहते हैं, बैठते नहीं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                बीसापंथियों के साथ इन मतभेदों से यह स्पष्ट है कि तेरापंथी सुधारक
                प्रतीत होते हैं। वे विभिन्न धार्मिक प्रथाओं के विरोधी हैं। जैसा
                कि उनके अनुसार. ये वास्तविक जैन प्रथाएँ नहीं हैं। तेरापंथ ने
                दिगंबरों को स्वच्छंद भट्टारकों के चंगुल से बचाने का बहुमूल्य
                कार्य किया था और इसलिए तेरापंथियों का दिगंबर जैन समुदाय में एक
                विशिष्ट स्थान है। तेरापंथी उत्तर प्रदेश, राजस्थान और मध्य प्रदेश
                में अधिक संख्या में हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                यह ध्यान देने योग्य है कि भले ही तेरापंथ उप-संप्रदाय का नाम
                दिगंबर और श्वेतांबर दोनों संप्रदायों में दिखाई देता है। फिर भी
                दोनों तेरापंथी एक दूसरे से सर्वथा भिन्न हैं। जहां दिगंबर
                तेरापंथी नग्नता और मूर्ति-पूजा में विश्वास करते हैं, वहीं
                श्वेतांबर तेरापंथी इन दोनों के काफी विरोधी हैं।
              </p>
              <br />
              <h3
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  alignItems: "flex-start",
                  textAlign: "flex-start",
                  fontweight: "600",
                  color: "#281406",
                }}
              >
                तारणापंथा
              </h3>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                उप-संप्रदाय तारापंथ को इसके संस्थापक तराना-स्वामी या
                तराना-तारण-स्वामी (1448-1515 ई.) के नाम पर जाना जाता है। इस
                उप-संप्रदाय को समैयापंथ भी कहा जाता है क्योंकि इसके अनुयायी
                सरनाय यानी पवित्र पुस्तकों की पूजा करते हैं, मूर्तियों की नहीं।
                तराना-स्वामी की मृत्यु मध्य प्रदेश के पूर्व ग्वालियर राज्य के
                मल्हारागढ़ में हुई, और यह तरानापंथियों का केंद्रीय तीर्थ स्थान
                है।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                तारापंथी मूर्तिपूजा का दृढ़ता से खंडन करते हैं लेकिन उनके अपने
                मंदिर हैं जिनमें वे पूजा के लिए अपनी पवित्र पुस्तकें रखते हैं।
                वे पूजा के समय फल और फूल जैसी वस्तुएं नहीं चढ़ाते हैं। दिगंबरों
                की पवित्र पुस्तकों के अलावा, वे अपने संस्थापक तरण-स्वामी द्वारा
                लिखी गई चौदह पवित्र पुस्तकों की भी पूजा करते हैं। इसके अलावा,
                तारापंथी आध्यात्मिक मूल्यों और पवित्र साहित्य के अध्ययन को अधिक
                महत्व देते हैं। इसीलिए हम उनमें बाहरी धार्मिक प्रथाओं का पूर्ण
                अभाव पाते हैं। इसके अलावा, तराना-स्वामी; जाति-भेद के सख्त खिलाफ
                थे और उन्होंने अपने उप-संप्रदाय के दरवाजे मुसलमानों और निचली
                जाति के लोगों के लिए भी खोल दिए थे।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                तारापंथियों के ये तीन मुख्य लक्षण, अर्थात्, (ए) मूर्ति पूजा के
                प्रति घृणा, (बी) बाहरी धार्मिक प्रथाओं की अनुपस्थिति, और (सी)
                जाति भेद पर प्रतिबंध, धार्मिक मान्यताओं और प्रथाओं के खिलाफ
                विद्रोह के रूप में विकसित हुए थे। दिगंबर जैन संप्रदाय में
                प्रचलित, और ऐसा प्रतीत होता है कि तरण-स्वामी ने इन सिद्धांतों को
                इस्लामी सिद्धांतों और श्वेतांबर संप्रदाय के गैर-मूर्तिपूजक
                स्थानकवासी उप-संप्रदाय के संस्थापक लोंकाशाह की शिक्षाओं के
                प्रत्यक्ष प्रभाव के तहत तैयार किया होगा।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                तरानापंथी संख्या में कम हैं और वे ज्यादातर बुन्देलखण्ड, मध्य
                प्रदेश के मालवा क्षेत्र और महाराष्ट्र के खानदेश क्षेत्र तक ही
                सीमित हैं।
              </p>
              <br />
              <h3
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  alignItems: "flex-start",
                  textAlign: "flex-start",
                  fontweight: "600",
                  color: "#281406",
                }}
              >
                गुमानपंथ
              </h3>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                गुमनापंथ इतना महत्वपूर्ण नहीं है और वास्तव में इसके बारे में
                बहुत कम जानकारी है। ऐसा कहा जाता है कि इस उप-संप्रदाय की शुरुआत
                पंडित गुमानी राम या गुमानी राय ने की थी, जो राजस्थान में जयपुर
                के निवासी पंडित टोडारामल के पुत्र थे।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                इस पंथ के अनुसार, जैन मंदिरों में मोमबत्तियाँ या दीपक जलाना सख्त
                वर्जित है, क्योंकि यह इसे जैन धर्म के मूल सिद्धांत, अर्थात
                अहिंसा का उल्लंघन मानता है। वे केवल मंदिरों में जाकर प्रतिमा
                देखते हैं और उन्हें कोई चढ़ावा नहीं चढ़ाते।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                यह पंथ शुद्ध आम्नाय के नाम से प्रसिद्ध हुआ, जो कि शुद्ध या
                पवित्र परंपरा है, क्योंकि इसके अनुयायियों ने हमेशा आचरण की
                शुद्धता और आत्म-अनुशासन और नियमों के कड़ाई से पालन पर जोर दिया।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                गुमनापंथ की उत्पत्ति 18वीं में हुई। शताब्दी ई.पू. और मुख्य रूप
                से उसी शताब्दी के दौरान फला-फूला। यह राजस्थान के कई हिस्सों में
                प्रचलित था और अब यह राजस्थान के जयपुर के आसपास के कुछ इलाकों में
                पाया जाता है।
              </p>
              <br />
              <h3
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  alignItems: "flex-start",
                  textAlign: "flex-start",
                  fontweight: "600",
                  color: "#281406",
                }}
              >
                तोतापंथ
              </h3>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                तोतापंथ बीसपंथ और तेरापंथ उप-संप्रदायों के बीच मतभेद के
                परिणामस्वरूप अस्तित्व में आया। बीसा (यानी बीस) पंथ और तेरा (यानी
                तेरह) पंथ के बीच समझौता कराने के लिए कई ईमानदार प्रयास किए गए और
                परिणाम साढ़ेसोलाहा (यानी साढ़े सोलह)-पंथ या 'तोतापंथ' था। यही
                कारण है कि सधेसो!अहा पंथ या तोतापंथ के अनुयायी कुछ हद तक बीसपंथ
                और कुछ हद तक तेरापंथ के सिद्धांतों में विश्वास करते हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                तोतापंथी संख्या में बहुत कम हैं और मध्य प्रदेश के कुछ हिस्सों
                में पाए जाते हैं।
              </p>
              <br />
              <p
                style={{
                  lineHeight: "60px",
                  letterSpacing: "3px",
                }}
              >
                दिगंबर संप्रदाय में प्रचलित प्रमुख एवं लघु उपसंप्रदायों के
                वृत्तांत के संबंध में। यह ध्यान देने योग्य है कि हाल के वर्षों
                में दिगंबर संप्रदाय में 'कांजी-पंथ' के नाम से जाना जाने वाला एक
                नया प्रमुख उप-संप्रदाय बन रहा है, जिसमें कांजी स्वामी के अनुयायी
                शामिल हैं और विशेष रूप से शिक्षित वर्गों के बीच लोकप्रिय हो रहा
                है। संत कांजी स्वामी (जिनसे 'कांजी-पंथ' नाम लिया गया है), जन्म
                से श्वेतांबर-स्थानकवासी थे, दक्षिण भारत के महान दिगंबर जैन संत
                आचार्य कुंड-कुंड के पुराने पवित्र ग्रंथों को लोकप्रिय बनाने में
                काफी हद तक सफल रहे। लेकिन आचार्य कुंद कुंद के लेखन की व्याख्या
                करते समय कांजी स्वामी के प्रयासों में, व्यवहार-नय की तुलना में
                निश्चय-नय, यानी यथार्थवादी दृष्टिकोण को अधिक प्रमुखता देना,
                यानी, व्यावहारिक दृष्टिकोण, दिगंबरों द्वारा अनुमोदित नहीं हैं।
                सामान्यतः क्योंकि वे मानते हैं कि दोनों दृष्टिकोण समान महत्व के
                हैं। हालाँकि, कांजीपंथ का प्रभाव लगातार बढ़ रहा है और गुजरात में
                सोनागढ़ शहर और राजस्थान में जयपुर कांजीपंथियों की विभिन्न
                धार्मिक गतिविधियों के केंद्र बन गए हैं।
              </p>
              <br />
              <p className="cachet">
                <img src="https://i.postimg.cc/4NBYNqCR/22.png" alt="Cachet" />
              </p>
            </div>
          </main>

          <svg>
            <filter id="wavy2">
              <feTurbulence
                x="0"
                y="0"
                baseFrequency="0.02"
                numOctaves="5"
                seed="1"
              />
              <feDisplacementMap in="SourceGraphic" scale="20" />
            </filter>
          </svg>
        </div>
      </div>
    </>
  );
}

export default Sects;
