const storiesData = [
  {
    id: "story1",
    name: "Aimutta Muni (अइमुत्ता मुनि)",
    imageUrl:
      "https://1.bp.blogspot.com/-zv-M9VEif3E/XXOwTNFw8fI/AAAAAAAAGw4/M7Uh2rtn2aALbtg406WGQkc-XCtggtgiQCLcBGAs/s1600/aimutta%2B3.jpg",
    content: `पोलासपुर की गलियों में अइमुत्ता नाम का छह साल का बच्चा अपने कुछ दोस्तों के साथ खेल रहा था। वह राजा विजय और रानी श्रीमती के पुत्र थे। खेलते समय, उन्होंने एक साधु, गौतमस्वामी, नंगे पैर और गंजे को
    देखा, जो भिक्षा (भोजन) ले रहे थे। अइमुत्ता दौड़कर उसके पास गया और
    उसे भोजन लेने के लिए अपने घर आने के लिए आमंत्रित किया, जिससे उसकी
    मां और वह खुश हो जाएंगे। गौतमस्वामी सहमत हो गए और वे महल में जाने
    के लिए निकल पड़े। अइमुत्ता की मां, रानी श्रीमती बगीचे की ओर बालकनी
    में खड़ी थीं। उसने गौतमस्वामी और अइमुत्ता को अपने स्थान पर आते
    देखा। वह बहुत खुश हुई और गौतमस्वामी का स्वागत करने के लिए नीचे आई।
    उसने पूरी भक्ति के साथ उनका स्वागत किया और कहा, "माथेनाम वंदामि
    (आपको मेरा नमस्कार)।" उन्होंने अइमुत्ता को गौतमस्वामी का परिचय
    भगवान महावीर के कट्टर शिष्य के रूप में कराया। उसने अइमुत्ता से कहा
    कि वह जाकर गौतमस्वामी को अर्पित करने के लिए अपना पसंदीदा भोजन ले
    आए। अइमुत्ता ने लड्डू लाए और उन्हें एक बर्तन में डालना शुरू कर
    दिया, हालांकि गौतमस्वामी ने कहा कि उन्हें इतने सारे की आवश्यकता
    नहीं है। अइमुत्ता भिक्षु को भोजन देकर बहुत प्रसन्न हुआ। जैसे ही
    गौतमस्वामी जाने लगे, अइमुत्ता ने कहा, "आपका बैग भारी है, मुझे इसे
    आपके लिए ले जाने दीजिए।" गौतमस्वामी ने कहा, "ऐमुत्त, मैं इसे
    तुम्हें नहीं दे सकता, क्योंकि इसे केवल वे ही धारण कर सकते हैं
    जिन्होंने दीक्षा ली है।" अइमुत्ता ने पूछा, "दीक्षा क्या है?" गौतम
    स्वामी ने उन्हें समझाया कि जब कोई आध्यात्मिक मार्ग अपनाना चाहता है
    तो उसे अपना घर, परिवार और अन्य सभी सामाजिक और आर्थिक संबंधों को
    छोड़ना होगा। फिर वह साधु बन जाता है और इस प्रक्रिया को दीक्षा कहा
    जाता है। गृहस्थ जीवन में होने वाली हिंसा से बचने के लिए लोग दीक्षा
    लेते हैं। उस तरह के जीवन में, लोग हर मिनट विभिन्न गतिविधियों में
    शामिल होते हैं जो कर्म संचय का कारण बनते हैं। दूसरी ओर, एक साधु ये
    काम नहीं करता। इस प्रकार भिक्षु और भिक्षुणियाँ गृहस्थों की अधिकांश
    पापपूर्ण गतिविधियों से बच सकते हैं। अइमुत्ता उत्सुक हो गया और
    पूछा, “गुरुदेव, आप पाप नहीं करते! लेकिन क्या आपको खाने की ज़रूरत
    नहीं है? क्या आपको रहने के लिए जगह की आवश्यकता नहीं है? ये सब पाप
    का कारण बनते हैं”। गौतमस्वामी बच्चे की सीखने की रुचि से प्रसन्न
    थे, इसलिए उन्होंने समझाया, “हम भोजन लेते हैं, लेकिन हम वह भोजन
    स्वीकार नहीं करते जो विशेष रूप से हमारे लिए बनाया गया है। हम एक
    जगह पर रहते हैं, लेकिन उस पर हमारा स्वामित्व नहीं होता, और हम वहां
    कुछ दिनों से अधिक नहीं रुकते। हम पैसा नहीं रखते हैं, और हम व्यापार
    या किसी संगठन में भाग नहीं लेते हैं। इस प्रकार एक साधु के रूप में
    हमें कोई भी ऐसा कार्य नहीं करना है जो पाप का कारण बनता हो।
    अइमुत्ता ने कहा, "गुरुदेव, उस स्थिति में, मैं दीक्षा लेना चाहता
    हूं।" कुछ ही देर में अइमुत्ता और गौतमस्वामी वहाँ पहुँचे जहाँ भगवान
    महावीर उपदेश दे रहे थे। अइमुत्ता उनकी शिक्षाओं को सुनने के लिए
    दूसरों के साथ शामिल हो गया। उस उपदेश में, अइमुत्ता ने सीखा कि जीवन
    क्या है और यदि कोई व्यक्ति इस सांसारिक कष्टों से छुटकारा पाना
    चाहता है तो वह क्या कर सकता है। अइमुत्ता ने एक बार फिर भगवान
    महावीर से दीक्षा स्वीकार करने की इच्छा व्यक्त की। भगवान महावीर ने
    कहा, "हम तुम्हारे माता-पिता की अनुमति के बिना तुम्हें दीक्षा नहीं
    दे सकते।" अइमुत्ता ने उत्तर दिया, "यह आसान है, मैं घर जाऊंगा और
    उनकी अनुमति लूंगा और वापस आऊंगा।" इसलिए अइमुत्ता घर चला गया। उसने
    अपनी माँ से कहा, “माँ, मैं दीक्षा लेना चाहता हूँ। याद है आप कहते
    थे कि हमारा सामाजिक जीवन हिंसा से भरा है और पाप का कारण बनता है?
    गौतमस्वामी और भगवान महावीर ने भी यही कहा था। मैं पापों से मुक्त
    होना चाहता हूं. अत: कृपया मुझे दीक्षा लेने की अनुमति दें।”
    अइमुत्ता की माँ उसकी बातों से आश्चर्यचकित रह गई। वह मन ही मन उसके
    पापों के भय और दीक्षा लेने की इच्छा से प्रसन्न थी क्योंकि वह भी एक
    धार्मिक महिला थी। लेकिन वह आश्वस्त होना चाहती थी कि अइमुत्ता समझ
    गई है कि "दीक्षा लेने" का क्या मतलब है। तो उन्होंने कहा, “बेटा,
    दीक्षा लेना कोई खेल नहीं है. यह बहुत कठिन और अनुशासित जीवन है।
    आपकी देखभाल करने के लिए कोई माँ या पिता नहीं है। आप इस तरह की
    पीड़ा को कैसे संभाल पाएंगे?” अइमुत्ता ने कहा, “माँ, इस सामाजिक
    जीवन में भी बहुत कष्ट हैं। कम से कम हम जानते हैं कि एक भिक्षु के
    रूप में कष्ट कर्मों को नष्ट करने और मोक्ष की ओर ले जाने में मदद
    करेंगे। यह सुनकर उनकी मां बहुत खुश हुईं. लेकिन वह अइमुत्ता को और
    परखना चाहती थी। उसने कहा, “बेटा, तुम इतनी जल्दी में क्यों हो? कुछ
    देर रुको. जब हम बूढ़े हो जायेंगे तो तुम्हें हमारी देखभाल करनी होगी
    और तुम्हारा अपना परिवार भी होगा।” अइमुत्ता ने कहा, “माँ, मैंने
    भगवान महावीर से सीखा कि न कोई जवान है और न ही कोई बूढ़ा है। मैंने
    यह भी सीखा कि कोई नहीं जानता कि कल क्या होने वाला है। कोई नहीं
    जानता कि पहले या आखिरी में कौन मरेगा। तो क्यों इंतज़ार करें और इस
    अवसर को गँवाएँ जो मुझे मिला है।” उनकी माँ को बहुत खुशी हुई कि उनका
    बेटा पूरी तरह से समझ गया है कि दीक्षा का क्या मतलब है और उसका
    लक्ष्य क्या है। उन्होंने कहा, “बधाई हो मेरे बेटे. मुझे तुम पर गर्व
    है। आप एक अच्छे साधु होंगे. यह मत भूलो कि आपका लक्ष्य मोक्ष
    प्राप्त करना है, और जीवन भर अहिंसा का पालन करना सुनिश्चित करें। हम
    तुम्हें दीक्षा लेने की अनुमति दे देंगे।” अइमुत्ता ने कहा,
    “धन्यवाद, माँ। मैं आपकी सलाह याद रखूंगा।” अइमुत्ता की मां ने
    उन्हें आशीर्वाद दिया और उनके नए जीवन में सफलता की कामना की।
    उन्होंने अपने पिता राजा विजय से अनुमति लेने में भी मदद की। कुछ
    दिनों के बाद, उन्हें दीक्षा दी गई, और वे "बालमुनि (युवा भिक्षु)
    अइमुत्ता" नामक भिक्षु बन गए। कुछ समय बाद, एक दिन बाथरूम से वापस
    आते समय बालमुनि अइमुत्ता ने देखा कि कुछ बच्चे कागज की नाव के साथ
    पानी के पोखर में खेल रहे थे। वह खेलने को लेकर उत्साहित हो गया और
    भूल गया कि एक भिक्षु के रूप में वह पानी से नहीं खेल सकता। इसलिए वह
    बच्चों की ओर दौड़ा और पूछा कि क्या वह उनके साथ खेल सकता है। बच्चे
    भी एक भिक्षु को अपने साथ खेलने के लिए उत्साहित हो गए और बोले,
    "हाँ।" उसने अपने पास मौजूद बर्तन का ढक्कन हटा दिया और उसे नाव की
    तरह चलाने लगा। वह कह रहा था, “देखो, मेरी नाव भी चल रही है।” इसी
    बीच अन्य भिक्षु वहां आ गये और उन्होंने उसे पानी से खेलते हुए देख
    लिया। वे उसके पास आये और बोले, “बालमुनि, तुम क्या कर रहे हो? क्या
    आप भूल गए कि एक भिक्षु के रूप में आप पानी से नहीं खेल सकते? पानी
    के साथ खिलवाड़ करके हमने कई जलीय जीवों को नुकसान पहुंचाया है। हमने
    किसी भी जीव-जंतु को कष्ट न देने का प्रण लिया है। यह तो बड़ी बुरी
    बात है। तुमने अपनी प्रतिज्ञा तोड़ दी है और पाप संचित कर लिया है।”
    बालमुनि अइमुत्ता को अपनी गलती का एहसास हुआ। वह तुरंत पश्चाताप करने
    लगा, “ओह! मैने क्या कि? मैंने अपनी माँ से वादा किया कि मैं कोई भी
    पापपूर्ण कार्य नहीं करूँगा। मैं कितना पापी हूँ? ये साधु कितने
    अच्छे हैं जो मुझे मेरी गलती याद दिलाते हैं! यदि ये भिक्षु न आये
    होते या मुझे न देखा होता तो क्या होता?” उसने जो किया उसके लिए उसे
    ईमानदारी से पछतावा था। वह अन्य भिक्षुओं के साथ चला गया। प्रत्येक
    भिक्षु को बाहर से अपने स्थान पर वापस आने के बाद इरियावाहियम सूत्र
    का पाठ करना होता है। तो बालमुनि ने भी यह सूत्र सुनाया। जब वह भाग
    में आया, "पनक्कमने, बेयक्कमने, पनाग-दगा-मत्ती... (यदि मैंने पानी,
    हरी घास, मिट्टी के किसी भी जीवित प्राणी को चोट पहुंचाई है,... तो
    मैं क्षमा मांग रहा हूं," उसके पश्चाताप की कोई सीमा नहीं थी। उसे
    अपने किये पर बहुत पछतावा हुआ। वह सोचने लगा, "मैंने क्या किया?
    मैंने इतने सारे प्राणियों का विनाश किया है। मैं इन पापों से कैसे
    मुक्त हो सकता हूँ? मैं भगवान महावीर को अपना मुँह कैसे दिखा सकता
    हूँ? हे प्राणियों , मैंने तुम्हें नुकसान पहुंचाया है। कृपया मुझे
    मेरे पापों के लिए क्षमा करें। मैं ये पाप दोबारा कभी नहीं करूंगा।"
    इस सच्चे पश्चाताप ने उनके लिए अच्छा किया। उनके सभी विनाशकारी कर्म
    नष्ट हो गए और उन्हें केवलज्ञान (सर्वज्ञता या पूर्ण ज्ञान) प्राप्त
    हुआ। वह बन गए। केवली. इसके बाद केवली ऐमुत्त मुनि भगवान महावीर की
    सभा में गए और वहां बैठे अन्य केवलियों की ओर चलने लगे। कुछ वरिष्ठ
    मुनियों ने इस पर ध्यान दिया और वे उनसे कहने लगे, “ओह, अइमुत्ताजी!!
    आप कहां जा रहे हैं? वह केवलियों के बैठने का स्थान है। यहाँ आओ जहाँ
    अन्य भिक्षु बैठे हैं। भगवान महावीर ने उन्हें टोकते हुए कहा,
    भिक्षुओं, तुम्हें केवली का अपमान नहीं करना चाहिए। अइमुत्ता मुनि अब
    कोई साधारण साधु नहीं हैं. इरियावहीयम सूत्र का पाठ करते समय,
    उन्होंने अपने सभी घटी (विनाशकारी) कर्मों को नष्ट कर दिया, और केवली
    बन गए। भिक्षुओं को अपनी गलती का एहसास हुआ और उन्होंने सोचा, "केवली
    बनने के लिए उम्र की कोई बाधा नहीं है।" अपना शेष जीवन समाप्त करने
    के बाद, बालमुनि अइमुत्ता को मोक्ष प्राप्त हुआ।`,
  },
  {
    id: "story2",
    name: "Anand Shravak (आनंद श्रावक)",
    imageUrl: "http://shrimad.com/images/st_anandshravak.jpg",
    content: `     वाणिज्य नगरी में एक बार जितशत्रु नाम का एक राजा रहता था। उसी नगर
    में आनंद नाम का एक धनी गृहस्थ भी रहता था। आनंद अरबपति थे. वह इतना
    अमीर था कि उसके पास 4 मिलियन सोने के सिक्के, इतनी ही मात्रा में
    नकदी थी, उसने इतनी ही राशि व्यापार, आभूषणों और अन्य संपत्तियों में
    निवेश की थी। उनके पास 40,000 गायें भी थीं। राजा के साथ-साथ नगर के
    लोग भी उसका बहुत सम्मान करते थे। एक दिन, भगवान महावीर ने इस शहर का
    दौरा किया और उपदेश दिया। भगवान महावीर का उपदेश सुनने के बाद आनंद
    ने गृहस्थ के बारह व्रतों को स्वीकार करने का निर्णय लिया। चौदह
    वर्षों तक उन प्रतिज्ञाओं का पालन करने के बाद आनंद ने सांसारिक
    मामलों को त्यागने का फैसला किया। इसलिए उन्होंने अपने बच्चों को
    बुलाया और अपनी सारी व्यावसायिक और पारिवारिक ज़िम्मेदारियाँ उन्हें
    सौंप दीं और उनसे कहा कि वे उन्हें अपनी आध्यात्मिक खोज में न रोकें।
    वह अपना शेष जीवन तपस्या और ध्यान में बिताने वाले थे। कुछ समय के
    बाद, तपस्या करने, शुद्ध मानसिक स्थिति और अपनी आत्मा की शुद्धता के
    परिणामस्वरूप, उन्हें अवधिज्ञान (सीमित दिव्य ज्ञान) प्राप्त हुआ।
    हुआ यूँ कि भगवान महावीर और उनके शिष्य शहर में थे। एक दिन, जब
    गौतमस्वामी भिक्षा (भोजन) लेने गए, तो उन्होंने लोगों को आनंद के
    खराब स्वास्थ्य के बारे में बात करते हुए सुना, और कहा कि आनंद को
    अवधीज्ञान प्राप्त हो गया है। इसलिए गौतमस्वामी ने आनंद जाने का
    फैसला किया। जब गौतमस्वामी आये तो आनंद ने बिस्तर पर लेटे हुए उन्हें
    प्रणाम किया। उन्होंने गौतमस्वामी को अपने अवधिज्ञान के बारे में
    बताया और कहा कि वह बारहवें देवलोक (स्वर्ग या दिव्य निवास) तक देख
    सकते हैं। गौतमस्वामी ने आनंद से कहा कि यद्यपि एक गृहस्थ के लिए ऐसा
    ज्ञान प्राप्त करना संभव है, लेकिन इतनी दूर तक देखना संभव नहीं
    होगा। उन्होंने आनंद से कहा कि उन्हें झूठ बोलने के लिए प्रायश्चित
    (पश्चाताप) करना चाहिए। आनंद हैरान था क्योंकि वह सच कह रहा था। वह
    अपने आध्यात्मिक गुरु की अवज्ञा नहीं करना चाहता था, लेकिन साथ ही
    उसने सोचा कि सच बोलने के लिए पश्चाताप करना उचित नहीं है। इसलिए
    उन्होंने आदरपूर्वक गौतमस्वामी से पूछा, "गुरुजी, क्या किसी के सच
    बोलने पर भी पश्चाताप करना आवश्यक है?" गौतमस्वामी ने कहा, "नहीं।"
    गौतमस्वामी को अभी भी आनंद पर विश्वास नहीं हुआ, इसलिए वे कुछ
    स्पष्टीकरण प्राप्त करने के लिए भगवान महावीर के पास वापस गए।
    गौतमस्वामी ने भगवान महावीर को आनंद के साथ अपनी बातचीत के बारे में
    बताया। महावीरस्वामी ने कहा, “गौतम, आनंद सही कह रहे हैं। उसे ऐसा
    अवधिज्ञान प्राप्त हो गया है कि वह उतनी दूर तक देख सकता है। आप जैसा
    ज्ञानी व्यक्ति ऐसी गलती कैसे कर सकता है? आप ही वह व्यक्ति हैं
    जिन्हें उनसे माफ़ी मांगनी चाहिए।” गौतमस्वामी को अपनी गलती का एहसास
    हुआ और वे तुरंत आनंद के पास जाकर माफी मांगी। आनंद इस बात से बहुत
    खुश थे कि भगवान महावीर ने सत्य का पक्ष लिया, न कि अपने पहले शिष्य
    गौतमस्वामी का। उन्हें इस बात की भी ख़ुशी थी कि गौतमस्वामी जैसे
    महान भिक्षु, जिनके पास बहुत ऊँची उपलब्धियाँ थीं, क्षमा माँगने के
    लिए वापस आए। वह अपने धर्म और इसका पालन करने वाले भिक्षुओं के बारे
    में बहुत दृढ़ता से महसूस करते थे। आनंद ने मृत्यु तक उपवास किया और
    सौधर्म देवलोक (एक स्वर्गीय क्षेत्र) में एक स्वर्गीय देवदूत के रूप
    में पुनर्जन्म लिया। उस स्वर्गीय जीवन के पूरा होने के बाद, वह
    महाविदेह में एक मानव के रूप में पुनर्जन्म लेगा और वहां से मुक्ति
    प्राप्त करेगा। मानव जीवन का सार बारह व्रतों में से एक या अधिक
    व्रतों का दैनिक जीवन में अभ्यास करना है। यह कहानी हमें बताती है कि
    कैसे गृहस्थों (श्रावकों) को सत्य, धर्म में आस्था रखनी चाहिए और
    अपने गुरुओं की गलतियों को विनम्रतापूर्वक सुधारना चाहिए। इससे यह भी
    पता चलता है कि गौतमस्वामी कितने सरल, विनम्र और भगवान महावीर के
    सच्चे अनुयायी थे। जब भगवान महावीर ने अपनी गलती बताई, तो गौतमस्वामी
    बिना किसी तर्क के माफी मांगने के लिए आनंद के पास गए, भले ही वह
    महावीरस्वामी के पहले शिष्य थे। इससे यह भी पता चलता है कि भगवान
    महावीर कितने निष्पक्ष थे, क्योंकि यह उनके पहले शिष्य की गलती थी,
    फिर भी उन्होंने इसे छुपाया नहीं। इसके विपरीत, उन्होंने सत्य का
    पक्ष लिया और गौतमस्वामी को उनकी गलती बताई।`,
  },
  {
    id: "story3",
    name: "Damanak (दमनक)",
    imageUrl:
      "https://tse3.mm.bing.net/th?id=OIP.MnNYT2VzywHaiXj5Ku9sIgHaLF&pid=Api&P=0&h=180",
    content: `     बहुत समय पहले राजपुर नगर में कुलपुत्र नाम का एक व्यक्ति रहता था।
    उनके एक घनिष्ठ मित्र जैनदास थे जो जैन धर्म का पालन करते थे। एक दिन
    कुलपुत्र अपने मित्र के साथ अपने आध्यात्मिक गुरु का उपदेश सुनने
    गया। वह साधु द्वारा बताए गए अहिंसा के सिद्धांत से प्रभावित हुए और
    उन्होंने चाहे जो भी हो, मछली न खाने की शपथ लेने का फैसला किया।
    जल्द ही शहर में भयंकर सूखा पड़ गया। अनाज दुर्लभ हो गया, इसलिए शहर
    के अधिकांश लोग भोजन के रूप में मछली पर निर्भर रहे। बहुत पहले ही,
    सख्त से सख्त शाकाहारियों ने भी अपना आहार बदल लिया। मछली भोजन का
    मुख्य स्रोत बन गई। इस स्थिति ने कुलपुत्र की प्रतिज्ञा के प्रति
    प्रतिबद्धता को चुनौती दी। कई दिन ऐसे गुजरे कि घर में खाने को भी
    नहीं मिलता था, लेकिन उन्होंने अपनी प्रतिज्ञा नहीं तोड़ी। एक दिन
    उसकी पत्नी निराश होकर बोली, “क्या तुम्हें दिखाई नहीं देता कि हमारे
    बच्चे भूखे मर रहे हैं? क्या आप उनके लिए महसूस नहीं करते? कृपया कुछ
    मछलियाँ खरीद लें, ताकि मैं उन्हें खिला सकूँ।” कुलपुत्र ने उससे
    कहा, “मेरे प्रिय, हम हमारी रक्षा के लिए अन्य प्राणियों का जीवन
    नहीं छीन सकते। हम शाकाहारी हैं. मैं अपने बच्चों से प्यार करता हूँ,
    लेकिन उसी तरह मैं सभी जीवित प्राणियों से भी प्यार करता हूँ।”
    आख़िरकार, कुलपुत्र का बहनोई उसे परिवार के लिए मछली पकड़ने के लिए
    नदी के किनारे ले गया। कुलपुत्र बहुत दुखी हुआ और उसने गहरे अफसोस के
    साथ अपना जाल पानी में फेंक दिया। उसे आश्चर्य हुआ जब उसने सबसे अधिक
    मछलियाँ पकड़ीं। लेकिन जब वह उन्हें पानी से बाहर खींच रहा था तो
    उसने देखा कि मछलियाँ बेचैन और बेचैन थीं। वह उनकी पीड़ा सहन नहीं कर
    सका, इसलिए उसने उन्हें रिहा कर दिया। उसने तीन बार कोशिश की और हर
    बार वैसा ही किया। अब उससे बर्दाश्त नहीं हो रहा था. इसलिए वह चला
    गया और मृत्यु तक अनशन पर बैठ गया। उनकी मृत्यु के बाद, उनका जन्म
    राजगृही शहर में व्यापारी मनिहार के पुत्र के रूप में हुआ और उनका
    नाम दमनक रखा गया। मनिहार अपार धन-संपत्ति वाला एक धनी व्यक्ति था।
    जब दमनक आठ साल का था, तब शहर में एक महामारी फैल गई और दमनक को
    छोड़कर उसका पूरा परिवार मर गया। दमनक की देखभाल करने वाला कोई नहीं
    बचा था। थोड़े ही समय में उसका धन नष्ट हो गया और वह एक गरीब अनाथ
    लड़का बन गया। एक दिन सागरपोट नामक व्यापारी ने उसे अपने घर में
    आश्रय दिया। कुछ समय बाद एक दिन एक साधु सागरपोट के घर भिक्षा के लिए
    आये। भिक्षु ने दमनक को देखा और कहा कि उसके अच्छे कर्म शीघ्र ही
    परिपक्व होने वाले हैं, और वह जल्द ही घर का मुखिया होगा। सागरपॉट ने
    कुछ नहीं कहा क्योंकि उन्हें यह विचार नापसंद था कि उनका भाग्य गरीब
    लड़के दमनक को विरासत में मिलेगा। वह चाहते थे कि उनका असली बेटा घर
    का अगला मुखिया बने। इसलिए, उसने दमनक को मारने का फैसला किया। एक
    दिन उसने कसाई को बुलाया और दमनक को जंगल में ले जाकर मार डालने का
    आदेश दिया। कसाई लड़के को जंगल में ले गया, और जैसे ही वह उसे मारने
    वाला था, लड़के के चेहरे पर मासूमियत के भाव ने उसका मन बदल दिया।
    उसने दमनक को नहीं मारा, लेकिन सागरपॉट को यह दिखाने के लिए कि उसने
    उसे मार डाला है, उसने दमनक की छोटी उंगली काट दी और उसे जंगल में
    छोड़ दिया। उसने लड़के से कहा कि वह चला जाए, और फिर कभी उस क्षेत्र
    में न लौटे। दमनक जंगल में भटकने लगा और जल्द ही उसकी नजर एक गाय
    चराने वाले पर पड़ी। उसने अपनी कहानी गाय चराने वाले को बताई। गाय
    चराने वाले को उसके प्रति सहानुभूति महसूस हुई और उसने दमनक को अपने
    साथ रहने के लिए आमंत्रित किया। इससे दमनक के जीवन में एक नया अध्याय
    शुरू हुआ। कई वर्ष बीत गए और दमनक एक युवा व्यक्ति बन गया। एक दिन,
    व्यापार के सिलसिले में यात्रा करते समय, सागरपॉट उस स्थान पर रुका
    जहाँ दमनक रहता था। उसने उस युवक को देखा और तुरंत उसे पसंद कर लिया।
    जब सागरपॉट ने उसके बारे में और पूछताछ की तो उसे पता चला कि यह युवक
    वही लड़का है जिसे वह मारना चाहता था। उसका गुस्सा फिर से बढ़ गया और
    उसने तुरंत दमनक को मारने की योजना बनाई। उसने गाय चराने वाले से
    पूछा कि क्या वह उस युवक को अपना संदेश अपने घर वापस ले जाने के लिए
    छोड़ सकता है। सागरपॉट ने दमनक को अपने बेटे को देने के लिए एक पत्र
    दिया। दमनक अपना काम करने के लिए चला गया। जैसे ही दमनक राजगृही शहर
    के बाहरी इलाके में पहुंचा, वह थक गया। उन्होंने एक मंदिर देखा और
    आराम करने का फैसला किया। उसने पत्र अपने पास छोड़ दिया और सो गया।
    हुआ यूं कि उनके सो जाने के बाद सागरपोत की बेटी बीसा मंदिर में आई।
    उसने दमनक के पास पत्र देखा। वह उत्सुक हो गई और उसने उसे देखा। उसे
    आश्चर्य हुआ कि यह उसके भाई को संबोधित था। उसकी जिज्ञासा और भी बढ़
    गई, इसलिए उसने पत्र पढ़ा। वह यह जानकर हैरान रह गई कि उसके पिता ने
    लिखा था, "यह लड़का जैसे ही वहां ऐ, उसको बिस दे देना" यानी, "जैसे
    ही यह लड़का वहां पहुंचे, उसे जहर दे देना।" ये बात वो समझ नहीं पाई.
    उसने युवक की ओर देखा, वह बहुत सुंदर था और मासूम लग रहा था। उसे
    उससे प्यार हो गया और वह उससे शादी करना चाहती थी। इसलिए, उसने संदेश
    बदल दिया, "यह लड़का जैसा ही वहां ऐ, उसको बीसा दे देना," जिसका अर्थ
    है, "जैसे ही यह लड़का वहां पहुंचे, उसे बीसा (उसकी बेटी) दे देना।"
    फिर उसने पत्र को वहीं रख दिया जहां वह था और चली गई। युवक ने पत्र
    सागरपॉट के बेटे को दिया। उनके बेटे ने संदेश पढ़ा और हैरान था कि
    उसके पिता उसे अपनी बहन की शादी दमनक से करने के लिए क्यों कहेंगे।
    लेकिन चूंकि यह उनके पिता की इच्छा थी, इसलिए उन्होंने इसका पालन
    किया। दमनक भी असमंजस में था, लेकिन उसे बीसा पसंद थी, इसलिए वह साथ
    चला गया। बीसा के भाई ने बड़े उत्सव के साथ उसका विवाह रचाया। <br/> 
    
    जब सागरपॉट घर वापस आया और उसे पता चला कि क्या हुआ, तो वह मन ही मन
    बहुत क्रोधित हुआ। लेकिन उन्होंने ये गुस्सा किसी से जाहिर नहीं
    किया. उसने एक बार फिर दमनक, जो अब उसका दामाद है, को मारने की साजिश
    रची। सागरपॉट ने उसे मारने के लिए किसी को काम पर रखा था। एक दिन,
    सभी लोग एक पार्टी में गये। कुछ देर बाद दमनक को थकान महसूस हुई,
    इसलिए उसने जल्दी घर जाने का फैसला किया। जब वह घर पहुंचा तो घर पर
    ताला लगा मिला। इसलिए वह बरामदे पर सोफे पर आराम करने लगा। मारने
    वाले आदमी ने उसका पीछा किया, लेकिन उसे लगा कि दमनक एक मजबूत आदमी
    था और बिना किसी चीज के उसे मारना आसान नहीं होगा। इसलिए वह तलवार
    लेने के लिए घर गया। इतने में दमनक उठकर टहलने चला गया। जब दमनक टहल
    रहा था, उसका बहनोई (सागरपोट का बेटा) घर पर आया। उसे भी घर बंद मिला
    और उसने बरामदे पर सोफे पर आराम करने का फैसला किया। उसे जल्द ही
    नींद आ गयी. मारने वाला आदमी वापस आया और बिना कुछ सोचे-समझे उस आदमी
    की गर्दन पर तलवार से वार किया और उसका सिर काट दिया। कुछ देर बाद जब
    परिवार के बाकी लोग घर आए तो उन्हें खून से लथपथ शव मिला। वे यह
    जानकर हैरान रह गए कि यह बीसा का भाई था जो मारा गया था। सागरपॉट को
    अब एहसास हुआ कि वह युवक की नियति (कर्मों का भाग्य) बदलने की कोशिश
    कर रहा था, और यही कारण है कि वह दमनक को मारने में सफल नहीं हुआ। वह
    जल्द ही नरम पड़ गया और उसने दमनक के भाग्य को स्वीकार करने का फैसला
    किया। उनकी पत्नी और उन्होंने सभी घरेलू और व्यावसायिक मामले दमनक को
    सौंपने का फैसला किया। दमनक ने कई वर्षों तक अपना कर्तव्य निभाया और
    सदैव सुखी रहा।`,
  },
  {
    id: "story4",
    name: "Dharma Kumar (धर्म कुमार)",
    imageUrl: "",
    content: `बहुत समय पहले जम्बूद्वीप में कमलापुर नामक एक नगर था। उस नगर के राजा का नाम सहाराक्ष था। एक दिन राजा के दरबार में एक ज्योतिषी आया। राजा ने ज्योतिषी से पूछा कि क्या वह जानता है कि भविष्य में क्या होने वाला है। ज्योतिषी ने एक शब्द भी नहीं कहा। राजा ने उससे दूसरी बार पूछा। उसने राजा से कहा, “भयानक अकाल पड़ने वाला है और यह पूरे नगर को नष्ट कर देगा।”
    राजा को यह सुनना अच्छा नहीं लगा। उन्होंने अपने मंत्रियों को बुलाया और उनसे एक ऐसी योजना बनाने को कहा जिससे वे लोगों को बचा सकें। मंत्रियों ने सुझाव दिया कि उन्हें जितना संभव हो उतना अनाज खरीदना चाहिए. राजा ने अपना खजाना खाली कर दिया और जितना हो सके उतना अनाज खरीदा। उसने आने वाले बुरे दिनों के लिए अनाज का भंडारण किया।
    बाद में आषाढ़ (जून-जुलाई) के महीने में आकाश काले बादलों से घिर गया। राजा ने आसमान की ओर देखा और सोचा कि बारिश होगी। ये और बाद में अन्य बादल लोगों के लिए अच्छी फसल उगाने के लिए पर्याप्त बारिश लेकर आए। एक तरह से राजा प्रजा के लिए खुश था लेकिन साथ ही वह इस बात से भी हैरान था कि ज्योतिषी की भविष्यवाणी गलत क्यों निकली।
    कुछ दिनों बाद राजा का माली एक सन्देश लेकर राजा के पास आया। संदेश यह था कि एक जैन मुनि मानसून अवधि के लिए अपने शाही पार्क में रहना चाहेंगे। मुनि केवलज्ञानी (सर्वज्ञ) थे, जो एक ही समय में भूत, वर्तमान और भविष्य सब जानते हैं।
    राजा ने संदेश के लिए माली को इनाम दिया और नगर के लोगों से ऋषि का स्वागत करने को कहा। राजा मुनि के दर्शन करने गये और उनके पवित्र वचन सुने। राजा ने पूछा, “ज्योतिषी की बातें सच कैसे नहीं हो सकतीं?” 
    मुनि ने राजा से कहा, “तुम्हारे नगर में एक धर्मात्मा के जन्म लेने के कारण अकाल टल गया है। ज्योतिषी को यह नहीं पता था।”
    राजा ने उससे इस पुण्यात्मा के पिछले जीवन के बारे में बताने को कहा।
    मुनि ने कहा. “भारत भूमि में पुरीमातला नामक एक नगर था। नगर में एक धनवान व्यक्ति रहता था, जो अचानक बीमार हो गया। उन्होंने अपने स्वास्थ्य को सुधारने की पूरी कोशिश की, लेकिन सफल नहीं हुए। एक दिन उनकी मुलाकात एक साधु से हुई और उपदेश सुनने के बाद, उन्होंने अपना नियमित आहार छोड़ने का फैसला किया और केवल बिना किसी मसाले या नमक के पकाया हुआ साधारण भोजन ही खाया। उन्होंने नियमित ध्यान करने और ब्रह्मचर्य का पालन करने का भी निर्णय लिया। कुछ ही दिनों में उनके स्वास्थ्य में सुधार हो गया। उनकी प्रतिज्ञा अब और मजबूत हो गई, इसलिए उन्होंने अपना आहार, ध्यान और ब्रह्मचर्य जारी रखा।
    बाद में, शहर में अकाल पड़ा और उसने अपनी सारी संपत्ति लोगों को खिलाने के लिए इस्तेमाल की। इससे लोगों को अकाल से बचने में मदद मिली। अपना जीवन समाप्त करने के बाद, उन्होंने एक देवता (स्वर्गीय देवदूत) के रूप में पुनर्जन्म लिया और वहां से, उन्होंने आपके शहर में सुबुद्धि नामक एक श्राविका के पुत्र के रूप में पुनर्जन्म लिया।
    यह सुनकर राजा बहुत प्रसन्न हुआ। वह पवित्र आत्मा को सम्मान देने के लिए सुबुद्धि के घर गए। उन्होंने बच्चे को देखा और उसे आशीर्वाद दिया और उसे धर्मकुमार (राजकुमार या धर्म का पुत्र) नाम दिया।
    जब धर्मकुमार बड़ा हुआ तो उसने एक सुन्दर, धार्मिक, युवा स्त्री से विवाह किया। अपने बाद के वर्षों में, वह भिक्षुओं के पवित्र संघ में शामिल हो गए और तपस्या और ध्यान करने के बाद, उन्होंने केवलज्ञान प्राप्त किया और मुक्त हो गए।`,
  },
  {
    id: "story5",
    name: "Chandanbala (चंदनबाला)",
    imageUrl:
      "https://tse1.mm.bing.net/th?id=OIP.FZ0HBKSTFvn58p-Jglf8uAHaIq&pid=Api&P=0&h=180",
    content: `एक बार वसुमती नाम की एक खूबसूरत राजकुमारी थी। वह चंपापुरी के राजा दधिवाहन और रानी धारिणी की बेटी थीं।

    एक दिन चम्पापुरी के राजा और निकटवर्ती कौशांबी के राजा के बीच युद्ध छिड़ गया। यह एक दुखद युद्ध था. वसुमती के पिता युद्ध नहीं जीत सके इसलिए उन्हें निराश होकर भागना पड़ा। जब वसुमती और उसकी माँ को पता चला कि वे युद्ध हार गए हैं, तो उन्होंने भी भागने का फैसला किया। जब वे जंगल में भाग रहे थे, तभी शत्रु सेना के एक सैनिक ने उन्हें देख लिया और उन दोनों को पकड़ लिया। वसुमती और उसकी माँ डर गईं। उन्हें नहीं पता था कि सिपाही उनके साथ क्या करेगा. उसने बड़ी महिला (मां) से कहा कि वह उससे शादी करेगा, और वह वसुमती को बेच देगा। यह सुनकर रानी सदमे में चली गई और मर गई। सिपाही को तुरंत अपनी टिप्पणी पर खेद हुआ और उसने आगे से कोई टिप्पणी न करने का निर्णय लिया। वह वसुमती को बेचने के लिए कौशाम्बी ले गया।
    
    जब वसुमती को दासी के रूप में बेचने की बारी आई, तो धनवाह नाम का एक व्यापारी वहां से गुजर रहा था। उन्होंने वसुमती को बिकते हुए देखा और उन्हें लगा कि वह कोई साधारण लड़की नहीं है। उसने सोचा कि शायद वह अपने माता-पिता से अलग हो गई होगी, और यदि उसे दासी के रूप में बेच दिया गया, तो उसका भाग्य क्या होगा? इसलिए उस पर दया करके, धनवाह ने वसुमती को खरीद लिया, उसे गुलामी से मुक्त कर दिया और अपने घर ले गया। घर जाते समय उसने उससे पूछा, “तुम कौन हो? आपके माता-पिता को क्या हुआ? कृपया मुझसे डरें नहीं. मैं तुम्हें अपनी बेटी की तरह मानूंगा।” वसुमती ने कोई उत्तर नहीं दिया।
    
    जब वे घर पहुँचे, तो व्यापारी ने अपनी पत्नी मूला को वसुमती के बारे में बताया। “मेरे प्रिय,” उसने कहा, “मैं इस लड़की को घर ले आया हूँ। उन्होंने अपने अतीत के बारे में कुछ नहीं कहा है. कृपया, उसे हमारी बेटी की तरह मानें।” वसुमती को राहत मिली. उसने व्यापारी और उसकी पत्नी को आदरपूर्वक धन्यवाद दिया। व्यापारी का परिवार उससे बहुत खुश था। उन्होंने उसका नाम चंदनबाला रखा, क्योंकि वह किसी को अपना असली नाम नहीं बताती थी।
    
    व्यापारी के घर पर रहते हुए चंदनबाला का व्यवहार पुत्री के समान था। इससे व्यापारी बहुत खुश हुआ। दूसरी ओर, मूला सोच रही थी कि उसका पति चंदनबाला के साथ क्या करेगा। उसने सोचा कि वह उसकी सुंदरता के कारण उससे शादी करेगा। इसलिए, मूला चंदनबाला के साथ कभी भी सहज नहीं थी।
    
    एक धूप वाले दिन, जब व्यापारी अपनी दुकान से घर आया, तो वह नौकर जो आमतौर पर उसके पैर धोता था, वहाँ नहीं था। चंदनबाला ने यह देखा, और उनके लिए किए गए सभी पितातुल्य अच्छे कामों के लिए उनके पैर धोने का मौका पाकर उन्हें खुशी महसूस हुई। जब वह व्यापारी के पैर धोने में व्यस्त थी, तभी उसके बाल हेयर पिन से छूट गये। व्यापारी ने यह देखा तो उसे लगा कि कहीं उसके बाल गंदे न हो जाएं। इसलिए उसने उसके बाल उठाए और उसे उसके सिर के पीछे क्लिप कर दिया। मूला ने यह सब देखा और क्रोधित हो गया। उसे लगा कि चंदनबाला के बारे में उसका संदेह सच था। मूला ने जल्द से जल्द चंदनबाला से छुटकारा पाने का फैसला किया।
    
    जब धनवाह तीन दिन की व्यापारिक यात्रा पर गए, तो उनकी पत्नी ने चंदनबाला से छुटकारा पाने का मौका उठाया। उसने तुरंत चंदनबाला के सारे खूबसूरत बाल काटने के लिए एक नाई को बुलाया। फिर उसने चंदनबाला के पैरों को भारी जंजीरों से बांध दिया और उसे घर के मुख्य क्षेत्र से दूर एक दूर के कमरे में बंद कर दिया। उसने सभी नौकरों से कहा कि वे व्यापारी को यह न बताएं कि चंदनबाला कहाँ है, अन्यथा वह उनके साथ भी ऐसा ही करेगी। फिर मूला अपने माता-पिता के घर जाने के लिए निकल गई।
    
    जब दानवाह अपनी यात्रा से वापस लौटे, तो उन्हें न तो मूला और न ही चंदनबाला दिखाई दीं। उसने नौकरों से उनके बारे में पूछा। नौकरों ने उसे बताया कि मूला अपने माता-पिता के घर पर थी, लेकिन उन्होंने उसे यह नहीं बताया कि मूला के डर के कारण चंदनबाला कहाँ थी।
    
    उन्होंने चिंतित स्वर में नौकरों से पूछा, “मेरी बेटी चंदनबाला कहाँ है?” बेहतर होगा कि आप अब बोलें, क्योंकि अगर आप सच छिपा रहे हैं, तो आपको नौकरी से निकाल दिया जाएगा।' फिर भी किसी ने उत्तर नहीं दिया. वह बहुत परेशान था और उसे समझ नहीं आ रहा था कि क्या करे। कुछ मिनटों के बाद एक वृद्ध नौकर ने सोचा, “मैं एक बूढ़ी औरत हूँ और उम्र के कारण जल्द ही मर जाऊँगी। वैसे भी मूला इससे बुरा और क्या कर सकता है।” इसलिए चंदनबाला के प्रति दया और व्यापारी के प्रति सहानुभूति के कारण उसने उसे वह सब बताया जो मूला ने चंदनबाला के साथ किया था।
    
    वह व्यापारी को उस कमरे में ले गई जहां चंदनबाला को बंद कर दिया गया था। धनवाह ने दरवाजा खोला और चंदनबाला को देखा। जब उसने उसे देखा तो वह चौंक गया। उन्होंने चंदनबाला से कहा, ''मेरी प्यारी बेटी, मैं तुम्हें यहां से निकाल लूंगा. तुम्हें भूख लगी होगी, मुझे तुम्हारे लिए कुछ खाना ढूंढ़ने दो।” वह उसके लिए खाना ढूँढ़ने के लिए रसोई में गया। उसने पाया कि वहाँ कोई खाना नहीं बचा था, केवल एक पैन में कुछ सूखी दालें बची थीं। व्यापारी ने फिलहाल उसे वही खिलाने का फैसला किया। इसलिए वह उन्हें चंदनबाला के पास ले गए। उसने उससे कहा कि वह भारी जंजीरों को काटने के लिए एक लोहार को बुलाने जा रहा है और इसलिए वह चला गया।
    
    चंदनबाला इस बात से आश्चर्यचकित थी कि चीजें कैसे चल रही थीं। वह सोचने लगी कि भाग्य किस प्रकार जीवन को अमीर से लगभग असहाय बना सकता है। फिर चंदनबाला ने खाने से पहले किसी और को दाल देने के बारे में सोचा। वह उठी और दरवाजे के पास चली गई, और एक पैर बाहर और एक पैर अंदर रखकर खड़ी हो गई।
    
    उसे आश्चर्य हुआ, जब उसने एक साधु (भगवान महावीर) को अपने कमरे के पास घूमते देखा। उसने कहा, "हे आदरणीय भिक्षु, कृपया यह भोजन स्वीकार करें जो आपके लिए उपयुक्त है।" लेकिन भगवान महावीर ने तब तक उपवास करने का संकल्प लिया था जब तक कोई व्यक्ति कुछ शर्तों को पूरा नहीं कर लेता और उन्हें भोजन नहीं देता। उनकी शर्तें थीं, 1) जो व्यक्ति चढ़ावा देगी वह राजकुमारी होनी चाहिए, 2) उसका सिर गंजा होना चाहिए, 3) वह जंजीरों में जकड़ी होनी चाहिए, 4) उसे कच्ची दाल चढ़ानी चाहिए, एक पैर घर के अंदर और दूसरा बाहर रखना चाहिए , 5) और उसे आंसुओं में डूब जाना चाहिए। इसलिए, भगवान महावीर ने उसकी ओर देखा और देखा कि उनकी पूर्व-निर्धारित शर्तों में से एक अभी भी गायब थी। उन्होंने अपनी आंखों में आंसू के अलावा सभी शर्तों को पूरा किया और इसलिए भगवान महावीर आगे बढ़े। चंदनबाला को बहुत दुःख हुआ और उसके चेहरे से आँसू बहने लगे। वह दुखी थी कि भले ही उसे भिक्षु को भोजन देने का मौका मिला, लेकिन उसने इसे स्वीकार नहीं किया। उसने रोते हुए स्वर में एक बार फिर साधु से भोजन स्वीकार करने का अनुरोध किया। भगवान महावीर ने उसकी आंखों में आंसू देखे और यह जानकर कि उनकी सभी शर्तें पूरी हो गई हैं, भोजन स्वीकार करने के लिए वापस आ गए। चनादा ने दाल भगवान महावीर के हाथ में रख दी और संतुष्ट हो गए।

    जब भगवान महावीर अपने पूर्व-संस्कार की तलाश में थे, तब उन्होंने पांच महीने और पच्चीस दिनों तक उपवास किया था। स्वर्गीय देवदूतों ने भगवान महावीर के उपवास की समाप्ति का जश्न मनाया। देवदूतों की शक्ति से, चंदनबाला की जंजीरें टूट गईं, उसके बाल वापस उग आए और उसे एक राजकुमारी के रूप में तैयार किया गया। तेज़ संगीत और उत्सव ने राजा शतानीकंद का ध्यान आकर्षित किया। वह अपने परिवार, मंत्रियों और अन्य लोगों के साथ इस स्थान पर आये थे। एक पुराने नौकर संपुल ने चंदनबाला को पहचान लिया। वह उसकी ओर बढ़ा, प्रणाम किया और फूट-फूट कर रोने लगा। राजा शतानीकन्द ने पूछा, “क्यों रो रहे हो?” संपुल ने उत्तर दिया, "महाराज, यह चंपापुरी की राजकुमारी वसुमती है, जो राजा दधिवाहन और रानी धारिणी की बेटी है।" राजा और रानी ने अब उसे पहचान लिया और उसे अपने साथ रहने के लिए आमंत्रित किया। इसलिए वह चली गई, लेकिन सबसे पहले व्यापारी धनवाह को धन्यवाद दिया जो उसके प्रति बहुत दयालु था।

    बाद में, जब भगवान महावीर को पूर्ण ज्ञान प्राप्त हुआ, तो उन्होंने जैन संघ (समुदाय) के चार गुना आदेश को फिर से स्थापित किया। उस समय चंदनबाला ने दीक्षा ली और पहली नन (साध्वी) बनीं। उस जीवन के अंत में चंदनबाला को मुक्ति प्राप्त हुई।`,
  },
  {
    id: "story6",
    name: "God Mahavira and Cow Herder (भगवान महावीर और गाय चराने वाले)",
    imageUrl:
      "https://tse2.explicit.bing.net/th?id=OIP.jh32i_xMjLp9pjFBGUTgzQAAAA&pid=Api&P=0&h=180",
    content: `एक दिन जब भगवान महावीर एक स्थान से दूसरे स्थान पर जा रहे थे, तो वे ध्यान करने के लिए गाँव के बाहर एक बड़े पेड़ के पास रुके। जब वह ध्यान कर रहे थे तभी एक गाय चराने वाला अपनी गायों के साथ वहां आया। उसे गायों की देखभाल के लिए किसी की ज़रूरत थी, ताकि वह कुछ काम चला सके। उन्होंने महावीरस्वामी से पूछा कि क्या वह कुछ घंटों के लिए गायों की देखभाल करेंगे। भगवान महावीर गहरे ध्यान में थे और उन्होंने गाय चराने वाले की बात नहीं सुनी। हालाँकि, गाय चराने वाला यह सोचकर चला गया कि भगवान महावीर ने उसकी बात सुन ली है और वह गायों की देखभाल करेगा।

    इसी बीच गायें इधर-उधर भटकने लगीं, तलाश करने लगीं और घास चरने लगीं। कुछ घंटों बाद, गाय चराने वाला वापस आया और पाया कि उसकी सभी गायें गायब हैं। उन्होंने महावीरस्वामी से पूछा, “मेरी गायें कहाँ हैं?” आपने उनके साथ क्या किया?” भगवान महावीर अभी भी ध्यान में थे और उन्होंने कोई उत्तर नहीं दिया। गाय चराने वाला आश्चर्य करने लगा। "वे कहाँ हो सकते हैं?" चूँकि भगवान महावीर ने कोई उत्तर नहीं दिया, गाय चराने वाले ने उन्हें घाटी में हर जगह खोजा, लेकिन वे नहीं मिले। जब वह गायों की तलाश कर रहा था, तो वे उस स्थान पर लौट आईं जहां महावीरस्वामी ध्यान कर रहे थे।
    
    जब गाय चराने वाला वापस आया तो वह आश्चर्यचकित रह गया, उसकी सभी गायें भगवान महावीर के पास खड़ी थीं। महावीरस्वामी अभी भी ध्यानमग्न थे। गाय चराने वाले को भगवान महावीर पर बहुत क्रोध आया, क्योंकि उसे लगा कि भगवान महावीर अपनी गायों को छुपा रहे हैं। अत: उसने अपनी रस्सी निकाली और उससे महावीरस्वामी को मारने ही वाला था। तभी, स्वर्ग से एक देवदूत नीचे आया और रस्सी पकड़ ली।
    
    "क्या आप नहीं देख सकते कि भगवान महावीर गहरे ध्यान में हैं?" देवदूत ने पूछा.
    
    "लेकिन उसने मुझे धोखा दिया!" गाय चराने वाले ने कहा. देवदूत ने उत्तर दिया, “वह एक भगवान है। उसे आपकी गायों या इस दुनिया में किसी भी चीज़ की परवाह नहीं है। वह ध्यान में था और उसने आपकी बात नहीं सुनी। उसने आपकी गायों के साथ कुछ नहीं किया। उसे चोट पहुँचाने के लिए तुम्हें बुरे कर्म मिलेंगे।”
    
    गाय चराने वाले को एहसास हुआ कि उससे गलती हो गई है। उसने भगवान महावीर से क्षमा मांगी और चुपचाप चला गया। देवदूत खुश होकर स्वर्ग वापस चला गया कि वह भगवान महावीर की पीड़ा को रोक सकता है।
    
    महावीर के मन में गाय चराने वाले के प्रति कोई बुरी भावना नहीं थी, क्योंकि उनके मन में किसी के प्रति कोई क्रोध नहीं था।
    
    हमें जल्दबाजी में निर्णय नहीं लेना चाहिए, क्योंकि हम गलत हो सकते हैं। हमें भी किसी का दिल नहीं दुखाना चाहिए और क्रोध की जगह क्षमा का पालन करना चाहिए। इस तरह हम नये कर्मों को अपनी आत्मा में आने से रोक सकते हैं।`,
  },
  {
    id: "story7",
    name: "Dhanasar (धनसार)",
    imageUrl:
      "https://tse3.mm.bing.net/th?id=OIP.MuWclxpt_6TRc3U3ByJlfAHaLF&pid=Api&P=0&h=180",
    content: `मथुरा नगर में धन्नासर नाम का एक व्यापारी रहता था। वह बहुत अमीर था, लेकिन वह किसी को एक पैसा भी नहीं देता था। वह अपने धन के साथ-साथ अपनी कंजूसी के लिए भी प्रसिद्ध था। धनेसर अपना धन जमीन के अंदर छिपाकर रखता था। एक दिन, वह इसकी जाँच करने गया, और उसने पाया कि यह सब कोयले में बदल गया था और इस पर साँप रेंग रहे थे। इससे पहले कि वह इस नुकसान से उबर पाता, कुछ ही देर में उसे खबर मिली कि उसके सभी मालवाहक जहाज समुद्र में डूब गए हैं। जैसे कि यह पर्याप्त नहीं था, उसे यह भी पता चला कि उसका सारा सामान ले जा रहा एक काफिला लूट लिया गया था। वह बहुत असहाय और दुखी महसूस कर रहा था। उन्होंने घर पर एक लाख से अधिक सोने के सिक्के छोड़ कर स्वयं व्यापार के लिए विदेश जाकर अपने भाग्य को चुनौती देने का निर्णय लिया। लेकिन उसके दुर्भाग्य और बुरे कर्मों के कारण जहाज बर्बाद हो गया और उसका सारा सोना समुद्र में खो गया। उसने एक लट्ठे पर तैरकर खुद को बचाया जिससे वह किनारे पर पहुंच गया।

    उसने अगला दिन समुद्र तट पर बिताया, फिर वह एक पार्क में चला गया। तभी उन्होंने आम के पेड़ की छाया में एक मुनि को उपदेश देते देखा। वह भीड़ में शामिल हो गया. जब उपदेश समाप्त हुआ तो व्यापारी साधु के पास गया और बोला, “हे मुनि! किन कर्मों के कारण मैंने इतना धन अर्जित किया और किन कर्मों के कारण मैंने यह सब खो दिया?”
    
    मुनि ने उन्हें धनसार का पिछला जीवन सुनाया, “धातकीखंड देश में अम्बिका नामक एक नगर था। अम्बिका में दो भाई रहते थे। बड़ा भाई हमेशा जरूरतमंदों की मदद करता था और उदार था, जबकि छोटे भाई को दान देना पसंद नहीं था। छोटे भाई का स्वभाव बहुत बुरा था और जब उसका बड़ा भाई अन्य लोगों की मदद करता था तो वह अक्सर इसका प्रदर्शन करता था। कुछ समय बाद जब छोटे भाई से यह दया और सहन न हुई तो वह घर छोड़कर चला गया। बड़े भाई ने जरूरतमंदों को दान देने की अपनी जीवन शैली जारी रखी और उनकी संपत्ति कम होने के बजाय बढ़ती गई। छोटे भाई को यह बर्दाश्त नहीं हुआ, इसलिए उसने एक कहानी बनाई, राजा के पास गया और राजा को अपने भाई की संपत्ति पर कब्ज़ा करने के लिए मना लिया। इससे बड़े भाई को दुःख हुआ और उन्होंने संसार त्याग दिया। उनकी मृत्यु के बाद उनके अच्छे कर्मों के कारण उनका स्वर्ग में देवदूत के रूप में पुनर्जन्म हुआ।''
    
    “लोगों को छोटे भाई का व्यवहार पसंद नहीं आया और वह उनकी आलोचना सहन नहीं कर सके। इसलिए उसने शहर छोड़ दिया और कुछ सन्यासियों से जुड़ गया। उनकी मृत्यु के बाद, उनका नरक में असुरकुमार (राक्षस) के रूप में पुनर्जन्म हुआ। तुम वो छोटे भाई हो. क्योंकि पिछले जन्म में तुमने उपहार और दान को स्वीकार नहीं किया था, इसलिए तुम अभी भी कंजूस हो। क्योंकि तू ने अपने भाई का सारा धन हरवा दिया, इसलिये अब तेरा धन भी नष्ट हो गया। जबकि आपके बड़े भाई ने अपना जीवन सौधर्म स्वर्ग में व्यतीत करने के बाद ताम्रलिप्ति में एक व्यापारी के रूप में जन्म लिया। उन्होंने बहुत सारी संपत्ति अर्जित की, लेकिन भिक्षु बनने के लिए उन्होंने सब कुछ त्याग दिया। आप अभी उससे बात कर रहे हैं।
    
    यह सुनकर धनेसर को दुःख हुआ और वह परेशान हो गया। उसने मुनि को प्रणाम किया और उनसे क्षमा मांगी। उन्होंने प्रतिज्ञा की, कि वह किसी भी पाप कर्म में शामिल नहीं होंगे और अपनी आय का केवल एक-चौथाई हिस्सा ही अपने पास रखेंगे। बाकी वह चैरिटी में दान कर देंगे.
    
    जल्द ही एक चमत्कार हुआ. उसकी सारी सम्पत्ति बरामद कर ली गई। धनेसर ने अपना वादा निभाया. वह एक धर्मनिष्ठ श्रावक बन गया और उसने अपना धन सात वस्तुओं पर खर्च किया: जैन निवास, मंदिर, और साहित्य, और जैन भिक्षुओं, ननों, श्रावकों और श्राविकाओं (महिला गृहस्थों) की भलाई। यह उनके जीवन का निर्णायक मोड़ था और इसके बाद उन्होंने एक उत्कृष्ट जीवन जीया।`,
  },
  {
    id: "story8",
    name: "Kuldhar's Daughter (कुलधर की बेटी)",
    imageUrl:
      "https://tse1.mm.bing.net/th?id=OIP.92j2svTjHr5sbcnXe7W6bgHaLF&pid=Api&P=0&h=180",
    content: `बहुत समय पहले चंपापुरी नगर में कुलधर और उसकी पत्नी कुलनंदा नाम का एक बहुत अमीर व्यापारी रहता था। व्यापारी की सात बेटियाँ थीं। उन्होंने उनका नाम कमलाश्री, कमलावती, कमला, लक्ष्मी, सरस्वती, जयमती और प्रियाकारिणी रखा। उनकी सभी बेटियों की शादी अमीर व्यापारियों से हुई थी और वे बहुत खुश थीं। कुलधर और उनकी पत्नी कुलनंदा ने अपनी आठवीं बेटी को जन्म दिया, लेकिन किसी तरह वे उसके जन्म से खुश नहीं थे। उन्होंने नामकरण संस्कार नहीं किया. आठवीं लड़की कम भाग्यशाली थी. जैसे-जैसे वह बड़ी हुई, उसके पिता को उसके लिए पति ढूंढने में कोई परेशानी नहीं हुई। अगर कोई उनके ध्यान में यह बात लाता तो वह यही कहते कि जैसे ही उन्हें उसके लिए सही वर मिल जाएगा, वह घर बसा लेंगे। उसे उसकी ख़ुशी की ज़रा भी चिंता नहीं थी.

    एक दिन जब कुलधर अपने काम पर था, एक अजीब युवक उसके पास आया। उस आदमी ने खराब कपड़े पहने हुए थे, उसके बाल बिखरे हुए थे और वह जूँओं से ढका हुआ था। व्यापारी ने उससे पूछा, “तुम कहाँ से हो? आप यहां पर क्या कर रहे हैं?" युवक ने उत्तर दिया, “मेरे पिता का नाम नंदी और मेरी माता का नाम सोमा है। वे कोशलपुर में हैं. मेरा नाम नंदन है. मैं काम की तलाश में चंदादेश गया था। एक व्यापारी ने मुझे यह पत्र आपके शहर में रहने वाले वसंतदेव नाम के एक व्यक्ति तक पहुंचाने का काम दिया।”
    
    कुलधर उसकी बात नहीं सुन रहा था, वह तो बस इस आदमी को अपनी बेटी देने के बारे में सोच रहा था। उन्होंने युवक से कहा, "मैं तुम्हारे साथ किसी को भेजने जा रहा हूं, और जैसे ही तुम पत्र पहुंचाओ, मैं चाहता हूं कि तुम वापस आओ और मुझसे बात करो।" इस बीच, कुलधर ने अपने नौकरों से इस युवक के लिए स्नान, कुछ कपड़े और कुछ भोजन तैयार करने की व्यवस्था की। जब नंदन लौटा, तो उसने स्नान किया, अपने कपड़े बदले और खाना खाया। इसके बाद कुलधर ने उन्हें अपनी बेटी से शादी करने का प्रस्ताव दिया। नंदन ने कहा, "मुझे तुरंत चंद्रदेश लौटना था।" व्यापारी ने कहा, “नौजवान, शादी की व्यवस्था करने में ज्यादा समय नहीं लगेगा। जब तक आप चंदादेश नहीं पहुंच जाते, मैं आप दोनों के लिए पैसे दूंगा।
    
    कुछ घंटों बाद उनकी शादी हो गई और उनकी बेटी के अपने माता-पिता को अलविदा कहने का समय आ गया। इसके बाद दम्पति चंदादेश की ओर चल पड़े। अँधेरा होने लगा था और वे थकने लगे थे। उन्हें एक मंदिर मिला और उन्होंने वहां एक रात बिताने का फैसला किया। अपनी पत्नी के सो जाने के बाद, नंदन ने सोचा, “मैं समय पर चंद्रदेश नहीं पहुँच पाऊँगा क्योंकि मेरी पत्नी उतनी तेज़ नहीं चल सकती जितनी मैं चल सकता हूँ। इसके अलावा, हम दोनों को जीने के लिए बहुत अधिक पैसे की आवश्यकता होगी। तो आगे चलकर क्या होगा? मुझे भीख मांगनी पड़ेगी।” उसे भीख मांगने का विचार पसंद नहीं आया, इसलिए उसने अपनी पत्नी को छोड़ने का फैसला किया।
    
    सूर्योदय के समय जब कुलधर की बेटी उठी तो उसे पता चला कि उसका पति चला गया है और वह सारा धन अपने साथ ले गया है। वह सोचने लगी, “पति के बिना मेरा क्या होगा।” सबसे पहले उसने अपने माता-पिता के घर वापस जाने के बारे में सोचा। लेकिन फिर उसने सोचा कि वहां भी उसके साथ अच्छा व्यवहार नहीं किया गया, तो वहां वापस जाने का क्या फायदा? भीख मांगने के विचार से उसके शरीर में ठंडक दौड़ गई। उसने फैसला किया कि वह काम तलाशेगी और अपना भरण-पोषण खुद करेगी। लेकिन वह नहीं जानती थी कि उसे कहाँ जाना है या वह अगले किस शहर में पहुँच सकती है। उसके पास कोई विकल्प नहीं था. वह उसी सड़क पर चल पड़ी जिस पर वे पहले जा रहे थे।
    
    कुछ समय बाद वह अवंतीदेश नामक नगर में पहुँची। वह काम की तलाश में बाजार गई थी। सबसे पहले उसने जिस व्यक्ति को देखा वह मणिभद्र नाम का एक व्यापारी था। वह वहाँ खड़ी रही और उसे देखा, और इस आदमी के बारे में उसके मन में अच्छी भावना विकसित हुई। तो उसने उससे काम मांगा. पहले तो मणिभद्र को उस पर दया आ गई, लेकिन वह किसी अजनबी को काम पर रखने से डरता था। व्यापारी ने यह पता लगाने का फैसला किया कि वह कौन थी। तो उसने उससे पूछा, "तुम कौन हो?" उसने उससे कहा, “मैं चंपापुरी के कुलधर की बेटी हूं। मैं अपने पति के साथ चंदादेश जा रही थी, लेकिन हम रास्ते में ही अलग हो गए। इसलिए, अब मैं अपने भरण-पोषण के लिए काम की तलाश कर रही हूं जब तक कि वह मुझे मिल न जाए।''
    
    मणिभद्र को अब उसके साथ सहज महसूस हुआ। उसने उसे अपने घर में रहने के लिए आमंत्रित किया और उसे अपने घरेलू मामलों का प्रभारी नियुक्त किया। उसने उसके पति की तलाश के लिए कई लोगों को भेजा लेकिन वे उसे नहीं ढूंढ सके। उसने उसके माता-पिता की भी जाँच की और पाया कि वह सच कह रही थी।
    
    जैसे-जैसे समय बीतता गया, परिवार में सभी लोग उसे पसंद करने लगे और उसे बहुत स्नेह देने लगे। बाद में, मणिभद्र ने बड़े द्वारों और रंगीन झंडों वाला एक बड़ा जैन मंदिर बनवाया। कुलधर की बेटी प्रतिदिन जिन मंदिर में पूजा करने जाती थी और वहाँ उसकी मुलाकात कई भिक्षुणियों से होती थी। जैसे-जैसे वह ननों के साथ जुड़ीं, और जैन सिद्धांत और नव तत्व (नौ बुनियादी सिद्धांत) सीखीं, उन्होंने एक श्राविका की प्रतिज्ञा स्वीकार की, और अपने जीवन के बारे में बहुत बेहतर महसूस किया।

    एक दिन कुलधर की बेटी ने देखा कि मणिभद्र उदास लग रहे थे। उसने उससे कारण पूछा। उसने कहा, “राजा ने बगीचे की देखभाल करने और उसे प्रतिदिन फूल उपलब्ध कराने के लिए मुझ पर भरोसा किया है। मुझे नहीं पता कैसे लेकिन अचानक बगीचा सूख गया है। मुझे नहीं पता कि मैं राजा के लिए फूल कैसे उपलब्ध कराऊंगा। मुझे डर है कि राजा नाराज़ हो जायेगा और मैं नहीं जानता कि वह क्या करेगा।” कुलधर की बेटी ने संकल्प लिया कि जब तक बगीचा फूलों से सुसज्जित नहीं हो जाता, तब तक वह न तो कुछ खाएगी और न ही कोई तरल पदार्थ पिएगी। इसलिए वह मंदिर लौट आई।

    जिना को प्रणाम करने के बाद वह गहरी कायोत्सर्ग (तपस्या) में चली गयीं। दो दिन बीत गए और तीसरे दिन देवी प्रकट हुईं और बोलीं, "मेरी बेटी, तुम्हारी मन्नत पूरी हो गई है और सुबह बगीचे का पुनर्निर्माण हो जाएगा।"

    अगली सुबह, एक चमत्कार हुआ। बगीचा पहले से भी अधिक सुन्दर था। इसमें किसी की अपेक्षा से भी अधिक ताज़े फूल थे। व्यापारी ने अब मन ही मन उसे अपनी पुत्री मान लिया। वह सुंदर बगीचे के लिए उसे बधाई देने के लिए मंदिर की ओर दौड़ा। यह आश्चर्यजनक समाचार सुनते ही पूरा शहर मंदिर की ओर दौड़ पड़ा और सभी ने उसकी प्रशंसा की।

    यह महसूस करने के बाद कि उद्यान पुनर्जीवित हो गया है, उसने ननों को भोजन कराने के बाद अपना उपवास तोड़ा। एक रात बिस्तर पर लेटे हुए कुलधर की बेटी ने सोचा, “सौभाग्य से मैं मंदिर और भिक्षुणियों के संपर्क में आई। मुझे इसका सर्वोत्तम लाभ उठाना चाहिए।” इसलिए उसने अपना जीवन बदल लिया। वह दो, तीन या चार दिन तक उपवास करती थी। कभी-कभी वह एक महीने तक उपवास भी करती थी। वह बहुत पवित्र जीवन जीती थी। जब उसका जीवन समाप्त हो गया तो वह स्वर्ग चली गई।`,
  },
  {
    id: "story9",
    name: "Punyasar (पुण्यसार)",
    imageUrl:
      "https://tse3.mm.bing.net/th?id=OIP.-zvLbcidRAwJRkXvBvpjnwHaLF&pid=Api&P=0&h=180",
    content: `एक बार गोपालक शहर में एक पवित्र जोड़ा, पुरंदर और उनकी पत्नी पुण्यश्री रहते थे। उनकी कोई संतान नहीं थी, इसलिए पुरंदर ने संतान प्राप्ति के लिए उनकी देवी की पूजा की। देवी उनकी पूजा से प्रसन्न हुईं और उन्हें आशीर्वाद दिया, "तुम्हारे एक पुत्र होगा, लेकिन तुम्हें कुछ समय इंतजार करना होगा।"

    कुछ साल बाद उनके घर एक बेटे का जन्म हुआ। वे बहुत खुश हुए और इस अवसर का जश्न मनाया। उन्होंने बच्चे का नाम पुण्यसार रखा। वह बहुत सुंदर लड़का था. अपने स्कूल में उनकी मुलाकात रत्नसुंदरी नाम की एक खूबसूरत लड़की से हुई, जो रत्नसार नाम के एक व्यापारी की बेटी थी। पुण्यसार और रत्नयसुंदरी के बीच अक्सर बहस होती रहती थी। एक दिन तो बहस बहुत बढ़ गई. पुण्यसार ने कहा, “तुम अपने पति की गुलामी के अलावा कुछ नहीं रह जाओगी।” रत्नसुंदरी नाराज हो गईं और उन्होंने जवाब दिया, "मेरा पति एक सभ्य व्यक्ति होगा, मैं तुम्हारे जैसे बेकार व्यक्ति से शादी नहीं करूंगी।" पुण्यसर इस टिप्पणी को सहन नहीं कर सके। वह भड़क गया और बोला, ''मैं तुमसे शादी करके दिखाऊंगा.'' रत्नसुंदरी ने कहा, “हरगिज नहीं! कोई भी किसी का दिल जबरदस्ती नहीं जीत सकता।” वे दोनों अभी भी एक-दूसरे से नाराज होकर चले गए।
    
    जब पुण्यसार घर आया तो उसने अपने पिता से कहा कि वह रत्नसुंदरी से विवाह करना चाहता है। उनके पिता को यह नहीं पता था कि क्या हो रहा है, उन्होंने उन्हें आश्वासन दिया कि यह कोई समस्या नहीं होनी चाहिए। पुण्यसार मन ही मन खुश हुआ. अगले दिन पुण्यसार के पिता रत्नसुंदरी के घर गए और उनके पिता को पुण्यसार और रत्नसुंदरी के बीच विवाह का सुझाव दिया। रत्नसुंदरी के पिता रत्नसार इस प्रस्ताव से बहुत प्रसन्न हुए क्योंकि पुण्यसार के पिता शहर के एक प्रतिष्ठित व्यापारी थे। उन्होंने सम्मानित महसूस किया. रत्नसुंदरी ने यह बातचीत सुनी और अपने पिता के चेहरे पर भाव देखे। जैसे ही उसके पिता प्रस्ताव स्वीकार करने वाले थे, रत्नसुंदरी ने विरोध करते हुए कहा, "मैं पुण्यसर से शादी नहीं करूंगी।" और भाग गया. इस बात से दोनों हैरान रह गए. रत्नसुंदरी के पिता ने पुण्यसार के पिता से कहा, “कृपया उसकी बात को गंभीरता से न लें। मैं उससे बात करूंगा और आपको बताऊंगा। पुण्यसार के पिता निराश होकर चले गये।
    
    जब पुण्यसार के पिता घर आए, तो उन्होंने पुण्यसार से पूछा, “उस लड़की से शादी करने में ऐसी कौन सी बड़ी बात है? वह बहुत बड़बड़ाती है, मुझे नहीं लगता कि वह हमारे परिवार के लिए उपयुक्त लड़की होगी। तुम्हें उसके बारे में भूल जाना चाहिए।” पुण्यसार ने कुछ नहीं कहा, क्योंकि वह असमंजस में था कि आगे क्या करे।
    
    पुण्यसार रत्नसुंदरी से विवाह करने के लिए दृढ़ था, इसलिए उसने कुल देवी की पूजा की। उनकी पूजा से प्रसन्न होकर देवी प्रकट हुईं और उनसे कहा, "चिंता मत करो, उचित समय पर तुम्हारी इच्छा पूरी होगी।" पुण्यसार को ख़ुशी हुई.
    
    पुण्यसार बड़ा होकर एक अच्छा, निपुण युवक बन गया, लेकिन अपने कई अच्छे गुणों के बावजूद उसे जुआ खेलने की आदत पड़ गई। उनके पिता को यह पसंद नहीं आया और उन्होंने उन्हें चेतावनी दी, लेकिन पुण्यसर ने उनकी बात नहीं मानी। उसका जुआ उस स्तर पर आ गया जहां पुण्यसार ने घर से चीजें चुराना शुरू कर दिया और जल्द ही उसने राजा के गहने चुरा लिए जो उसके पिता की हिरासत में रखे गए थे। उसके पिता को इस बात का एहसास तब हुआ जब राजा ने आभूषण मांगे और वे नहीं मिले। वह अपने बेटे पर क्रोधित हुआ, और उससे कहा, "जब तक तुम्हें वे गहने वापस नहीं मिल जाते, तुम घर में नहीं आओगे।"
    
    पुण्यसर इस आदेश से स्तब्ध रह गये। उसने जो किया उसके लिए उसे खेद और असहाय महसूस हुआ। वह दुःखी होकर घर से निकल गया। रात हो गई और उसके पास जाने के लिए कोई जगह नहीं थी। वह एक बरगद के पेड़ के पास आया जिसका तना खोखला था इसलिए वह आराम करने के लिए वहीं बैठ गया। कुछ मिनट बाद, उसे आश्चर्य हुआ, उसने देखा कि दो देवदूत पेड़ की ओर आये और उस पर बैठ गये। उनमें से एक ने कहा, "बहुत अच्छी रात है, चलो कहीं चलते हैं।" दूसरे देवदूत ने कहा, "जब तक कुछ रोमांचक देखने को न मिले तब तक इधर-उधर घूमने से कोई फायदा नहीं है।" पहले ने कहा, “मैंने सुना है कि बल्भीपुर नामक नगर में धना नाम के एक व्यापारी की सात बेटियाँ हैं और वे सभी एक ही आदमी से शादी करेंगी। यह देखना दिलचस्प हो सकता है कि वे किससे शादी करेंगे?”
    
    अत: उन्होंने पूरा पेड़ ही उठा लिया और वहाँ उड़ गये। पुण्यसर यह सुन रहा था और जब पेड़ उड़ने लगा तो उसे समझ नहीं आया कि क्या करे। इसलिए उसने फैसला किया कि वह यह भी देखेगा कि सात खूबसूरत लड़कियों से शादी करने वाला भाग्यशाली व्यक्ति कौन होगा। कुछ देर बाद देवदूतों ने पेड़ को जमीन पर रख दिया। वे उस स्थान पर गये जहाँ विवाह समारोह होने वाला था। पुण्यसार भी उतरकर उनके पीछे हो लिया।
    
    देवदूत विवाह मंडप के पास पहुंचे और पुण्यसार भी। हॉल में कुछ लोगों ने पुण्यसार को देखा और वे उसके पास आकर कहने लगे, "हम सात सुंदर लड़कियों से शादी करने के लिए आपकी प्रतीक्षा कर रहे हैं।" पुण्यसार बहुत हैरान हुआ. उन्होंने कहा, "हां, आप ही हैं जो इन सात लड़कियों से शादी करेंगे।" उन्होंने उसे समझाया, “व्यापारी धन्ना की सात खूबसूरत लड़कियाँ हैं। उनके नाम हैं धर्मसुंदरी, धनसुंदरी, कामसुंदरी, मुक्तिसुंदरी, भाग्यसुंदरी, सौभाग्यसुंदरी और गुणसुंदरी। उन्हें उनकी शादी की चिंता थी. इसलिए उन्होंने सफलता के देवता भगवान लंबोदर (गणेश) की पूजा की। सात दिन पहले, भगवान लंबोदर प्रकट हुए और उनसे कहा, “आगे बढ़ो और विवाह की तैयारी करो। आज से सात दिन बाद तुम एक युवक को दो देवदूतों का पीछा करते हुए विवाह मंडप की ओर आते हुए पाओगे। वह आपकी बेटियों के लिए उपयुक्त व्यक्ति है।' हमने तुम्हें दो स्वर्गदूतों का अनुसरण करते हुए देखा है, इसलिए तुम ही वह व्यक्ति हो जो इन सात बहनों से विवाह करेगा।”

पुण्यासे यह देखकर आश्चर्यचकित थी कि चीजें कैसे हो रही थीं। उसे इस बात पर यकीन नहीं हो रहा था. लोग उसे समारोह स्थल पर ले गए, और जब उसने सात सुंदर लड़कियों को देखा तो वह उनसे शादी करने के लिए सहमत हो गया। इस सुन्दर युवक को देखकर सभी लोग भी प्रसन्न हुए।

जब विवाह समारोह समाप्त हुआ तो पुण्यसर सहित पूरा परिवार अपने घर चला गया।

लड़कियां भी हैरान थीं कि ये क्या हो गया. उन्हें नहीं पता था कि वे किससे शादी करेंगी और वह क्या करेगा? इसलिए एक बार जब वे घर आए, तो उनमें से एक ने उनसे पूछा, "हे प्रभु, आपने कितना अध्ययन किया है?" पुण्यसार असमंजस में था कि क्या उत्तर दे। तो उन्होंने कहा, “चाहे आप बहुत बड़े विद्वान हों या नहीं, ख़ुशी नहीं मिलती। इसलिए इसे ध्यान में रखते हुए मैंने बीच का रास्ता अपनाया।” लड़कियां उसका जवाब समझ नहीं पाईं. पुण्यसार बेचैन हो रहा था क्योंकि वह भागकर घर वापस जाना चाहता था। उसने कहा कि वह ताजी हवा लेना चाहता है और बाहर चला गया। गुणसुंदरी उसे दरवाजे तक ले गई और वहीं खड़ी होकर उसे देखती रही। घर से निकलते समय उसने दीवार पर कुछ लिख दिया। उसने इसे नजरअंदाज कर दिया और अपनी बहनों के साथ बैठकर उसके लौटने का इंतजार करने लगी।

जैसे ही पुण्यसर घर से बाहर निकला, वह पेड़ की ओर भागा, उसने अभी भी अपनी शादी के कपड़े और कीमती गहने पहने हुए थे। जब उसने देखा कि पेड़ अभी भी वहीं है, तो उसे राहत मिली और वह एक बार फिर खोखले तने में आराम करने लगा। कुछ मिनट बाद, देवदूत वापस आये और पेड़ के साथ वापस उड़ने लगे।

इस बीच गोपालक में, जब पुण्यसार की माँ ने अपने बेटे को नहीं देखा, तो उसने अपने पति से पूछा कि क्या उसे पता है कि पुण्यसर कहाँ होगा? उसके पिता, जो अब भी उससे नाराज़ थे, ने उसे बताया कि उसने पुण्यसर को घर छोड़ने के लिए कहा था क्योंकि उसका व्यवहार परिवार की प्रतिष्ठा के लिए अच्छा नहीं था। वह यह बात समझती थी, लेकिन आख़िरकार वह माँ थी, और यह सहन नहीं कर सकती थी। वह रोने लगी और अपने पति से विनती करने लगी, “कृपया मेरी खातिर, जाओ, उसे ढूंढो और उसे घर ले आओ। मुझे चिंता है कि रात में उसके साथ क्या होगा।” पुण्यसार के पिता उसे रोते हुए नहीं देख सके। वह पुण्यसार की तलाश में गया।

पुण्यसार के पिता ने पूरे शहर में देखा, लेकिन वह कहीं नहीं मिला। उसने यह देखने के लिए शहर के बाहर जाने का फैसला किया कि पुण्यसर आसपास है या नहीं। उसके वहां पहुंचने से ठीक पहले, दोनों देवदूत शहर के बाहर पेड़ पर उतरे। घर वापस लौटते समय पुण्यसार को एहसास हुआ कि उसकी आदतें कितनी बुरी थीं। उसने निश्चय किया कि वह अब जुआ नहीं खेलेगा।

वह पेड़ से उतरकर घर की ओर चलने लगा। जल्द ही वह अपने पिता के पास गया। जब उसके पिता ने गहने और अमीर कपड़े देखे तो उसने सोचा कि पुण्यसर ने उन्हें चुरा लिया होगा। वह कुछ कहने ही वाला था, लेकिन पुण्यसार ने कहा, "पिताजी, कृपया इस बार मेरे बारे में बुरा मत सोचना।" उन्होंने बताया कि घर से निकलने के बाद क्या हुआ था. उसने अपने पिता से यह भी वादा किया कि उसने बदलने का फैसला कर लिया है और अब जुआ नहीं खेलेगा। उन्होंने यह भी वादा किया कि वह पारिवारिक व्यवसाय में हिस्सा लेंगे। यह सुनकर उनके पिता बहुत खुश हुए। दोनों ने एक दूसरे को गले लगाया और घर चले गये. उसकी माँ खुश थी कि उसका बेटा बिल्कुल ठीक था।

अब बल्लभीपुर में जब पति वापस नहीं आया तो लड़कियों को चिंता होने लगी. उन्हें उसका नाम या वह कहां का रहने वाला है, यह पूछने का मौका भी नहीं मिला. गुणसुंदरी यह देखने के लिए बाहर गई कि क्या वह वहाँ है, लेकिन उसे कोई नहीं दिखा। उसने अपनी बहनों से कहा, वह हमें छोड़कर चला गया है. हमें देवी की बातों पर भरोसा करना चाहिए. आइए हम णमोकार मंत्र और धर्म में आस्था रखें। फिर, सब ठीक हो जाएगा. तभी गुणसुंदरी को उसे दीवार पर कुछ लिखते हुए देखने की याद आई। उसने अपनी बहनों से कहा, "रुको, मैं अभी वापस आती हूँ।" वह दीवार के पास गई और उसने यह पंक्ति देखी:

“गोपालक से मैं दैवीय कृपा से आया हूं

और यहां सात लड़कियों से शादी करने के बाद मैं लौटूंगा।”

गुणसुंदरी ने अपनी बहनों को बताया कि वहां क्या लिखा था। कुछ दिन बीत गए और पुण्यसार फिर भी नहीं लौटा। गुणसुंदरी ने अपनी बहनों और माता-पिता से कहा, “मैं उसे ढूंढने और वापस लाने के लिए गोपालक के पास जाऊंगी। मैं छह महीने में वापस आऊंगा. यदि मैं असफल हो गया तो मैं आत्मदाह कर लूँगा।” उसने गुणसुंदर नाम के एक पुरुष का वेश धारण किया और गोपालक के लिए रवाना हो गई।

गोपालक के राजा के प्रति एक अच्छे व्यवहार के रूप में, गुणसुंदर दरबार में गए और उन्हें बहुमूल्य उपहार दिए। राजा उन्हें पाकर प्रसन्न हुए और उन्होंने गुणसुंदर का सम्मानपूर्वक स्वागत किया। गुणसुंदर ने एक व्यवसाय शुरू किया और वह बहुत फला-फूला। वह शहर में चर्चा का विषय था। वह कई मौकों पर पुण्यसार से मिले और वे अच्छे दोस्त बन गए। कई बार गुणसुन्दर को ऐसा लगा कि वह पुण्यसार को जानता है, पर कुछ कहता नहीं।

इतने में नगर के लोग गुणसुन्दर की प्रशंसा करने लगे। उन्होंने कहा कि वह सुंदर, शिक्षित, बुद्धिमान और अच्छे व्यवहार वाले थे। रत्नसुंदरी ने उसे शहर के एक समारोह में देखा, उससे आकर्षित हो गई और उससे शादी करने का फैसला किया। उसने अपने पिता से पूछा कि क्या वह गुणसुंदर को उसके विवाह का प्रस्ताव देंगे। अगले दिन रत्नसुन्दरी के पिता गुणसुन्दर के घर गये। गुणसुंदर ने रत्नसुंदरी के पिता का स्वागत किया, उन्हें बैठने की जगह दी। फिर उन्होंने आने का कारण पूछा. रत्नासार ने गुणसुंदर को अपनी यात्रा का उद्देश्य बताया और उनकी बेटी रत्नसुंदरी से विवाह का प्रस्ताव रखा। गुणसुन्दर दुविधा में थे। वह इस प्रस्ताव को स्वीकार नहीं करना चाहता था, लेकिन उसे डर था कि लोग उसके बारे में तरह-तरह की अफवाहें फैला सकते हैं। रत्नासार हताश था क्योंकि रत्नसुंदरी बड़ी हो रही थी और किसी अन्य पुरुष से शादी करने के लिए सहमत नहीं थी। रत्नासर की जिद के आगे गुणसुंदर मना नहीं कर सके, इसलिए वह रत्नसुंदरी से शादी करने के लिए तैयार हो गए।

गुणसुंदर और रत्नसुंदरी की शादी एक छोटे से निजी समारोह में हुई। विवाह के बाद, जब रत्नसुंदरी अपने नए घर में आई, तो गुणसुंदर ने उससे कहा, "मैंने कसम खाई है कि जब मैं शादी करूंगा तो पहले छह महीने तक अपनी पत्नी के साथ एक ही कमरे में सोऊंगा या नहीं रहूंगा।" रत्नसुंदरी ने इस व्रत के बारे में ज्यादा नहीं सोचा क्योंकि वह उससे शादी करके खुश थी और उसने सोचा कि छह महीने जल्दी ही बीत जाएंगे। इसलिए उन्होंने अलग कमरे में रहने का फैसला किया.

जब पुण्यसर को पता चला कि रत्नसुंदरी, जिसके लिए उसने अपनी सात लड़कियों को छोड़ दिया था, ने गुणसुंदर से शादी कर ली है, तो वह क्रोधित हो गया। वह उस देवी से क्रोधित हो गया जिसने उससे वादा किया था कि सब कुछ ठीक हो जाएगा। यह कैसे सही हो सकता है जबकि रत्नसुंदरी का विवाह दूसरे पुरुष से हुआ था। वह अपने कमरे में गया और देवी से इस बारे में समझाने को कहा। देवी प्रकट हुईं और बोलीं, “शांत हो जाओ, थोड़ा धैर्य रखो और चीजें ठीक से काम करेंगी। गुणसुन्दर आपकी पत्नी हैं।” फिर वह चली गई. पुण्यसार को इनमें से कुछ भी समझ नहीं आया और वह और अधिक भ्रमित हो गया। वह इस बात का पता नहीं लगा सका कि गुणसुंदर कोई और नहीं बल्कि गुणसुंदरी ही थी, जिससे उसने बलभीपुर में विवाह किया था।

इस बीच, गुणसुंदरी का अपनी बहनों और माता-पिता से छह महीने का वादा बीत गया, और वह अपने जीवन के रहस्य को नहीं सुलझा सकी। इसलिए, उसने खुद को जलाने का फैसला किया। उसने रत्नसुन्दरी को अपने निर्णय के बारे में बताया। रत्नसुंदरी स्तब्ध रह गईं. रत्नसुन्दरी ने गुणसुन्दर से पूछा, “क्या हुआ? हमसे क्या गलती हो गयी? क्या ऐसा कुछ है जिस पर हम काम कर सकते हैं?” परन्तु गुणसुन्दर ने कोई उत्तर नहीं दिया। रत्नसुन्दरी सहायता के लिये राजा के पास गयी। राजा भी न केवल कारण जानने में असफल रहे बल्कि गुणसुन्दर को मना भी नहीं कर सके। दिन की घोषणा कर दी गई और पूरा शहर यह देखकर दुखी था कि क्या होने वाला है।

जब दिन आया तो पूरा नगर, यहां तक कि राजा भी वहां मौजूद थे, जहां गुणसुंदर आग में कूदकर अपनी जान देने जा रहे थे। जैसे ही गुणसुंदर आग की ओर बढ़े, राजा चिल्लाए, "क्या कोई इसे रोक सकता है?" पुण्यसर, क्योंकि उसे गुणसुंदर की दोस्ती की परवाह थी, वह गुणसुंदर की ओर चल दिया। गुणसुंदर ने चलना बंद कर दिया क्योंकि उन्हें लगा कि शायद पुण्यसार ने उनकी असली पहचान पहचान ली है और आखिरकार रहस्य खत्म हो जाएगा। पुण्यसार ने गुणसुन्दर से पूछा, “तुम ऐसा क्यों कर रहे हो?” क्या ऐसा कुछ है जो मैं कर सकूं मदद के लिए?" गुणसुन्दर इसी अवसर की प्रतीक्षा में थे। उन्होंने कहा हाँ। तुम कर सकते हो।" उन्होंने अपने पास मौजूद कागज निकाला और पुण्यसर से पूछा कि क्या यह उन्होंने लिखा है। पुण्यसर उन दो पंक्तियों को देखकर आश्चर्यचकित रह गया जो उसने उन लड़कियों के घर पर लिखी थीं जिनसे उसने शादी की और छोड़ दिया। पुण्यसार ने कहा, "हां, मैंने उन्हें लिखा है।"

Gunasundari immediately took off her bonnet. Her hairs went flying due to the wind. The people were puzzled to see this, and before they understood the situation, Gunasundar bowed to Punyasar and said, “I am Gunasundari.” Now it clicked in Punyasar’s mind what the goddess said, “Gunasundar is your wife.” Tears started flowing from his eyes, and he hugged Gunasundari in front of everyone. The people, the king, and Ratnasundari did not know what was going on. Punyasar told the crowd in broken words, “Gunasundar is no one but my wife Gunasundari of Ballbhipur, whom I married with her six sisters about six months ago. It was cruel on my part that I left them without telling anything about me.” Everybody was relieved. Ratnasundari was puzzled about what to do. The king explained that since she was married to Gunasundar, she would be Punyasar’s wife. Ratnasundari was amazed at the fate. She bowed to Punyasar. Punyasar hugged her, and asked for her forgiveness for the things he had said while they were students. Everybody dispersed and went home.

Since there was not any message from Gunasundari for the six month period, Gunasundari’s sisters came to Gopalak in search of their husband too. They came to know the whole story when they arrived in town. They met Punyasar, Gunasundari, and Ratnasundari. They all lived happily thereafter.`,
  },
  {
    id: "story10",
    name: "Sage Nandisen (ऋषि नंदीसेन)",
    imageUrl: "",
    content: `ऋषि नंदीसेन एक महान तपस्वी और शास्त्रों के अच्छे जानकार थे। उन्होंने पूरी निष्ठा से भिक्षुओं की सेवा करने का व्रत लिया। भिक्षुओं की सेवा करने की उनकी भक्ति स्वर्ग में भी लोकप्रिय थी।

    एक दिन देवदूतों की सभा में इंद्र ने उनकी सेवाओं की खुले तौर पर सराहना की। एक देवदूत को इस बात पर विश्वास नहीं हुआ और उसने ऋषि नंदीसेन की परीक्षा लेने का फैसला किया।
    
    देवदूत देवता एक क्षण में कोई भी रूप धारण कर सकते हैं और पलक झपकते ही कहीं भी पहुँच सकते हैं। यह देवता गांव के बाहरी इलाके में पहुंचे जहां ऋषि नंदीसेन को उनकी "दासता की प्रतिज्ञा" का परीक्षण करना था और उन्होंने दो भिक्षुओं का रूप धारण किया। एक बहुत बूढ़ा और रोगग्रस्त भिक्षु बन गया, जबकि दूसरा युवा और स्वस्थ भिक्षु बन गया।
    
    यह वह दिन था जिस दिन ऋषि नंदीसेन को अपना उपवास तोड़ना था। जब वह गोचरी (भिक्षा) लेकर आया और व्रत तोड़ने ही वाला था, तो युवा भिक्षु उसके पास आया और बोला, “हे धन्य! वहाँ एक बहुत बूढ़ा भिक्षु है जो दस्त, अत्यधिक प्यास और भूख से पीड़ित है। वह कमज़ोर है और उसे आपकी मदद की ज़रूरत है।”
    
    ये शब्द सुनकर ऋषि तुरंत उठे और अपने साथ शुद्ध जल लेकर उस स्थान पर गए जहां वृद्ध भिक्षु थे। नंदीसेन को देखते ही वृद्ध भिक्षु क्रोधित हो उठे, “अरे दुष्ट, मैं यहाँ पड़ा-पड़ा दुःख भोग रहा हूँ और तुमने यह भी नहीं सोचा कि किसी को सहायता की आवश्यकता है या नहीं।”
    
    ऋषि नंदीसेन इन शब्दों से आहत नहीं हुए। उनमें सहनशीलता, क्षमा और करुणा के गुण विकसित हो गए थे। उन्होंने शांति से उत्तर दिया, “हे भिक्षुओं में श्रेष्ठ, कृपया मेरी भूल को क्षमा करें। मैं तुम्हारे पीने के लिये शुद्ध जल लाया हूँ।”
    
    उसने बूढ़े भिक्षु को पानी पीने में मदद की। उसने उसके कपड़े, उसका शरीर साफ किया और उसे बैठने में मदद की। बूढ़ा भिक्षु एक बार फिर चिढ़ गया। उसने भौंहें सिकोड़ते हुए कहा, “अरे मूर्ख, क्या तुम्हें दिखाई नहीं देता कि मैं बैठने के लिए बहुत कमजोर हूं। आप मेरे साथ क्या कर रहे हैं?"
    
    ऋषि नंदीसेन ने कहा, "मैं आपका समर्थन करूंगा।" वृद्ध भिक्षु को बिठाकर उन्होंने कहा, "हे पूज्य भिक्षु, यदि आप चाहें तो मैं आपको उपाश्रय (वह स्थान जहां भिक्षु अस्थायी रूप से रहते हैं) में ले जाऊं जहां आप अधिक आरामदायक होंगे।"
    
    भिक्षु ने उत्तर दिया, “तुम मुझसे क्यों पूछ रहे हो? आप जैसा चाहें वैसा कर सकते हैं।”
    
    ऋषि नंदीसेन ने साधु को अपने कंधों पर बैठाया और धीरे-धीरे आगे बढ़े। वह हर कदम को ध्यान से देखते हुए धीरे-धीरे चला। बूढ़ा भिक्षु (स्वर्गदूत देवता) उसका परीक्षण करने के लिए दृढ़ था, इसलिए उसने धीरे-धीरे अपना वजन बढ़ाया। कंधे पर भार बढ़ने से ऋषि नंदीसेन कांपने लगे और वे लगभग गिर पड़े। भिक्षु ने कहा, “अरे दुष्ट, तुम्हें क्या हो गया है? क्या तुम्हें चलना नहीं आता? तुम मेरे पूरे शरीर को हिला रहे हो. क्या बीमारों की सेवा करने का यह कोई तरीका है?”
    
    उनके शब्द अत्यंत कड़वे और कठोर थे, परंतु ऋषि नंदीसेन तनिक भी विचलित नहीं हुए। उन्होंने कहा, ''मुझे क्षमा करें. मैं अधिक सावधान रहूँगा।”
    
    बाद में वृद्ध साधु ने मलत्याग किया और दुर्गंध असहनीय थी, लेकिन साधु बिल्कुल भी परेशान नहीं हुए। उसने इस पर ध्यान नहीं दिया और चलता रहा और इस बात का ध्यान रखा कि उसकी किसी भी गलती से साधु को ठेस न पहुंचे। रास्ते में उसने सोचा कि साधु को कैसे ठीक किया जाए।
    
    वह साधु के साथ उपाश्रय में पहुंचे। इस पूरे समय के दौरान वृद्ध भिक्षु ऋषि नंदीसेन को देख रहे थे और इतनी पीड़ा के बाद भी उन्होंने ऋषि नंदीसेन की मदद करने की प्रकृति में कोई बदलाव नहीं देखा। तो बूढ़ा भिक्षु वापस देवदूत में बदल गया और उसने तुरंत ऋषि नंदीसेन को श्रद्धांजलि देते हुए कहा, “आप धन्य हैं। हे ऋषि, आप एक सच्चे साधु का उदाहरण हैं। आप वैसे ही हैं जैसे भगवान इंद्र ने वर्णित किया है। मैं तुमसे बहुत प्रसन्न हूं और तुम जो चाहोगे वह तुम्हें प्रदान करूंगा।''
    
    “हे भगवान, यह मानव जीवन बहुत ही दुर्लभ रूप से प्राप्त होता है। मानव अस्तित्व से अधिक मूल्यवान कुछ भी नहीं है। मैं संतुष्ट हूं। मुझे किसी चीज़ की लालसा नहीं है।” भगवान ने ऋषि के चरणों में सिर झुका दिया। भगवान ऋषि के गुणों की सराहना करते हुए अपने निवास पर लौट आए।`,
  },
  {
    id: "story11",
    name: "King Hansa (राजा हंस)",
    imageUrl: "",
    content: `राजपुर नगर में हंसा नाम का एक राजा था। वह एक निष्पक्ष एवं न्यायप्रिय राजा था। वह सत्य और अहिंसा के प्रति समर्पण के लिए जाने जाते थे। रत्नश्रृंगा पर्वत की चोटी पर, एक सुंदर मंदिर था जो पहले तीर्थंकर ऋषभदेव को समर्पित था। चैत्र माह में जब पूर्णिमा आती थी तो दूर-दूर से लोग मंदिर में दर्शन-पूजन करने आते थे। एक बार राजा ने भी मंदिर जाने का निश्चय किया। उन्होंने अपने राज्य का नियंत्रण अस्थायी रूप से अपने मंत्रिपरिषद को दे दिया और शाही घराने के सदस्यों के साथ इस आध्यात्मिक मिशन पर निकल गये।

    राजा हंसा के जाने के कुछ दिनों बाद, अर्जुन नाम के एक अन्य राजा ने राजा हंसा के शहर पर हमला कर दिया। कड़ी लड़ाई के बावजूद, राजा हंस की सेना हार गई और कई सेनापतियों ने युद्ध के मैदान में अपनी जान गंवा दी। राजा अर्जुन ने महल और राजकोष पर नियंत्रण प्राप्त कर लिया। अर्जुन सिंहासन पर बैठे और पूरे राज्य पर अपना अधिकार जमा लिया।
    
    राजा हंसा ने मंदिर के रास्ते में इस हार की कहानी सुनी। राजा के दरबारी बहुत परेशान हुए और उन्होंने उसे सलाह दी कि उसे शहर लौट जाना चाहिए। राजा ने कहा, “मैंने राज्य का नियंत्रण छोड़ दिया है और हम आध्यात्मिक मिशन पर हैं और हमें इसी बारे में सोचना चाहिए। तो चलिए हम मंदिर चलते रहें।” राजा के दरबारी राजा के फैसले से नाखुश थे और घर में अपने परिवारों की सुरक्षा को लेकर चिंतित थे। एक-एक करके वे सभी बाहर निकल गये और अब राजा के पास केवल एक छत्रधारी सेवक ही बचा था।
    
    मंदिर जाते समय राजा जंगल में भटक गये। अब उसे अपनी सुरक्षा की चिंता थी इसलिए उसने अपनी शाही पोशाक और गहने उतारकर अपने नौकर को दे दिए। जंगल में घूमते समय यह सेवक भी राजा से बिछड़ गया।
    
    जैसे ही राजा आगे चला, अचानक एक हिरण उसके सामने से दौड़कर गायब हो गया। उसके ठीक बाद एक शिकारी हाथ में धनुष लेकर दौड़ता हुआ आया और राजा से पूछा कि क्या उसने हिरण को देखा है। राजा जानता था कि यदि उसने सच बताया तो हिरण मारा जायेगा। इसलिए उन्होंने सवाल का जवाब न देने का फैसला किया और दूसरी अप्रासंगिक बातें बताते रहे. तो उसने कहा कि वह राजपुर से आया है. शिकारी ने उससे फिर से हिरण के बारे में पूछा और उसने उत्तर दिया कि वह राजा है। शिकारी उसके उत्तर से बहुत परेशान हुआ और क्रोधित होकर चला गया।
    
    अब तक राजा थक चुका था और एक पेड़ के नीचे आराम कर रहा था। उसने झाड़ियों में अगले दो दिनों में इस रास्ते से गुजरने वाले भिक्षुओं को लूटने की चल रही चर्चा सुनी। राजा भिक्षुओं की सुरक्षा को लेकर चिंतित हो गये। जब वह सोच रहा था कि वह क्या कर सकता है, कुछ पुलिसकर्मी उसके पास आये और पूछा कि क्या उसने लुटेरों जैसे दिखने वाले किसी संदिग्ध व्यक्ति को देखा है। उन्होंने कहा, ''ये लोग बहुत खतरनाक हैं और हमने सुना है कि ये पवित्र लोगों को नुकसान पहुंचाते हैं. पवित्र लोगों की रक्षा के लिए यदि आवश्यक हो तो हमें उन्हें पकड़ने या गोली मारने के लिए भी भेजा जाता है।''
    
    राजा एक बार फिर दुविधा में पड़ गया कि सच बताऊँ या नहीं। उन्हें चिंता थी कि यदि उन्होंने उन लोगों के बारे में बताया तो उन्हें नुकसान होगा और यदि नहीं बताया तो भिक्षुओं को नुकसान होगा। उसने सोचा, “सच बोलने से अगर किसी को नुकसान होने वाला है या उसकी हत्या होने वाली है तो वह सच बोलना सच नहीं है। सत्य का उद्देश्य किसी की रक्षा करना है न कि किसी को नुकसान पहुंचाना।'' उन्होंने कहा, “मेरे दोस्तों, आपसे भिक्षुओं की रक्षा करने के लिए कहा जाता है। क्यों न जाकर उन भिक्षुओं की देखभाल की जाए और यदि लुटेरों ने भिक्षुओं का सामना किया तो उनकी चिंता क्यों न की जाए।” पुलिसकर्मियों को बेहतर महसूस हुआ और वे भिक्षुओं के साथ शामिल होने के लिए चले गए।
    
    यह सब झाड़ी में छिपे लुटेरों ने सुन लिया। वे इस अजनबी द्वारा दिखाई गई दया से आश्चर्यचकित थे। वे बाहर आए और अपनी जान बचाने के लिए उन्हें धन्यवाद दिया, और उन्हें बताया कि वे उनकी सेवा में हैं। राजा ने उन्हें सलाह दी, "मेरे प्यारे दोस्तों, लोगों को परेशान करना और भगोड़ा जीवन छोड़ दो और अच्छे नागरिक बनो।" लुटेरों ने वादा किया कि वे अब भिक्षुओं को नुकसान नहीं पहुँचाएँगे और डकैती छोड़ने की कोशिश करेंगे और चले गए।
    
    जैसे कि यह पर्याप्त नहीं था, घुड़सवारों का एक समूह आया और उससे पूछा कि क्या उसने राजा हंसा को देखा है। राजा ने पूछा, “तुम राजा हंस से क्या चाहते हो?” उन्होंने बताया कि वे राजा अर्जुन के भरोसेमंद आदमी थे और उन्हें राजा हंसा को पकड़ने और उसे मारने के लिए कहा गया था। राजा हंसा ने कुछ देर सोचा और कहा, “मैं राजा हंसा हूं। अपने राजा के कहे अनुसार अपना कर्तव्य निभाओ।” इतना कहने के बाद उन्होंने अपनी आंखें बंद कर लीं और ध्यान में खड़े होकर नवकार मंत्र का जाप करने लगे।
    
    तभी एक देव (स्वर्गदूत) प्रकट हुआ और बोला, “हे राजा! मैं आपकी सत्यता और करुणा से अभिभूत हूं। मैंने राजा अर्जुन को बंदी बना लिया है और आपके राज्य का नियंत्रण आपके मंत्रियों को दे दिया है। आज पूजा-पाठ के लिए बहुत अच्छा दिन है और मंदिर यहां से बहुत दूर है। ऐसा कोई रास्ता नहीं है जिससे आप समय पर वहां पहुंच सकें। मेरा रथ आपकी सेवा में है। कृपया मुझे आपको वहां ले जाने दीजिए।''
    
    राजा हंसा घटनाओं के चमत्कारी मोड़ से आश्चर्यचकित था। देवदूत देव की संगति में, वह पूजा करने के लिए समय पर रत्नश्रृंगा के शिखर पर पहुंचे। फिर देवदूत भगवान ने उसे उसके राज्य तक पहुँचाया। राजा हंसा ने राजा अर्जुन को क्षमा कर दिया और उनके सैनिकों को तुरंत रिहा कर दिया। देवदूत ने राजा और उसके राज्य की सुरक्षा की देखभाल के लिए चार लेफ्टिनेंट नियुक्त किए और चला गया। तब राजा हंसा ने एक बार फिर राजपुर शहर पर शासन किया और लोग खुश थे।`,
  },
  {
    id: "story12",
    name: "Sumitra (सुमित्रा)",
    imageUrl: "",
    content: `बहुत समय पहले श्रीचन्द्र नगर में राजा तारापीड का सुमित्रा नाम का एक मंत्री था। वह एक समर्पित श्रावक थे और नियमित रूप से सामायिक, प्रतिक्रमण और अन्य धार्मिक अनुष्ठानों का अभ्यास करते थे। एक दिन, राजा ने सुमित्रा से पूछा कि उसने इन सभी बेकार गतिविधियों में खुद को इतना व्यस्त क्यों कर लिया है। राजा जानना चाहता था कि उसने उनसे क्या हासिल किया, और सुझाव दिया कि उसे उन चीज़ों को छोड़ देना चाहिए ताकि वह एक सुखद जीवन जी सके।

    सुमित्रा ने राजा से कहा, ''मुझे हतोत्साहित करने के बजाय, आपको इन गतिविधियों को पूरा करने में मेरी मदद करनी चाहिए। आपको या किसी को भी यह जानना चाहिए कि अच्छे कर्म किसी की भलाई में मदद करते हैं।
    
    एक दिन, मंत्री ने दरबार में अपना कर्तव्य पूरा किया और घर चला गया। यह चौदहवाँ चंद्र दिवस था, जिसे चतुर्दशी के नाम से जाना जाता है। वह उस दिन उपवास कर रहा था। उन्हें मंदिर में पौषध करने में देर हो गई। इसलिए उन्होंने रात्रि में सूर्योदय तक घर से बाहर न निकलने की प्रतिज्ञा की और प्रतिक्रमण के लिए बैठ गये।
    
    रात्रि के समय एक दूत ने आकर सुमित्रा से कहा कि राजा उनसे मिलना चाहते हैं।
    
    मंत्री ने उससे कहा कि वह उस समय राजा या किसी को भी नहीं देख सकता। राजा ने दूसरा संदेश भेजकर कहा कि यदि वह तुरंत राजा के पास नहीं गया तो उसे अपना पद त्याग देना चाहिए और अपनी शाही मुहर सौंप देनी चाहिए।
    
    सुमित्रा ने अपना व्रत जारी रखने का निश्चय किया। उसने दूत से कहा कि वह शाही मुहर लगा दे और राजा से कह दे कि वह नहीं आ सकेगा।
    
    राजा के पास वापस जाते समय दूत ने सोचा कि स्वयं मंत्री बनना कोई बुरा विचार नहीं है। तो वह बोलने लगा, "मैं मंत्री हूं, मैं मंत्री हूं।" वह इसे और जोर-जोर से दोहराने लगा। ऐसा हुआ कि कुछ मिनटों के बाद, कुछ हथियारबंद लोग उस पर कूद पड़े, उसे जमीन पर पटक दिया और उसकी हत्या कर दी। उन्होंने कार्यालय की मंत्री की मुहर छीन ली।
    
    जब राजा ने दूत की मृत्यु के बारे में सुना, तो उसने एक खुली तलवार उठाई, और मंदिर में जाने के लिए निकल गया। उसे यकीन हो गया कि इस हत्या में सुमित्रा का हाथ है. रास्ते में उसे अपना दूत मिला जो मृत पड़ा था और उसके आसपास कुछ हथियारबंद लोग थे। उसने लोगों से पूछा, "तुमने इस आदमी को क्यों मार डाला?"
    
    उन्होंने कहा, “हम धारावर के राजा सूरसेन के हथियारबंद आदमी हैं और मंत्री सुमित्रा को मारने के लिए यहां आये हैं।
    
    राजा ने उन्हें बताया कि वह कौन है। वे लोग डर गये और उन्होंने उसके सामने आत्मसमर्पण कर दिया। उसने सोचा, “अच्छा हुआ जो सुमित्रा नहीं आयी। उसकी प्रतिज्ञा ने उसे बचा लिया।”
    
    राजा का क्रोध शांत हो गया. वह सुमित्रा के घर पहुंचा और उससे कहा, “यदि तुम आज अपनी प्रतिज्ञा न करती तो तुम मारे गये होते। यह राज्य के लिए एक भयानक त्रासदी होती। मैं आपको आपके कार्यालय में बहाल करता हूं। मैंने तुम्हारे साथ जो किया उसके लिए मुझे खेद है।”
    
    इस घटना ने राजा को बहुत धार्मिक व्यक्ति बना दिया। राजा ने आचार्य पूर्णचन्द्र से मुलाकात की और श्रावक की प्रतिज्ञा स्वीकार कर ली। दरबार को आध्यात्मिक सभा में तब्दील कर दिया गया। सुमित्रा अब राजा के लिए और भी खास हो गई और राजा ने अपनी प्रजा और राज्य के लिए कई अच्छे काम किए।`,
  },
  {
    id: "story13",
    name: "Mairavati (मैरावती)",
    imageUrl: "",
    content: `बहुत समय पहले क्षितप्रतिस्थिता नगर में ऋतुमर्दन राजा थे। उनकी पत्नी मदनरेखा अत्यंत समर्पित एवं धार्मिक रानी थीं। उन्होंने एक बच्ची को जन्म दिया और उसका नाम मैरावती रखा। राजकुमारी सुन्दर और तेजस्वी थी। राजा ने उनकी सामान्य शिक्षा की व्यवस्था की, जबकि रानी ने उनकी आध्यात्मिक शिक्षा का ध्यान रखा।

    एक दिन जब दरबार चल रहा था तो रानी ने मैरावती को वहां भेजा। वह अपने बेहतरीन वस्त्र और आभूषण पहने हुई थी। उसके पिता ऋतुमर्दन ने उसे अपने साथ राजगद्दी पर बैठाया था। राजा ने अपने दरबारियों से पूछा, “क्या इस संसार में किसी के पास मेरे जितना धन है?”
    
    दरबारियों ने उत्तर दिया, “महाराज, हम इतनी संपत्ति के बारे में तो सपने में भी नहीं सोच सकते। इस संसार में आपके जितनी संपत्ति किसी के पास नहीं है।”
    
    राजकुमारी ने असहमति जताते हुए कहा, “ऐसे कई अन्य राजा भी हो सकते हैं जिनके पास समान या अधिक खजाना हो। हमारे पास जो कुछ है उस पर हमें घमंड नहीं करना चाहिए।” राजा ने इस टिप्पणी को नजरअंदाज कर दिया।
    
    उन्होंने दूसरा प्रश्न किया, “आप सभी किसकी कृपा से प्रसन्न हैं?
    
    दरबारियों ने उत्तर दिया, “आपकी कृपा से, महाराज। इसके बारे में कोई संदेह नहीं है।"
    
    राजकुमारी फिर असहमत हुई। उसने कहा, “आप सभी को क्या परेशानी है? आपको उसकी चापलूसी करने की ज़रूरत नहीं है। आप जानते हैं, हमें जो मिलता है वह हमारे अपने कर्मों के कारण होता है। पिताजी, यदि आप सोचते हैं कि आप सभी को खुश कर सकते हैं, तो आप सभी को अपने समान स्तर पर खुश क्यों नहीं करते? यह असंभव है, क्योंकि आप केवल निमित्त कारण हैं, और जो हो रहा है वह हर किसी के अपने कर्मों के परिणाम के अलावा और कुछ नहीं है।
    
    राजा क्रोधित हो गया और चिल्लाया, “पागल लड़की! आप मेरे ख़िलाफ़ क्यों बात कर रहे हैं? तुम्हें ऐसी बात किसने सिखा दी? तुम जानते हो कि मैं एक गरीब आदमी को अमीर या अमीर आदमी को गरीब आदमी बना सकता हूँ। यदि आप मुझसे सहमत हैं, तो मैं आपकी शादी एक राजकुमार से कर दूंगा, लेकिन यदि आप असहमत हैं तो मैं आपकी शादी एक गरीब लड़के से कर दूंगा और आप देखेंगे कि आपके कर्म कैसे काम करते हैं।
    
    राजकुमारी ने शांति से अपने पिता को उत्तर दिया, "आप ग़लत हैं।" उसने आगे कहा, “अगर मेरे पक्ष में अच्छे कर्म नहीं हैं, तो मेरे लिए चुने गए सबसे अच्छे दूल्हे भी भिखारी बन सकते हैं। हमें ऐसे घमंड नहीं करना चाहिए जैसे कि हम कुछ भी और सब कुछ कर सकते हैं।”
    
    राजा बहुत परेशान हुआ. उसने अपने रक्षकों को आदेश दिया, “जाओ और सबसे गरीब, सबसे नीच और सबसे बदसूरत आदमी को ढूंढो, और मैं उसकी शादी उससे कर दूंगा। मैं देखना चाहता हूं कि उसके कर्म उसकी रक्षा कैसे करते हैं।
    
    राजकुमारी शांत रही. राजा के आदमियों को एक कोढ़ी मिला और वे उसे दरबार में ले आये। उसके कान सड़ चुके थे, नाक चपटी थी और उसकी अंगुलियों से हर जगह मवाद बह रहा था। राजा उनकी पसंद से बहुत खुश हुए। उसने राजकुमारी से कहा, “उद्देश्य लड़की! मेरा आदेश है कि तुम उससे विवाह करो।”
    
    राजकुमारी को कोई झिझक नहीं हुई। वह धीरे-धीरे नीचे आई और इस आदमी को अपने विवाहित पति के रूप में स्वीकार कर लिया। दरबार में सभी लोग स्तब्ध रह गये। राजा को अपने कार्यों से संतुष्टि महसूस हुई। राजकुमारी को अपने कीमती कपड़े और गहने उतारने के लिए कहा गया और शहर छोड़ने का आदेश दिया गया। राजकुमारी और उसका पति शहर छोड़कर चले गये।
    
    राजकुमारी हमेशा की तरह खुश थी। उसने अपने पिता को जो कुछ भी बताया था उस पर उसे कभी पछतावा नहीं हुआ। उसे अपनी धार्मिक आस्था पर पूरा भरोसा था. वे पूरे दिन चलते रहे और बाद में शाम को उन्होंने एक मंदिर में शरण ली। कोढ़ी उस पर बहुत दयालु था। उसने उससे कहा, “मुझे पता है कि तुम्हारे पिता ने जो किया वह सही नहीं था और एक शाही लड़की के लिए एक कोढ़ी से शादी करना आसान नहीं है। मैं तुम्हें इस शादी से मुक्त करता हूं और तुमसे एक बेहतर इंसान ढूंढने का अनुरोध करता हूं।
    
    राजकुमारी ने उससे कहा, “तुम ऐसी बात क्यों कर रहे हो? मैंने आपको अपने पति के रूप में स्वीकार कर लिया है और मैं अपनी पसंद से खुश हूं। उन्होंने आगे कहा, “धन, स्वास्थ्य, सुंदरता और आराम या असुविधा हमारे कर्मों के कारण आती है। उससे हमें प्रसन्न या दुःखी नहीं होना चाहिए। कर्म बदलते हैं और उनके परिणाम बदलते हैं। तो, आइए हम इसके बारे में चिंता न करें।
    
    उसके उत्तर से कोढ़ी बहुत प्रभावित हुआ और राजकुमारी की प्रशंसा करने लगा। उसने सोचा, “कितनी नेक औरत है! उसकी धार्मिक मान्यताएँ कितनी मजबूत हैं!! जैसे ही सूरज ढल गया, कोढ़ी सो गया।
    
    राजकुमारी अभी भी जागकर प्रार्थना कर रही थी। उसने देखा कि एक वृद्ध महिला एक युवक के साथ उनकी ओर आ रही है। बुढ़िया ने राजकुमारी से कहा, “मुझे पता है कि तुम्हें क्या हुआ है। मुझे तुम्हारे पिता का व्यवहार पसंद नहीं आया और मैं तुम्हारी मदद करने आया हूं। मैं अपने साथ एक सुन्दर युवक को लाया हूँ, और तुम्हें उस कोढ़ी को त्याग कर इस युवक से विवाह कर लेना चाहिए। आप उससे खुश रहेंगे।”
    
    राजकुमारी ने बुढ़िया से कहा, “महोदया, मैंने अपनी इच्छा से और अपने पिता की सहमति से इस आदमी से शादी की है और मैं इससे पीछे नहीं हट रही हूँ। एक महिला केवल एक बार शादी करती है और मैंने ऐसा किया है।' वह कोढ़ी हो सकता है लेकिन मेरे लिए वह राजाओं का राजा है, मेरा राजा है।”
    
    बुढ़िया क्रोधित हो गई और बोली, “अगर तुम मेरी सलाह मानोगे तो खुश रहोगे, नहीं तो मैं तुम्हें मार डालूंगी।” राजकुमारी पवित्र णमोकार मंत्र का उच्चारण करने लगी। तुरन्त, एक चमत्कार हुआ। वहाँ न कोढ़ी था, न बुढ़िया। इसके बजाय, एक दिव्य व्यक्ति उसके सामने खड़ा था। उन्होंने कहा, “मैं वैताढ्य पहाड़ी पर स्थित मणिपुर नामक नगर का राजा मणिचूड़ हूं। एक बार मैंने किसी को यह कहते हुए सुना,
    
    "कौवे हर जगह काले हैं,

तोते हमेशा हरे रहते हैं,

हर जगह खुशियाँ ही खुशियाँ,

दुख, अभागे लोग अंदर हैं!”

इसलिए, मैंने इसका परीक्षण करने का निर्णय लिया। इसलिए, यह जानने के लिए मैंने खुद को कोढ़ी में बदल लिया। राजा के आदमी मुझे उठा ले गये। आपने साबित कर दिया कि सच्चा खुश व्यक्ति किसी भी स्थिति में खुश रह सकता है। आप सचमुच आदरणीय एवं प्रशंसनीय हैं। तुम्हें अपनी पत्नी और रानी के रूप में पाकर मैं कितना भाग्यशाली हूं।''

राजकुमारी को नहीं पता था कि यह एक सपना था या यह सच था। वह अब भी अपने विश्वास पर कायम थी कि पवित्रता हमेशा चमकती रहती है। राजकुमारी ने उस दिव्य पुरुष, अपने पति के प्रति कृतज्ञता प्रकट की और स्वीकार किया कि यह भी उसके कर्मों के कारण हुआ है। उसके बाद से वे खुश रहे।`,
  },
  {
    id: "story14",
    name: "Kesari (केसरी)",
    imageUrl: "",
    content: `राजा विजयचंद्र कामरूप नगर के शासक थे। उसी नगर में संघदत्त नाम का एक व्यापारी रहता था, जिसके केसरी नामक एक पुत्र था। व्यापारी अपनी ईमानदारी के लिए जाना जाता था, लेकिन उसका बेटा नहीं। वह एक चोर था. व्यापारी ने उसे बदलने की बहुत कोशिश की, लेकिन वह सफल नहीं हो सका। वह अपने बेटे की आदत से इतना तंग आ गए कि उन्होंने उसे छोड़ दिया। व्यापारी राजा के पास गया और यह बात उनके ध्यान में लाई। उन्होंने कहा, ''मुझे शर्म आती है कि मेरा बेटा ऐसा है. कृपया, आप उसका ख्याल रखें, क्योंकि मैं उससे कोई लेना-देना नहीं रखना चाहता।”

    राजा ने पुत्र को बुलाया और उसे अपना राज्य छोड़कर चले जाने को कहा। केसरी ने नगर छोड़ दिया। जंगल पार करते समय उसे एक पानी का तालाब दिखाई दिया। उसने थोड़ा पानी पिया और आराम करने बैठ गया। अचानक उसने एक आदमी को आसमान से उतरते देखा। उसने देखा कि वह आदमी जादुई सैंडल पहने हुए था। जैसे ही वह आदमी नीचे आया, उसने अपनी चप्पलें उतारकर पेड़ के नीचे छिपा दीं और फिर पानी पीने के लिए पानी की टंकी के पास आया। केसरी ने सोचा कि जादुई सैंडल ने इस आदमी को आकाश में उड़ने में मदद की है।
    
    केसरी धीरे से बाहर निकला और सैंडल उठाई, उन्हें पहना और उड़ने लगा। वह दिन भर उड़ता रहा और फिर शाम को घर लौट आया। वह राजा को उसकी सूचना देने के लिए अपने पिता पर क्रोधित था। इसलिए वह उसके घर गया और अपने पिता को इतना पीटा कि बूढ़े की मौत हो गई.
    
    केसरी पहले से ही एक अनुभवी चोर था, और अब उसके पास एक जोड़ी सैंडल थी जो उसे कहीं भी ले जा सकती थी। वह हर जगह गया जहां वह जाना चाहता था। वह रात के दौरान जो कुछ भी कर सकता था चुरा लेता था और दिन के दौरान वह जंगल में छिप जाता था।
    
    जल्द ही, वह सभी के लिए आतंक बन गया। हर कोई उससे डरता था. नागरिक मदद मांगने के लिए राजा के पास गए। पहरेदारों ने राजा से कहा, “वह अब तक ज्ञात किसी भी अन्य चोर से भिन्न है। वह आकाश में उड़ जाता है और रात को ही लौटता है। उसे पकड़ना लगभग असंभव होगा।”
    
    राजा ने स्वयं उसे पकड़ने का प्रयास करने का निश्चय किया। राजा के दल ने हर जगह खोजबीन की, लेकिन चोर का पता नहीं चल सका। एक सुबह जंगल में राजा को हवा में कुछ सुगंध महसूस हुई। वह उस गंध का तब तक पीछा करता रहा जब तक वह एक मंदिर तक नहीं पहुंच गया जो देवी अंबिका को समर्पित था। जब वह मंदिर में दाखिल हुआ तो उसने देखा कि एक आदमी पूजा कर रहा है।
    
    राजा ने उससे पूछा कि वह कौन है? उस आदमी ने उत्तर दिया, “मैं एक व्यापारी का बेटा हूँ। मैं बहुत गरीब और दुखी हूं. मैं धन और सुख पाने के लिए इस देवी की पूजा करता हूं। हर सुबह जब मैं यहां आता हूं तो मुझे बहुमूल्य रत्न और पत्थर मिलते हैं।”
    
    राजा को लगभग यकीन हो गया कि चोर वही है लेकिन उसके पास उसे पकड़ने के लिए कोई सबूत नहीं था। उसने यह भी सोचा कि चोर देर रात को मंदिर में आता होगा और सुबह प्रार्थना के बाद चला जाता होगा। इसलिए राजा ने रात के समय वापस लौटने और यह देखने का फैसला किया कि क्या हो रहा है। वह अंधेरा होने तक इंतजार करने के लिए शहर लौट आया। अँधेरा होने पर राजा मन्दिर में लौट आया। देर रात केसरी आकाश से नीचे आये। उसने अपनी जादुई सैंडल निकाली और उन्हें अपने हाथ में पकड़ लिया। केसरी ने अपनी पूजा समाप्त करने के बाद मंदिर से बाहर जाना शुरू कर दिया। राजा ने केसरी का पीछा किया। यह इतनी तेजी से हुआ कि उसने अपनी चप्पलें गिरा दीं और जान बचाने के लिए भागने लगा। राजा के आदमी भी उसका पीछा करने लगे।
    
    केसरी भागते-भागते अब अपने बुरे कर्मों और पापों के बारे में सोच रहा था। कभी-कभी, समय पर किया गया चिंतन किसी व्यक्ति को बदल सकता है। कुछ देर भागने के बाद उसे जंगल में एक साधु मिला। वह रुका और साधु से बात की। तब तक, उसके बुरे कर्म समाप्त हो चुके थे और उसके अच्छे कर्म परिपक्व हो गए थे। उन्होंने भिक्षुत्व स्वीकार करने के बारे में सोचा और उन्होंने वैसा ही किया। इससे पहले कि राजा उसे गिरफ्तार कर पाता, वह भिक्षु बन गया। जब राजा ने उसे साधु के रूप में देखा तो उसे लगा कि उसे पकड़ने में बहुत देर हो गयी है। राजा को अच्छा लगा कि चोर ने साधु बनकर अपनी जीवन शैली बदल ली और राजा उसके साधुत्व के प्रति नतमस्तक हो गया।
    
    राजा शहर वापस चला गया और लोग बिना किसी चोरी के रहने लगे। केसरी ने गृहस्थों को मुक्ति का मार्ग दिखाते हुए साधु का जीवन व्यतीत किया और अंत में स्वर्ग चले गये।`,
  },
  {
    id: "story15",
    name: "Surasen and Mahasen (सूरसेन और महासेन)",
    imageUrl: "",
    content: `क्षितिप्रतिष्ठित नगर में वीरसेन नाम का एक राजा रहता था। उनके दो पुत्र थे, शूरसेन और महासेन। दोनों भाई गहरे सौहार्दपूर्ण संबंधों के साथ बड़े हुए।

    अचानक महासेन की जीभ पर फोड़ा हो गया। यह आकार में बढ़ गया, अधिक दर्दनाक हो गया और उसे आराम नहीं करने दिया। उन्होंने उसे ठीक करने के सभी उपाय किये लेकिन असफल रहे। लोगों से भी उसकी पीड़ा देखी नहीं गयी. उन्हें ठीक करने की सारी कोशिशें नाकाम रहीं और आख़िरकार डॉक्टरों ने इसे एक लाइलाज समस्या घोषित कर दिया। कुछ समय बाद बीमारी इतनी बढ़ गई कि उनकी सांसों से भयानक दुर्गंध आने लगी। कोई भी उसके करीब नहीं आ सकता था क्योंकि वे गंध बर्दाश्त नहीं कर सकते थे। लेकिन उसका छोटा भाई सूरसेन उसे अकेला नहीं छोड़ता था। वह हमेशा अपने बिस्तर के पास बैठा रहता था। एक दिन, उसने फैसला किया कि जब तक उसका भाई ठीक नहीं हो जाता, वह कुछ भी खाना नहीं खाएगा। बाद में, उस शाम उन्हें पवित्र णमोकार मंत्र का जाप करने का मन हुआ।
    
    सूरसेन अपने भाई के बिस्तर के पास एक कप पानी लेकर आया। उसने पवित्र मंत्र का जाप किया और पानी अपने भाई की जीभ पर छिड़का। उन्हें और उनके भाई को आश्चर्य हुआ कि तत्काल कुछ राहत मिली। कई दिनों तक ऐसा करने के बाद उसके भाई की जीभ ठीक हो गई। दुर्गन्ध और फोड़ा गायब हो गया। सभी को प्रसन्नता हुई और णमोकार मन्त्र में गहरी आस्था उत्पन्न हो गई।
    
    कुछ समय बाद आचार्य भद्रबाहु उस नगर में आये। उन्हें अवधी का ज्ञान था. दोनों भाई उन्हें श्रद्धांजलि देने आये। उपदेश समाप्त होने के बाद, सूरसेन उनके पास आये और पूछा कि क्या वह उन्हें बता सकते हैं कि उनके भाई को यह कष्ट क्यों सहना पड़ा।
    
    आचार्य ने उन्हें बताया कि कैसे उनके पिछले जीवन के कारण ऐसा हुआ।
    
    “भरतक्षेत्र में मणिपुर नामक एक नगर है। वहाँ मदन नाम का एक योद्धा रहता था। वे जिन मार्ग के प्रबल आस्तिक थे। मदन के भीर और वीर नाम के दो बेटे थे। एक दिन पार्क की ओर जाते समय उन दोनों लड़कों ने सड़क पर एक साधु को लेटे हुए देखा। उन्होंने इसके बारे में पूछताछ की और पता चला कि भिक्षु ध्यान में थे जब उन्हें एक जहरीले सांप ने काट लिया था। हालाँकि, साँप उसके बिल में भाग गया था। ये सुनकर वीर उबल पड़ा. उन्होंने कहा, "यहां इतने सारे लोग थे और किसी ने सांप को क्यों नहीं मारा?"
    
    भीर ने कहा, “भाई, उसके अच्छे कर्मों के कारण साँप बच सका। लेकिन आप ऐसा पाप कर्म क्यों चाह रहे हैं?”
    
    वीर ने कहा, “भीर, क्या तुम यह नहीं समझ सकते कि साँप ने एक पवित्र साधु को डसकर बहुत बड़ा पाप किया है?” इसलिए साँप को मारना कोई पाप कर्म नहीं होगा।”
    
    भीर ने उत्तर दिया, “नहीं, दो गलत काम एक को सही नहीं बनाते। ग़लत तो ग़लत है. आपको अपनी सोच को सही ठहराने के लिए भावुक नहीं होना चाहिए। तुमने जो चाहा है उसके लिए तुम्हें पश्चाताप करना चाहिए।”
    
    वीर अभी भी परेशान था और उसने कहा, "नहीं।"
    
    साधु ने सूरसेन को बताना जारी रखा, “भीर ने तुम्हारे रूप में और वीर ने तुम्हारे भाई के रूप में पुनर्जन्म लिया है। चूँकि वह साँप को चोट पहुँचाना चाहता था और पश्चाताप नहीं करता था, इसलिए उसे अपनी जीभ पर फोड़ा होने का कष्ट सहना पड़ा। जब आपने पवित्र णमोकार मंत्र का पाठ करना शुरू किया तब तक उसके बुरे कर्म ख़त्म हो गए और ऐसा लगा मानो आपने उसकी बीमारी ठीक करने में उसकी मदद की हो।”
    
    अपने पिछले जन्मों के बारे में सुनकर उन्हें ज्ञान प्राप्त हुआ। उन्होंने सांसारिक बंधनों को त्यागने का फैसला किया और भिक्षु बन गये। वहां से उन्होंने आध्यात्मिक जीवन जीया।`,
  },
  {
    id: "story16",
    name: "Queen Chelna and King Shrenik (रानी चेल्ना और राजा श्रेनिक)",
    imageUrl: "",
    content: `यह भगवान महावीर के समय की कहानी है। उस समय राजा चेटक वैशाली के शासक थे और उनकी चेलना नाम की एक खूबसूरत बेटी थी। एक बार भरत नामक कलाकार ने चेलना का चित्र बनाकर मगध के राजा श्रेणिक (बिम्बिसार) को दिखाया। चेलना की सुंदरता से मंत्रमुग्ध होकर श्रेणिक को उससे प्यार हो गया। एक दिन चेलना मगध नगरी आई जहां उसने राजा श्रेणिक को देखा और वह भी उससे प्रेम करने लगी। उन्होंने जल्द ही शादी कर ली.

    रानी चेलना जैन धर्म की समर्पित अनुयायी थी, जबकि श्रेणिक बौद्ध धर्म से प्रभावित था। राजा बहुत उदार और विशाल हृदय वाला था, लेकिन किसी तरह वह अपनी रानी की जैन भिक्षुओं के प्रति भक्ति से खुश नहीं था। वह चेलना को यह सिद्ध करना चाहता था कि जैन साधु ढोंगी होते हैं। उनका दृढ़ विश्वास था कि कोई भी व्यक्ति उस सीमा तक आत्म-संयम और अहिंसा का पालन नहीं कर सकता है, और जैन भिक्षुओं द्वारा दिखाई गई समभाव केवल सतही थी। इससे चेलना बहुत परेशान हुई.
    
    एक दिन राजा श्रेणिक शिकार की यात्रा पर गए जहाँ उन्होंने एक जैन भिक्षु यमधर को गहरे ध्यान में लीन देखा। श्रेणिक ने अपने शिकारी कुत्तों को यमधर के पीछे छोड़ दिया लेकिन साधु चुप रहा। साधु की शांति और धैर्य देखकर कुत्ते शांत हो गए। राजा श्रेणिक को क्रोध आ गया और उन्हें लगा कि साधु ने उनके साथ कोई छल किया है। इसलिए उसने साधु पर तीर चलाना शुरू कर दिया लेकिन वे उसे चूकते रहे। अधिक परेशान होकर, उसने अंततः यमधर के गले में एक मरा हुआ साँप डाल दिया और अपने महल में वापस आ गया।
    
    राजा ने चेलना को सारी घटना बतायी। रानी को बहुत दुःख हुआ और वह राजा को वापस यमधर के ध्यान स्थल पर ले गयी। मरे हुए सांप की वजह से साधु के पूरे शरीर पर चींटियां और अन्य कीड़े रेंग रहे थे लेकिन साधु ने जरा भी हलचल नहीं की। इस जोड़े ने मानवीय सहनशक्ति की सीमाएं देखीं। रानी ने धीरे से साधु के शरीर से चींटियों और साँप को हटाया और उसके घावों को साफ किया। उन्होंने चंदन का लेप लगाया. कुछ देर बाद यमधर ने अपनी आंखें खोलीं और दोनों को आशीर्वाद दिया।
    
    भिक्षु ने उस राजा के बीच अंतर नहीं किया जिसने उसे पीड़ा पहुँचाई थी, और उस रानी के बीच जिसने उसकी पीड़ा को कम किया था। राजा श्रेणिक बहुत प्रभावित हुए और उन्हें विश्वास हो गया कि जैन भिक्षु वास्तव में राग और द्वेष से परे हैं। इस प्रकार, राजा श्रेणिक रानी चेलना के साथ भगवान महावीर के आदेश के एक समर्पित सदस्य बन गए।`,
  },
  {
    id: "story17",
    name: "ChandKaushik (चंदकौशिक)",
    imageUrl: "",
    content: `यह भगवान महावीर के बारे में एक कहानी है जब वे एक भिक्षु थे। वह व्रत, ध्यान और तपस्या करता था। वह नंगे पैर एक स्थान से दूसरे स्थान और एक गाँव से दूसरे गाँव की यात्रा कर रहे थे। एक बार महावीर ने वछाला गाँव जाने का निश्चय किया। रास्ते में उसे एक जंगल से होकर गुजरना पड़ा जहाँ चण्डकौशिक नाम का एक जहरीला कोबरा साँप रहता था। ऐसा कहा जाता था कि चंडकौशिक किसी व्यक्ति या जानवर पर अपनी बुरी, क्रोधपूर्ण दृष्टि डालकर ही उसे मार सकता था। उस जंगल के आस-पास के गाँवों के सभी लोग बिल्कुल आतंक में रहते थे।

    जब ग्रामीणों को महावीर के जंगल से गुजरने के इरादे के बारे में पता चला, तो उन्होंने उनसे दूसरा रास्ता अपनाने का आग्रह किया। महावीर को कोई डर नहीं था. उन्होंने सर्वोच्च अहिंसा का पालन किया। उनके मन में किसी के प्रति कोई नफरत नहीं थी और वे डर और घृणा को स्वयं के प्रति हिंसा मानते थे। वह स्वयं और अन्य सभी जीवित प्राणियों के साथ शांति में था। भगवान के चेहरे पर शांति और करुणा की चमक थी। उसने लोगों को आश्वस्त किया कि सब कुछ ठीक हो जाएगा और उसने खतरनाक रास्ता अपना लिया। थोड़ी देर बाद, उसने देखा कि खूबसूरत हरी भूमि ख़त्म हो रही थी और एक सुनसान, बेकन भूमि आ गई। पेड़-पौधे मर चुके थे, इसलिए उसने सोचा कि यही वह जमीन होगी जिसके बारे में गांववाले बात कर रहे थे, जहां चंदकौशिक रहता था। तो महावीर वहीं रुक गये ध्यान करने। शांति, शांति और प्रत्येक जीवित प्राणी की भलाई के लिए करुणा महावीर के हृदय से बहती थी।
    
    चण्डकौशिक को आभास हुआ कि कोई उसकी जमीन के पास आया है तो वह अपने आवास से बाहर निकल आया। उसे आश्चर्य हुआ जब उसने वहां एक आदमी को खड़ा देखा। वह यह सोचकर क्रोधित हो गया, "उसकी मेरी भूमि के इतने करीब आने की हिम्मत कैसे हुई?" चंडकौशिक महावीर को धमकाने के लिए फुफकारने लगा. उन्होंने महावीर की शांति को नहीं समझा। वह क्रोधित हो गया और भगवान के करीब आया और अपना सिर हिलाया, और प्रहार करने के लिए तैयार हो गया। उसे ऐसा कोई संकेत नहीं मिला कि यह आदमी भाग जाएगा या उसे ख़तरा भी महसूस हुआ होगा। इससे चंडकौशिक क्रोधित हो गया और उसने महावीर की ओर तीन बार जहरीला जहर उगल दिया। विष ने न तो महावीर पर प्रभाव डाला और न ही उनके ध्यान में खलल डाला। चंदकौशिक इसके लिए तैयार नहीं थे. अब, वह और अधिक चिढ़ गया और उसने महावीर के पैर के अंगूठे को काट लिया। जब उसने दोबारा उस आदमी की ओर देखा तो वह हैरान रह गया कि न केवल उसे कुछ नहीं हुआ था, बल्कि उसके पैर के अंगूठे से खून की जगह दूध बह रहा था।
    
    महावीर ने आंखें खोलीं. वह शांत थे और उनके चेहरे पर कोई डर या गुस्सा नहीं था. उन्होंने चंडकौशिक की आँखों में देखा और उससे कहा, “उठो! चण्डकौशिक जागो!! एहसास करो कि तुम क्या कर रहे हो! उन शब्दों में प्यार और स्नेह था. चण्डकौशिक शांत हो गये और उन्हें लगा जैसे उन्होंने इस तरह का व्यक्ति पहले कभी देखा हो। उसे अचानक अपने पिछले दो जन्म याद आ गये। चंदकौशिक को तब जीवन की सच्चाई का एहसास हुआ, और उसके पिछले दो जन्मों के क्रोध और अहंकार ने उसके साथ क्या किया था। उसने शांति से अपना सिर ज़मीन पर झुका लिया। महावीर अपने रास्ते चले गये।
    
    चंडकौशिक शांतिपूर्वक अपने बिल के अंदर सिर रखकर वापस चला गया, जबकि उसका अधिकांश शरीर बाहर था। कुछ समय बाद जब लोगों को पता चला कि चंडकौशिक अब हानिकारक नहीं है, तो वे उत्सुकतावश इसे देखने आये। उन्होंने उसे चुपचाप पड़ा हुआ देखा। कुछ लोग उस पर दूध डालकर पूजा करने लगे और भोग लगाने लगे। जबकि कुछ अभी भी पागल थे क्योंकि उनके प्रियजनों की इसके कारण मृत्यु हो गई थी। उन्होंने उस पर पत्थर फेंके और लकड़ी के डंडों से उस पर प्रहार किया। रक्त, दूध और भोजन चींटियों को आकर्षित करते थे। चंडकौशिक ने काटना, पीटना बंद कर दिया और बिना किसी क्रोध के शांति से शांत रहे। इस आत्म-संयम और अपनी भावनाओं पर नियंत्रण ने उसके कई बुरे कर्मों को नष्ट कर दिया। इसलिए, अपने जीवन के अंत में, यह स्वर्ग चला गया।`,
  },
  {
    id: "story18",
    name: "Kamal Sen (कमलसेन)",
    imageUrl: "",
    content: `श्रीपत शेठ और सुंदरी ने एक बार श्री शिलंधर आचार्य से मुलाकात की और उन्हें बताया कि यद्यपि वे दोनों दैनिक व्रत जैसे नवकार मंत्र का पाठ करते थे, और नवकारसी, सामायिक आदि करते थे, लेकिन उनके पुत्र कमलसेन इन सभी से दूर रहते थे।

    0s. वह टीवी देखता, फुटबॉल, क्रिकेट, अन्य खेल खेलता या इधर-उधर घूमता या फोन पर बातें करता। कमलसेन के माता-पिता अपने बेटे की अपने धर्म के प्रति समर्पण और आध्यात्मिकता की कमी से दुखी और चिंतित थे। उन्होंने साधु से अनुरोध किया कि वह उनके बेटे को कुछ अच्छी सलाह दें, ताकि उसका जीवन बेहतर हो और वह इस जीवन के साथ-साथ अगले जीवन में भी खुश रह सके। भिक्षु स्वेच्छा से बाध्य हुआ।
    
    घर पहुँचकर व्यापारी ने अपने बेटे से कहा, “अच्छा बेटा, एक महान शिक्षक हमारे शहर में आ रहे हैं। वह बहुत विद्वान व्यक्ति हैं और उनके व्याख्यान सुनने लायक हैं।” अगले दिन वे अपने बेटे को व्याख्यान के लिए ले गये। वे आचार्य को प्रणाम करके सुनने बैठ गये। आचार्य ने नरक, स्वर्ग, दुख, केवलज्ञान आदि सहित कई चीजों के बारे में बात की। प्रवचन के बाद, माता-पिता ने कमलसेन से पूछा कि उन्हें व्याख्यान कैसा लगा। कमलसेन ने उत्तर दिया, "मैं आचार्य के विंड-बॉक्स (स्वर-रज्जु क्षेत्र) की गतिविधियों को देखने में बहुत व्यस्त था।" उसके माता-पिता बहुत निराश हुए और निराश होकर घर लौट आये।
    
    इसके तुरंत बाद, एक और महान संत आचार्य गुणसागरसूरि ने शहर का दौरा किया, और उनके माता-पिता कमलसेन को एक बार फिर से दिखाने ले गए। इस आचार्य ने दर्शकों को नौ स्वादों (रसों) से संबंधित सांसारिक कहानियों के बारे में बताया क्योंकि ऐसी कहानियां सांसारिक लोगों को आकर्षित करती हैं। लड़के को वे कहानियाँ अच्छी लगीं, इसलिए वह प्रतिदिन आचार्य के उपदेशों में जाने लगा और रुचिपूर्वक सुनने लगा। कुछ दिनों के बाद, आचार्य शहर छोड़कर जा रहे थे। कमलसेन भी उन्हें विदा करने में लोगों के साथ शामिल हुए। कई लोगों ने अपने जीवन में कोई न कोई व्रत करने का संकल्प लिया। कमलसेन से पूछा गया कि क्या वह प्रतिज्ञा लेंगे। उन्होंने कहा, ''मैं दिन और रात के अलावा झूठ नहीं बोलूंगा. मैं पूरा तरबूज़ मुँह में नहीं डालूँगा और न ही गाय का मल खाऊँगा।” बालक के हास्यास्पद व्यवहार से आचार्य लज्जित हुए। इसलिए, इसे पूरा करने के लिए, लड़के ने शहर के एक कुम्हार सिमेलो के गंजे सिर को देखे बिना खाना नहीं खाने की कसम खाई। गुरुजी कमलसेन के प्रण लेने से बहुत प्रसन्न हुए, यद्यपि यह बड़ा विचित्र व्रत था।
    
    एक दिन, सिमेलो कुछ मिट्टी लाने के लिए जंगल में गया और कमलसेन दोपहर का खाना खाने ही वाला था कि उसकी माँ ने उसे प्रतिज्ञा के बारे में याद दिलाया। वह तुरंत गंजा कुम्हार को ढूंढने के लिए जंगल की ओर भागा। वहां उसने कुम्हार को जमीन खोदते हुए देखा। खुदाई करते समय कुम्हार को रत्नों और कीमती पत्थरों से भरा एक घड़ा मिला। लड़के के आते ही वह उसे मिट्टी के ढेर के नीचे छुपाने लगा। कमलसेन चिल्लाया, “हाँ! मैंने इसे (कुम्हार का गंजा सिर) देखा है।” कुम्हार ने सोचा कि कमलसेन का मतलब घड़े से है और वह नहीं चाहता था कि रत्नों के बारे में किसी और को पता चले। इसलिए उसने लड़के से कहा कि अगर वह किसी और को नहीं बताएगा तो वह बर्तन का आधा हिस्सा साझा कर लेगा। पहले तो कमलसेन को समझ नहीं आया कि वह किस बारे में बात कर रहा है लेकिन बाद में उसे समझ आ गया और उसने खुशी-खुशी उसका प्रस्ताव स्वीकार कर लिया और घर लौट आया।
    
    कमलसेन ने घर जाकर गहराई से सोचा, “मजाक में ली गई एक साधारण प्रतिज्ञा ने मुझे यह धन दे दिया। अगर मैंने यह प्रतिज्ञा गंभीरता से ली होती तो मैं और भी अमीर होता।”
    
    इस घटना ने कमलसेन का जीवन बदल दिया। तब उसने अनेक व्रत किये और बहुत प्रसन्न हुआ।`,
  },
  {
    id: "story19",
    name: "Monkey and Sugari (बंदर और सुगरी)",
    imageUrl: "",
    content: `सुगारी (दर्जी पक्षी) अपने बहुत अच्छे बुने हुए और कलात्मक घोंसले के लिए जाना जाता है। यह हवा और बारिश से बचाता है. एक बरसात के दिन, एक सुगरी अपने घोंसले में बैठी थी और भारी बारिश हो रही थी और बार-बार बिजली चमक रही थी। ऐसे समय में ठंडी हवा और बारिश से परेशान एक बंदर ने पेड़ के नीचे शरण ली। सुगरी ने व्यंग्यपूर्वक पूछा, "तुम इतने चतुर हो तो तुमने बरसात के दिन रहने के लिए घोंसला क्यों नहीं बनाया?" बंदर को गुस्सा आ गया और उसने सुगरी को चुप रहने को कहा। वह कांपता रहा. सुगारी उसे चिढ़ाने से खुद को नहीं रोक सकी, उसने कहा, "तुमने गर्मियों का समय आलस्य में क्यों बर्बाद किया?"

    यह सुनकर बंदर क्रोधित हो गया और उसने सुगरी को खूब भला-बुरा कहा। बारिश और गड़गड़ाहट तेज हो गई और सुगरी ने एक बार फिर अपना मुंह खोल दिया. बंदर अब इतना पागल हो गया था कि उसने कहा, “चुप रहो, दुष्ट। अगर तुम बड़बड़ाती रहोगी तो मैं तुम्हें बेघर कर दूंगा। पंडित होने का दिखावा मत करो।” सुगरी चुप रही. लेकिन कड़ाके की ठंड के कारण ठंडा बंदर फिर से कांपने लगा और चीनी ने एक बार फिर ज्ञान की बातें कहीं। आख़िरकार बंदर अपने क्रोध पर और अधिक नियंत्रण नहीं रख सका। उन्होंने कहा, "हालाँकि मेरे पास घर बनाने की क्षमता नहीं है, लेकिन मेरे पास एक घर को तोड़ने की क्षमता है।" इतना कहकर वह पेड़ पर चढ़ गया और सुगरी के घोंसले को नष्ट कर दिया, जिससे बेचारी सुगरी भी बेघर हो गई। अब उन दोनों को ठंडी हवा और बारिश की तकलीफ़ होने लगी।
    
    ऐसे मौके बहुत आम हैं. हमें दूसरों के दोष नहीं बताना चाहिए। हमें उनके प्रति उदासीन रहना चाहिए. प्रत्येक व्यक्ति जो करता है उसके लिए उत्तरदायी है। हमें दूसरे लोगों के अच्छे और बुरे अनुभवों से सीखने की कोशिश करनी चाहिए। हमें सबसे पहले स्वयं में सुधार कर अपने दोषों से छुटकारा पाना चाहिए। यह भगवान महावीर के अनेक संदेशों में से एक था।`,
  },
  {
    id: "story20",
    name: "Punia Shravak (पुनिया श्रावक)",
    imageUrl: "",
    content: `पुनिया श्रावक और उनकी पत्नी अपनी पसंद से गरीब ग्रामीण थे, जो मिट्टी और घास से बनी एक छोटी सी झोपड़ी में रहते थे। पुनिया की प्रतिज्ञा थी कि वह हर दिन 12 दोकाड़े (1/12 रुपये) से अधिक नहीं कमाएगा। उन्होंने घर में सूती कातने और उसे बेचने का काम किया। उनका एक और व्रत भी था जिसमें वह एक दिन उपवास करेंगे और उनकी पत्नी अगले दिन उपवास करेंगी। इतनी कठिन परिस्थिति में भी उन्होंने साथी जैन का आतिथ्य सत्कार किया। इस तरह, दम्पति हर दिन साधर्मिक भक्ति (एक ही धर्म के लोगों की मदद करना) करते थे।

    पुनिया श्रावक सामायिक के अभ्यास के लिए जाने जाते थे। एक बार सामायिक के दौरान वे ध्यान में ध्यान केन्द्रित नहीं कर पाये। वह मन ही मन सोचने लगा कि उसने ऐसा क्या किया है जिससे उसके ध्यान में विघ्न पड़ेगा। उसे कोई भी प्रासंगिक बात याद नहीं आ रही थी. इसलिए, उन्होंने अपनी पत्नी से पूछा, "हमने ऐसा क्या अलग किया है कि मैं आज ध्यान केंद्रित नहीं कर पा रहा हूं।" पहले तो उसकी पत्नी सोच ही नहीं पाई कि आज कुछ अलग हुआ है. लेकिन जब वह सोचती रही, तो उसे याद आया कि आज बाजार से लौटते समय उसने सूखी गोबर की खाद उठाई थी और उसे खाना पकाने के लिए ईंधन के रूप में इस्तेमाल किया था। उसने पुनिया को इस बारे में बताया. उसने उससे कहा कि उसे ऐसा नहीं करना चाहिए था, भले ही वह किसी का नहीं था। हमें केवल उन्हीं चीजों का उपयोग करना चाहिए जो हमारी दैनिक कमाई से खरीदी गई हों। पुनिया सच्चा सामायिक इसलिए कर सके क्योंकि उन्होंने इतना उच्च नैतिक जीवन जीया था।
    
    भगवान महावीर ने भी उनकी सामायिक की प्रशंसा की। एक बार जब राजा श्रेणिक ने भगवान महावीर से पूछा कि नरक में जन्म लेने से बचने के लिए वह अपने बुरे कर्मों को कैसे नष्ट कर सकते हैं। भगवान महावीर ने कहा, "पुणिया श्रावक की सामायिक यदि तुम खरीद सको तो यह संभव हो सकता है।" राजा श्रेणिक पुनिया श्रावक के पास गये और उससे पूछा कि क्या वह उसकी सामायिक खरीद सकता है। उन्होंने कहा, ''मैं सामायिक बेचने के लिए नहीं, बल्कि अपनी आत्मा के उत्थान के लिए करता हूं। धार्मिक अनुष्ठान खरीदे नहीं जा सकते. व्यक्ति को अपने लिए ही करना पड़ता है।” राजा श्रेणिक निराशा में लेकिन पुनिया की धर्म में सच्ची आस्था की प्रशंसा के साथ चले गए।
    
    इससे पता चलता है कि व्यक्ति सीमित कमाई के साथ भी संतुष्ट जीवन जी सकता है। हमें ऐसी कोई भी चीज़ नहीं लेनी चाहिए जो हमें नहीं दी गई है। यदि हमने अपनी सीमा निर्धारित कर रखी है तो हमें अधिक धन संचय करना चाहिए क्योंकि इससे शांति भंग होगी। व्रत या अनुष्ठान आध्यात्मिक उत्थान के लिए किए जाते हैं, न कि आर्थिक लाभ के लिए।`,
  },
  {
    id: "story21",
    name: "Shaalibhadra (शालिभद्र)",
    imageUrl: "",
    content: `एक बार की बात है, एक छोटे से गाँव में एक गरीब माँ और उसका बेटा रहते थे। एक दिन, गाँव में एक उत्सव था और गरीब बेटे सहित सभी बच्चे खेलने के लिए इकट्ठे हुए। खेलने के बाद सभी लोग अपने साथ लायी खीर (मीठी खीर और दूध) खाने लगे। इस बेचारे लड़के के पास कुछ भी नहीं था. उसे बुरा लगा और वह वापस अपनी माँ के पास भागा। उसने उससे पूछा कि क्या वह उसके लिए खीर बनाएगी क्योंकि सभी बच्चे इसे खा रहे थे। उसकी माँ ने कहा कि वह खीर नहीं बना सकती और उसने जो कुछ भी पकाया है उसे खाने को कहा। वह रोने लगा और खीर की जिद करने लगा। उसकी माँ उसे रोते हुए नहीं देखना चाहती थी। इसलिए वह पड़ोसी के घर गई और अपने बेटे के लिए खीर बनाने के लिए कुछ दूध, चीनी और चावल उधार लिया। उसने खीर को एक बर्तन में डाला और कुएँ से पानी लेने चली गई। जैसे ही लड़का खाना शुरू करने वाला था, उसने शब्द सुने, "धर्म लाभ," (जिसका अर्थ है, आपको आध्यात्मिकता का आशीर्वाद मिलेगा, जो आमतौर पर एक जैन साधु द्वारा कहा जाता है)। उसने दरवाजे पर भिक्षा के लिए एक साधु को देखा। भूखे लड़के ने बिना किसी हिचकिचाहट के साधु को अंदर बुलाया और उसे खीर दी। खीर डालते समय सारी खीर साधु के बर्तन में चली गई। वह खुश था कि वह भिक्षु को यह दे सका, भले ही उसके पास खाने के लिए कुछ भी नहीं बचा था। उनके अच्छे इरादे से उन्हें अच्छे कर्म मिले और अगले जन्म में उन्होंने प्रसिद्ध शालिभद्र के रूप में जन्म लिया।

    शालिभद्र की माता भद्रा शेठानी थीं और उनके पिता गोभद्र शेठ थे। जब लड़का छोटा था तब उसके पिता ने घर छोड़ दिया था और साधु बन गये थे। शालिभद्र जन्मजात करोड़पति थे। उनका जीवन स्वर्ग में होने जैसा था। ऐसा कहा जाता था कि स्वर्गीय देवदूत भी उसकी विलासितापूर्ण जीवनशैली से ईर्ष्या करते थे। उनकी 32 खूबसूरत पत्नियाँ थीं। उनकी मां ने उन्हें इस डर से कभी अपने महल से बाहर नहीं जाने दिया कि कहीं वह अपने पिता की तरह भिक्षु न बन जाएं।
    
    एक दिन, नेपाल से कुछ व्यापारी कुछ बहुत महंगी साड़ियाँ बेचने आये। वे राजा श्रेणिक के दरबार में गए जहां राजा ने उनसे कहा कि वह इतनी महंगी साड़ियों के लिए अपने नागरिकों के पैसे का उपयोग नहीं कर सकते। वे निराशा के साथ वापस जा रहे थे क्योंकि उन्हें इस शहर से बहुत उम्मीदें थीं। जब भद्रा शेठानी को इस बात का पता चला तो उसने उन व्यापारियों को बुलाया। व्यापारी जाने से कतरा रहे थे क्योंकि जब राजा नहीं खरीद सकता तो कोई निवासी इतनी महँगी चीज़ कैसे खरीद सकता था। लेकिन फिर भी वे वहां गए. भद्रा शेठानी ने पूछा, "तुम्हारे पास क्या है?" उन्होंने कहा कि उनके पास सोलह साड़ियाँ हैं। उसने कहा, “केवल सोलह? मुझे बत्तीस साड़ियाँ चाहिए क्योंकि मेरी बत्तीस बहुएँ हैं।” व्यापारियों ने सोचा कि वह मजाक कर रही है और एक भी नहीं खरीदेगी। उसने कहा, “आप किसका इंतज़ार कर रहे हैं। ये साड़ियाँ निकालो।” उन्होंने वो सोलह साड़ियाँ निकालीं। व्यापारियों को आश्चर्य हुआ कि उसने बिना कुछ सोचे-समझे सभी सोलह साड़ियाँ खरीद लीं। वे यह देखकर और भी चकित हो गए कि वह उनके सामने इतनी कीमती साड़ियों को दो टुकड़ों में फाड़ रही थी और अपनी प्रत्येक बहु को अपने पैर पोंछने के लिए एक टुकड़ा दे रही थी। व्यापारी स्तब्ध रह गए लेकिन खुशी के साथ चले गए। बहुओं ने इन टुकड़ों को एक बार इस्तेमाल करके फेंक दिया।
    
    एक नौकर को रानी पसंद थी इसलिए उसने एक टुकड़ा रानी के लिए ले लिया। रानी चकित थी लेकिन खुश थी कि उसके राज्य में इतने अमीर लोग रहते थे। उसने यह बात राजा श्रेणिक को बतायी। उसे ऐसे अमीर लोगों पर भी बहुत गर्व महसूस हुआ जो उसके राज्य का अच्छा नाम कायम रखते हैं। उन्होंने शालिभद्र को सम्मान देने के लिए अपने दरबार में आमंत्रित किया। जब भद्रा शेठानी को पता चला, तो वह राजा के पास गई और उसे बताया कि उसका बेटा बहुत शर्मीला है और उसने राजा को शालिभद्र के सम्मान के लिए अपने महल में आने के लिए आमंत्रित किया। राजा श्रेणिक ने निमंत्रण स्वीकार कर लिया और शालिभद्र के महल में गये। जब राजा श्रेणिक वहां पहुंचे तो उन्हें एहसास हुआ कि उनका महल शालिभद्र के महल की तुलना में कुछ भी नहीं है। भद्रा शेठानी ने उन्हें बैठने की जगह दी और शालिभद्र को राजा से मिलने के लिए नीचे आने को कहा। शालिभद्र को राजा या राज्य के बारे में कुछ भी नहीं पता था और उन्हें लगा कि कोई ऐसा माल है जो उनकी मां उन्हें दिखाना चाहती हैं। तो उन्होंने कहा, "मैं उसे देखना नहीं चाहता लेकिन आगे बढ़ो और खरीद लो।" उसकी माँ ने कहा, “यह माल नहीं है। वह हमारा राजा है, हमारा स्वामी है, और आपको उसका स्वागत करने और उसका सम्मान करने के लिए नीचे आना होगा। "मालिक" शब्द उसके कानों में गूंजने लगा। उसने सोचा, “मुझे अपने ऊपर स्वामी क्यों रखना चाहिए। मुझे स्वयं का स्वामी बनना चाहिए।” ऐसा सोचते-सोचते वह नीचे आया और राजा को प्रणाम किया, परन्तु अधिक देर तक न टिक सका और वापस चला गया।
    
    वह सोचता रहा कि वह आज़ाद नहीं है क्योंकि उसके ऊपर कोई है। वह अपने पिता (जो भिक्षु बन गये थे) और जीवन के वास्तविक अर्थ के बारे में सोचने लगा। उन्होंने उसी क्षण भिक्षु बनने का निर्णय लिया और अपने परिवार को निर्णय के बारे में बताया। उनकी मां और पत्नियों ने उन्हें समझाने की कोशिश की कि वह उनके साथ कुछ और समय बिताएं और शायद बाद में इस बारे में सोचें। लेकिन वह नहीं माने. आख़िरकार वह इस बात पर सहमत हुआ कि सभी बत्तीस पत्नियों को एक साथ छोड़ने के बजाय, वह एक समय में एक पत्नी को छोड़ देगा, और फिर वह निश्चित रूप से भिक्षु बन जाएगा। उसने उसी दिन ऐसा करना शुरू कर दिया।

कुछ दिन बीत गये. एक दिन उनकी बहन सुभद्रा अपने पति धन्ना को स्नान करा रही थी कि अचानक उसकी आँखों से आँसू बहकर उसके ऊपर गिर पड़े। उसने ऊपर देखा, और अपनी प्यारी पत्नी को रोते हुए देखा। उसने उससे पूछा कि क्या हुआ था। उसने उसे बताया कि उसके भाई ने भिक्षु बनने का फैसला किया है और वह हर दिन एक पत्नी छोड़ रहा है। धन्ना ने हँसते हुए सुभद्रा से कहा, “उसका भाई कायर था। यदि वह अपनी पत्नियों को छोड़ना चाहता था, तो प्रतीक्षा क्यों करें?” यह सुनकर सुभद्रा परेशान हो गईं और उन्होंने अपने पति से कहा, "कहना जितना आसान है, करना उतना आसान नहीं है।" इससे धन्ना के मन में जागरूकता पैदा हुई और उसने उससे कहा, "मैं तुम सभी आठों को अभी छोड़ रहा हूं, और मैं साधु बनने के लिए अभी जा रहा हूं।" सुभद्रा आश्चर्यचकित रह गईं। उसने उससे कहा कि वह मजाक कर रहा होगा। लेकिन धन्ना ने कहा, ''अब बहुत देर हो गई है. मैं साधु बनने के लिए कृतसंकल्प हूं. यदि आप सभी मुझसे जुड़ना चाहते हैं तो आपका स्वागत है।” धन्ना को दृढ़ निश्चयी देखकर सुभद्रा और उसकी बाकी सात पत्नियों ने भी भिक्षुणी बनने का निर्णय लिया।

अब धन्ना अपने बहनोई शालिभद्र के पास आया और उसे ललकारा, “अरे कायर! यदि आप वास्तव में परिवार छोड़कर साधु बनना चाहते हैं, तो आप किसका इंतजार कर रहे हैं? मुझे जुड़ें।"

शालिभद्र ने चुनौती सुनी और स्वीकार कर ली। उन्होंने अपनी पत्नियों से कहा, "माफ करें, लेकिन मैं आज आप सभी को छोड़कर जा रहा हूं।" वह अपने जीजा से मिलने नीचे गया। उनकी पत्नियाँ भी उनके साथ हो लीं। वे सभी भगवान महावीर के पास गये और दीक्षा ले ली।

ऐसे विलासितापूर्ण जीवन का कैसा अविश्वसनीय अंत! भिक्षु के रूप में तपस्या करने के बाद उनका जन्म स्वार्थसिद्ध विमान में देवदूत के रूप में हुआ। वहां से, वह महाविदेहक्षेत्र में पैदा होंगे और अंततः मुक्ति, मोक्ष प्राप्त करेंगे।`,
  },
  {
    id: "story22",
    name: "From Robbery to KevalGnan (चोरी से लेकर केवल ज्ञान तक)",
    imageUrl: "",
    content: `In a town, there lived a gentleman with his lovely wife. Many nights he would not feel sleepy. He used that time to perform Samayik (sitting calmly in meditation or reading spiritual books, etc.). One night four robbers came to his town. While deciding where to rob they came near his house. They felt that his house was quiet and decided to rob here. The robbers entered his house. Actually at that time the owner was sitting in Samayik. He heard some noise and he realized that robbers are in the house. He did not scream but told to himself, “No one can take what is mine, I have right faith, right knowledge, and right conduct. Therefore, I should not be upset at the robbers and I must not disturb my samayik.”

    He further thought, “I am in samayik and no worldly thing should bother me. What did I bring with me when I was born ? And what would go with me when I die ? I came alone and I will leave this world empty-handed. Let there be trust in the path shown by Jina. It will give me the strength to complete this samayik in a peaceful frame of mind.” Meanwhile, one of the robber threw a bundle of goods out of the window. The gentleman uttered, “Namo Arihantanam.” When the robbers heard that, they were startled that instead screaming they heard “Namo Arihantanam”. “Namo Arihantanam” also reminded them as if they have heard before. They started reflecting on these words and within a few minutes they attained Jati-smaran-jnan (knowledge of previous life). They discovered that they were also Jains like him and performed samayik but not like him. They praised his detachment for worldly things and repented on their current activities. They reflected on the purity of Samayik very sincerely and they burned up their four ghati (major) karmas and all four attained Kevaljnan.
    
    When the gentleman finished his Samayik he saw the four Kevalis seated on golden lotuses. He bow down to them with admiration.
    
    If we repent our mistakes and sins we can also get into a pure mental condition. Religious rituals are worthwhile, but if we do not observe them properly with pure heart and mind then they are meaningless. One, who repents his sins and decides not to repeat them would be born either in heaven or may even be liberated in same life.`,
  },
  {
    id: "story23",
    name: "Vipul and Vijan (विपुल और विजान)",
    imageUrl: "",
    content: `प्रतिष्ठान के जंगलों में एक साधु रहता था जो भविष्य में होने वाली घटनाओं की भविष्यवाणी करने के लिए प्रसिद्ध था। गाँव के लोग उसके चारों ओर इकट्ठे हो गए, हालाँकि साधु को हमेशा उनकी जिज्ञासा शांत करना पसंद नहीं था। साधु जंगल में तब तक अंदर जाता रहा जब तक लोगों ने उसकी तलाश बंद नहीं कर दी। एक बार दो मित्र विपुल और विजन प्रतिष्ठान जाते समय जंगल में भटक गये। उन्हें अंधेरे में अपनी जान का डर था और वे आश्रय की तलाश में थे। देर रात, उन्होंने दूर से प्रकाश की एक किरण देखी और वे डर और बेचैनी के साथ उसके पास पहुंचे। उन्होंने कुटिया में झाँककर देखा तो एक साधु गहरे ध्यान में लीन था। उन्होंने आसानी से अनुमान लगा लिया कि वह वही साधु है जो अपनी भविष्यवाणियों के लिए जाना जाता है। वे तब तक प्रतीक्षा करते रहे जब तक साधु का ध्यान समाप्त नहीं हो गया। उन्होंने उसे जंगल में खो जाने की अपनी कहानी सुनाई।

    साधु ने उनकी कहानी सुनी और उन्हें फल दिये। दयालु साधु ने उन्हें आराम करने और सोने के लिए कहा। अगले दिन सुबह साधु ने अपने एक शिष्य से जंगल से गांव तक का रास्ता दिखाने का अनुरोध किया। लेकिन विपुल और विजन के जाने से पहले, उन्होंने साधु के सामने हाथ जोड़े और उनसे अपना भविष्य बताने को कहा। साधु ने विनम्रतापूर्वक यह कहते हुए मना कर दिया कि उनका भविष्य जानना बुद्धिमानी नहीं है और कभी-कभी तो भविष्य भी बदल सकता है। दोनों दोस्त नहीं हटे और आख़िरकार साधु ने उन्हें उनका भविष्य बता दिया। उसने विपुल की ओर देखा और उससे कहा कि वह एक वर्ष में राजा बन जाएगा, जबकि विजन उसी समय एक हत्यारे के हाथों मर जाएगा।
    
    जंगल के बाहर, विपुल अपनी खुशी को रोक नहीं सका, जबकि विजान बहुत उदास था। यह स्वाभाविक ही था. नगर में विपुल ने अहंकारपूर्ण व्यवहार करते हुए सभी से कहा कि यदि उन्होंने उसके प्रति दुर्व्यवहार किया तो वह राजा बनने पर उनका सिर काट देगा। गाँव के सभी लोग उससे डरते थे। इस बीच, विजन, एक शिक्षक, बड़ी भक्ति के साथ अपना काम करता था और अपना अधिकांश समय प्रार्थनाओं में बिताता था। वह सभी के प्रति विनम्र थे और अंततः अपने दुःख से बाहर आये। अब उसे मृत्यु का भय नहीं रहा, बल्कि उसने स्वयं को ईश्वर को समर्पित कर दिया।
    
    छह महीने बाद, विपुल ने अपने भविष्य के महल के लिए जगह का चयन करने के लिए विजान को अपने साथ चलने के लिए कहा। दोनों एक निर्जन क्षेत्र का सर्वेक्षण कर रहे थे तभी विपुल की नजर सोने के सिक्कों से भरे एक बर्तन पर पड़ी। वह खुश हुआ और विजान से कहा कि वह इस पैसे का उपयोग एक मुकुट खरीदने के लिए करने जा रहा है। तभी एक लुटेरे ने झाड़ी से छलांग लगायी और बर्तन छीनने की कोशिश की. विजन अपने दोस्त को बचाने आया तो लुटेरे ने उस पर खंजर से हमला कर दिया। विजान रक्षा रणनीति में अनुभवी थे और उन्होंने लुटेरे को गोली मार दी, हालांकि उनके कंधे पर चोट लग गई। कृतज्ञ विपुल ने अपने मित्र को आधा सोना देने की पेशकश की, लेकिन विजन ने विनम्रतापूर्वक यह कहते हुए इनकार कर दिया कि वह जल्द ही मरने वाला है और सोने का कोई उपयोग नहीं होगा। विपुल ने पैसा मनमाने ढंग से, खाने-पीने और मौज-मस्ती में कई तरह से खर्च किया। पूरा एक वर्ष बीत गया परंतु न तो विपुल राजा बना और न ही विजन की मृत्यु हुई।
    
    दोनों मित्र स्पष्टीकरण की तलाश में साधु के पास गए। साधु ध्यान में बैठ गया। उन्होंने विपुल से कहा, “तुम्हारे महीनों के मूर्खतापूर्ण कार्यों के कारण तुम्हारी किस्मत बदल गई। जो मुकुट आपके पास आना था वह सोने का एक साधारण घड़ा बनकर रह गया जो आपको खेत में मिला था।” उन्होंने विजान से कहा, ''आपकी प्रार्थनाओं, विनम्रता और ईश्वर पर विश्वास ने आपकी किस्मत भी बदल दी। हत्यारे के हाथों हुई मृत्यु को उसके द्वारा मात्र एक घाव में बदल दिया गया।” दोनों दोस्त कार्यों, परिणामों और जीवन के अर्थ के बारे में सोचते हुए चुपचाप लौट आए।`,
  },
  {
    id: "story24",
    name: "VajraKumar (वज्रकुमार)",
    imageUrl: "",
    content: `तुम्बीवन नगर में धनगिरि नामक एक धनी ब्राह्मण रहता था। उनकी सुनंदा नाम की एक खूबसूरत पत्नी थी। उनका जीवन आनंद से भरा था। कुछ समय बाद जब सुनंदा गर्भवती हुई तो एक रात उसने एक सुंदर स्वप्न देखा। उसने यह बात अपने पति को बताई जो कि एक विद्वान था। उसने अपनी पत्नी से कहा कि वह एक उज्ज्वल और सुंदर बच्चे को जन्म देगी। वह बहुत खुश महसूस कर रही थी और समय बहुत अच्छा बीत रहा था।

    एक दिन एक जैन आचार्य सिंहगिरि नगर में आये। धनगिरि और सुनंदा दोनों नियमित रूप से उनके उपदेश सुनने जाते थे। इन उपदेशों से धनगिरि की आत्मा जागृत हो गई और उनकी अपने धन, परिवार और सांसारिक मामलों में रुचि खत्म हो गई। उन्होंने अपना सांसारिक जीवन त्यागने का निर्णय लिया। उन्होंने अपने फैसले के बारे में अपनी पत्नी को बताया. वह आचंभित थी। उसने उसे रुकने और अपने जीवन का आनंद लेने के लिए मनाने की कोशिश की। उसने यह भी कहा कि चूंकि उनका एक बच्चा होने वाला है इसलिए साथ रहना ही बेहतर होगा। लेकिन धनगिरि ने अपना मन नहीं बदला. सुनंदा एक धार्मिक व्यापारी धनपाल की बेटी थी और वह धार्मिक समझ रखती थी। इसलिए, उसने उसे आगे जाने की अनुमति दे दी। उसे सांत्वना दी गई कि, कम से कम, वह एक नेक आदमी की पत्नी थी।
    
    समय बीतने पर सुनंदा ने एक अत्यंत सुन्दर बालक को जन्म दिया। वह प्यारा था क्योंकि उसके चेहरे पर हर समय मुस्कान रहती थी। जिसने भी उन्हें देखा उन्हें पहली नजर में ही पसंद आ गए। सुनंदा ने अपना पहला जन्मदिन मनाया. उसे अच्छा लग रहा था कि कम से कम उसे कोई साथ मिला लेकिन ये ख़ुशी ज़्यादा देर तक नहीं टिकी। एक दिन, पड़ोस की कुछ महिलाएँ उससे मिलने आईं और उसके पति के बारे में बात करने लगीं। उनमें से एक ने कहा, "अगर धनगिरी ने दीक्षा (संन्यासी बनने की प्रक्रिया) नहीं ली होती तो वह जन्मदिन उनसे भी अधिक धूमधाम से मनाता।" बच्चे ने, यद्यपि वह बच्चा था, "दीक्षा" शब्द सुना और सोचने लगा। उसे ऐसा लगा मानो उसने दीक्षा शब्द पहले भी सुना हो। यह सोचते-सोचते अचानक उसे अपना पिछला जीवन याद आ गया। उन्हें एहसास हुआ कि वह सही आध्यात्मिक पथ पर हैं। उन्होंने निर्णय लिया कि उन्हें मनुष्य के रूप में जन्म लेने का लाभ उठाना चाहिए और इस जीवन का उपयोग अपनी आत्मा को और अधिक उन्नत करने के लिए करना चाहिए। उन्हें अपने पिता की तरह साधु बनना चाहिए. उसे यह भी एहसास हुआ कि उसकी माँ उसे जाने नहीं देगी, क्योंकि वह उसके लिए एकमात्र आशा और खुशी थी। इसलिए वह सोचने लगा कि उसकी अनुमति पाने के लिए क्या करना चाहिए।
    
    आख़िरकार, वह इस निर्णय पर पहुंचा कि चूँकि उसकी माँ उसे स्वेच्छा से जाने नहीं देगी, इसलिए उसे ऐसी स्थिति बनानी चाहिए जिससे वह उससे थक जाए और उसे छोड़ दे। वह अभी भी पालने में एक छोटा लड़का था जब उसने सोचा, "अगर मैं हर समय रोता रहूंगा तो वह मुझसे थक जाएगी, और शायद वह मुझसे छुटकारा पाने की कोशिश करेगी।" उन्होंने अपने विचार को तुरंत कार्यान्वित किया। उनकी आँखो से अश्रुधारा प्रवाहित होने लगी। उसकी माँ उसे सांत्वना देने के लिए दौड़ती हुई आई लेकिन वह रोता रहा। उसने सब कुछ करने की कोशिश की लेकिन किसी ने भी उसे शांत करने में मदद नहीं की। वह उसे डॉक्टरों के पास ले गई और दूसरों से सलाह ली लेकिन कोई फायदा नहीं हुआ। बच्चे की तरकीब काम कर गई. यहां तक कि उनके पड़ोसी भी, जो इस बच्चे को इतना पसंद करते थे, वे भी उससे तंग आ गए। आख़िरकार उसकी माँ उससे इतनी तंग आ गई कि वह सोचने लगी कि उससे कैसे छुटकारा पाया जाए।
    
    बच्चा अब छह महीने का था, जब धनगिरि मुनि (बच्चे के पिता) और आचार्य सिंहगिरि फिर से इस शहर में आए। यह बात सुनंदा को पता चली तो उन्होंने इस बच्चे को उसके पिता को देने के बारे में सोचा।
    
    भिक्षा के लिए सामान्य समय पर (भोजन इकट्ठा करने के लिए जाते हुए) धनगिरि मुनि ने आचार्य से भिक्षा के लिए जाने की अनुमति मांगी। आचार्य सिंहगिरि ने उनसे कहा, “धनगिरिजी, आज आप एक जीवित वस्तु भी स्वीकार कर सकते हैं, यदि वह पेशकश की जाए।” आचार्य बहुत ज्ञानी थे और वे जानते थे कि मुनि धनगिरि को क्या भिक्षा मिलने वाली है। इसलिए उन्होंने समय से पहले ही इसकी इजाजत दे दी. हालाँकि मुनि धनगिरि को समझ नहीं आया कि उनके शिक्षक का क्या मतलब है, वे भिक्षा के लिए निकल पड़े। अलग-अलग घरों का रास्ता तय करते हुए वह सुनंदा के घर पहुंचे। उन्होंने कहा, "धर्म लाभ" (आप धर्म प्राप्त कर सकते हैं)। सुनंदा ने इस आवाज को पहचान लिया. उन्होंने मुनि धनगिरि का स्वागत किया और उन्हें दोबारा देखकर प्रसन्नता व्यक्त की। उसने उसे भोजन के लिए घर में आने का निमंत्रण दिया।
    
    इस बीच, युवा लड़के ने मुनि धनगिरि के शब्द धर्म लाभ भी सुने। इसलिए उसने सोचा कि यह उसकी चाल का सबसे अच्छा मौका है। तो वह रोने लगा. इससे उनकी मां चिढ़ गईं और उन्होंने भिक्षु से कहा, “आप भाग्यशाली हैं कि आप अपनी आत्मा का उत्थान करने में सक्षम हैं, लेकिन मैं आपके बच्चे के बोझ से थक गई हूं। वह रोने के अलावा कुछ नहीं करता. वह मुझे आराम भी नहीं करने देता और मैं बहुत दुखी हूं.' कृपया, उसे स्वीकार करें ताकि घर में शांति रहे। ये बातें बालक ने सुनीं और मन ही मन बहुत प्रसन्न हुआ। उन्हें आशा थी कि मुनि उनके प्रस्ताव को स्वीकार कर लेंगे। मुनि धनगिरि को भिक्षाटन के लिए निकलने से ठीक पहले कहे गए अपने गुरु के शब्द याद आ गए। अब उसे समझ आया कि उसके शिक्षक का मतलब क्या था। उन्होंने बताया,
    
    “सुनंदा, अगर तुम सच में इस बच्चे को देना चाहती हो तो मैं इसे स्वीकार कर लूंगा लेकिन दो बार सोच लेना। एक बार जब आप उसे दे देंगे तो आप उसे वापस नहीं पा सकेंगे। उसके बाद इस बच्चे पर आपका कोई अधिकार नहीं रहेगा।” यह सुनकर बच्चा और भी जोर-जोर से रोने लगा। उन्होंने कहा, ''मैं अब ये रोना-धोना नहीं सुनना चाहती. मैं उससे इतना परेशान और थक चुका हूं कि मैं उसे अपने आसपास बिल्कुल भी नहीं चाहता। काश मैं अपने भावी जीवन में भी उसे न देख पाता। आप उसे हमेशा के लिए ले जा सकते हैं।

उसने बच्चे को उठाया और मुनि के पॉट होल्डर बैग में रख दिया। जैसे ही बालक मुनि को दिया गया, उन्होंने रोना बंद कर दिया और मुस्कुराने लगे। सुनंदा इस बात से हैरान हो गईं और लड़के को देखती रहीं। लेकिन वह उसे छोड़ देने पर अड़ी हुई थी। मुनि बच्चे को लेकर उपाश्रय (वह स्थान जहाँ भिक्षु थोड़े समय के लिए रुकते हैं) जाने के लिए निकल पड़े। आचार्य सिंहगिरि ने देखा कि मुनि धनगिरि कोई भारी वस्तु ले जा रहे हैं। तो उसने उससे पूछा, "तुम्हारे भीख में इतना भारी क्या है?", जैसे कि उसे पता ही न हो कि क्या हो रहा है। जब मुनि ने अपना बेग खोला, तो उनके शिक्षक ने सुंदर मुस्कुराते हुए लड़के को देखा। चूंकि वह बहुत भारी था, इसलिए आचार्य ने उसका नाम "वज्रकुमार" रखा।

आचार्य सिंहगिरि ने वज्रकुमार को एक प्रमुख जैन श्रावक (गृहस्थ) को दे दिया, और उससे कहा कि वह बच्चे को धार्मिक शिक्षा दे क्योंकि भविष्य में उसका एक महान आचार्य बनना तय है। श्रावक ने बच्चा अपनी पत्नी को दे दिया और उसे बताया कि आचार्य सिंहगिरि उनसे क्या चाहते थे। वह बहुत धार्मिक थी और आचार्य की इच्छाओं से सहमत थी। वह उस लड़के से इतना प्यार करती थी कि उसे अपने बिना कहीं भी नहीं जाने देती थी। वह हमेशा उसे साध्वियों के दर्शन के लिए उपाश्रय में ले जाती थी। जब वह छोटा था, तब भी ननें जो कुछ भी सीख रही थीं, उसे वह समझता और याद रखता था। जब वे तीन वर्ष के हुए, तब तक उन्होंने ग्यारह अंग (जैन शास्त्र) तक सीख लिये। वह सबका आदर करता था और बहुत समझदारी से बात करता था।

एक दिन, सुनंदा की एक सहेली उसके घर आई और बोली, “क्या तुम्हें पता है कि तुम्हारा रोता हुआ बेटा अधिकांश समय हमारे उपाश्रय में बिताता है?” मैंने उसे कभी रोते हुए नहीं सुना. वह बहुत आकर्षक और प्यारा बच्चा है।” सुनंदा ने उसकी बातों को हल्के में लेने की कोशिश की लेकिन आख़िरकार वह एक माँ थी। अपने बेटे को देखने की उसकी इच्छा तीव्र हो गई। वह सोचने लगी, “मैं ऐसा कैसे कर सकती हूँ? मैं अपने बहुमूल्य बच्चे को एक मुनि को कैसे दे सकता हूँ? आख़िर वह मेरा बच्चा है. मुझे उसे वापस लाना चाहिए।”

कुछ दिनों बाद आचार्य सिंहगिरि और मुनि धनगिरि पुनः उस नगर में आये। वह उपाश्रय में चली गयी. वह मुनि धनगिरि के पास पहुंची और उनसे कहा, “कृपया, मुझे मेरा बेटा वापस दे दीजिए। मैं अब उसके बिना नहीं रह सकता।” मुनि धनगिरि ने कहा, “मैंने उस समय आपसे कहा था, एक बार जब आप उसे दे देंगे तो वह आपको वापस नहीं मिलेगा। याद रखें, आपने कहा था कि आप उसे न तब चाहते थे और न ही किसी अन्य जीवन में। हम जो लेते हैं उसे वापस नहीं दे सकते।”

सुनंदा ने कहा, ''मुझे नहीं पता कि मैंने ऐसा क्यों किया. मैं अपने बेटे के बिना नहीं रह सकती. कृपया मुझे मेरा बेटा वापस देने का कोई रास्ता खोजें।''

आचार्य सिंहगिरि और मुनि धनगिरि ने उसे उसे भूल जाने के लिए मनाने की कोशिश की, लेकिन वह उसे वापस पाने के लिए दृढ़ थी।

आख़िरकार, उसने राजा के पास जाने का फैसला किया और अनुरोध किया, “कृपया, मुझे मेरा बेटा वापस दिला दीजिये। मेरे पति साधु हो गए हैं और मैं अकेली हूं. वह मेरा एकमात्र बच्चा है। कृपया, उनसे उसे मुझे वापस लौटाने के लिए कहें।

राजा ने सुनन्दा से सारी कहानी सुनी। उन्होंने कहा, "मुझे पता लगाने दीजिए कि क्या हुआ, और मैं आपको जल्द ही बताऊंगा।" उन्होंने स्थिति के बारे में पूछताछ की, और पता चला कि क्योंकि सुनंदा उसके रोने से थक गई थी, इसलिए उसने स्वेच्छा से अपना बच्चा दे दिया था।

राजा ने सुनन्दा को बुलाया और उससे कहा, “सुनन्दा, जब मुनि धनगिरि तुम्हारे घर भिक्षा के लिये आये तो तुमने उनके रोने से तंग आकर स्वेच्छा से अपना बच्चा दे दिया था। एक बार जब आप कुछ दे देते हैं, तो आप उसे वापस नहीं पा सकते।”

सुनंदा ने कहा, ''हे राजा, यह कोई बात नहीं है, यह तो मेरा अपना फ्लैश है और वही मेरे लिए एकमात्र आशा है।'' कृपया, उसे वापस लाने के लिए कुछ करें। मैं उसके बिना नहीं रह सकता।"

राजा को उसकी आवाज़ में मातृ-स्नेह और ईमानदारी महसूस हो रही थी। वह भी हैरान था. आख़िरकार, उन्होंने सुनंदा से कहा, “मैं तुम्हें और मुनि धनगिरि को राजदरबार में बुलाऊंगा, और वज्रकुमार को फैसला करने दूंगा कि किसके साथ जाना है। क्या यह आपके साथ ठीक है?”

सुनंदा ने कहा, "हां, महाराज।"

अगले दिन, राजा का दरबार यह देखने के लिए लोगों से खचाखच भरा हुआ था कि बच्चे का क्या होगा। वज्रकुमार को आकर्षित करने के लिए सुनंदा खिलौने, मिठाइयाँ, कपड़े और अन्य नवीनता वाली वस्तुएँ लेकर आई। राजा और उसके सभी मंत्री आये। मुनि धनगिरि अन्य भिक्षुओं के साथ आये। दरबार में राजा सहित सभी लोगों ने भिक्षुओं को श्रद्धांजलि दी। वज्रकुमार भी आये।

राजा ने वज्रकुमार से कहा, “वज्रकुमार, यद्यपि तुम बहुत छोटे हो, परंतु तुम बहुत बुद्धिमान बालक हो।” उसने अपनी माँ की ओर इशारा करते हुए कहा, “वह तुम्हारी माँ है। वह बहुत स्नेही और प्यार करने वाली है. उसके पास ढेर सारे खिलौने, मिठाइयाँ और अच्छे कपड़े हैं। वह तुम्हें वापस चाहती है।” “दूसरी तरफ,” भिक्षु धनगिरि की ओर इशारा करते हुए उसने आगे कहा, “वहां वह भिक्षु है जिसने सांसारिक जीवन त्याग दिया है। वह संयम से परिपूर्ण है और त्याग का जीवन जीता है। वह बहुत गुणी और पूजनीय व्यक्ति हैं।' वह आपको आध्यात्मिक जीवन सिखाने के लिए भी अपने साथ रखना चाहता है। अब, आप तय करें कि आप किस रास्ते पर जाना चाहते हैं। क्या तुम अपनी माँ के साथ जाना चाहते हो या साधु के साथ?”

एकदम सन्नाटा छा गया। सभी लोग यह देखने के लिए उत्सुक थे कि वज्रकुमार क्या निर्णय लेते हैं। वज्रकुमार भी आज गंभीर थे। वह उठा और चलते-चलते कभी अपनी माँ की ओर देखता, कभी मुनि धनगिरि की ओर देखता। सुनंदा चिल्लाने लगी, “बेटा, इधर आओ. देखो, मैं तुम्हारे लिए खिलौने, मिठाइयाँ और नये कपड़े लाया हूँ। आओ, मेरे पास आओ।”

उधर मुनि धनगिरि के पास ओघो के अलावा कुछ भी नहीं था। उन्होंने वह वज्रकुमार को दिखाया।

वज्रकुमार ने ओघो उठाया और उसके साथ नृत्य करने लगे। वह फिर मुस्कुराने लगा. फिर, उन्होंने मुनि धनगिरि के साथ बैठने का फैसला किया, और प्रसन्न चेहरे से सभी को देख रहे थे।

राजा और सुनंदा सहित दरबार में हर कोई आश्चर्यचकित था कि युवा लड़के ने विलासितापूर्ण सांसारिक जीवन के बजाय भिक्षुणी बनने का फैसला किया। सुनंदा ने वज्रकुमार का निर्णय स्वीकार कर लिया। उन्होंने उनकी सफलता की कामना की। सुनंदा ने वज्रकुमार की दीक्षा का जश्न हर्ष और उल्लास के साथ मनाया। आगे चलकर वज्रकुमार एक महान आचार्य बने।`,
  },
  {
    id: "story25",
    name: "Elephant and the blind men (हाथी और अंधे आदमी)",
    imageUrl: "",
    content: `एक समय की बात है, एक गाँव में छह अंधे आदमी रहते थे। एक दिन गाँव वालों ने उनसे कहा, “अरे, आज गाँव में एक हाथी है।”

    उन्हें पता ही नहीं था कि हाथी क्या होता है. उन्होंने फैसला किया, "भले ही हम इसे देख नहीं पाएंगे, फिर भी हम जाकर इसे महसूस करेंगे।" वे सभी वहां गए जहां हाथी था। उनमें से सभी ने हाथी को छुआ।
    
    "अरे, हाथी एक खंभा है," पहले आदमी ने कहा जिसने उसका पैर छुआ था।
    
    "अरे नहीं! यह एक रस्सी की तरह है,” पूंछ को छूने वाले दूसरे व्यक्ति ने कहा।
    
    "अरे नहीं! यह एक पेड़ की मोटी शाखा की तरह है, ”तीसरे आदमी ने कहा जिसने हाथी की सूंड को छुआ था।
    
    “यह एक बड़े हाथ के पंखे की तरह है” चौथे आदमी ने कहा जिसने हाथी के कान को छुआ था।
    
    “यह एक विशाल दीवार की तरह है,” पांचवें आदमी ने कहा जिसने हाथी के पेट को छुआ था।
    
    “यह एक ठोस पाइप की तरह है,” छठे आदमी ने कहा जिसने हाथी के दाँत को छुआ था।
    
    वे हाथी के बारे में बहस करने लगे और उनमें से सभी ने जोर देकर कहा कि वह सही था। ऐसा लग रहा था मानो वे उत्तेजित हो रहे हों. एक बुद्धिमान व्यक्ति वहां से गुजर रहा था और उसने यह देखा। उसने रुककर उनसे पूछा, “क्या बात है?” उन्होंने कहा, ''हम इस बात पर सहमत नहीं हो सकते कि हाथी कैसा होता है.'' उनमें से प्रत्येक ने बताया कि वह हाथी को कैसा समझता है। बुद्धिमान व्यक्ति ने शांति से उन्हें समझाया, “आप सभी सही हैं। आपमें से हर कोई इसे अलग-अलग कारण बता रहा है क्योंकि आपमें से हर किसी ने हाथी के अलग-अलग हिस्से को छुआ है। तो, वास्तव में हाथी में वे सभी विशेषताएं हैं जो आप सभी ने कही हैं।”
    
    "ओह!" सबने कहा. अब कोई लड़ाई नहीं हुई. उन्हें खुशी हुई कि वे बिल्कुल ठीक हैं।
    
    कहानी का सार यह है कि कोई जो कहता है उसमें कुछ सच्चाई हो सकती है। कभी-कभी हम उस सत्य को देख पाते हैं और कभी-कभी नहीं क्योंकि उनका दृष्टिकोण भिन्न हो सकता है जिससे हम सहमत नहीं भी हो सकते हैं। इसलिए, अंधों की तरह बहस करने के बजाय, हमें कहना चाहिए, "हो सकता है कि आपके पास अपने कारण हों।" इस तरह हम बहस में नहीं पड़ते. जैन धर्म में बताया गया है कि सत्य को सात अलग-अलग तरीकों से बताया जा सकता है। तो आप देख सकते हैं कि हमारा धर्म कितना व्यापक है। यह हमें दूसरों के प्रति उनके दृष्टिकोण के प्रति सहिष्णु होना सिखाता है। इससे हम अलग-अलग सोच के लोगों के साथ मिल-जुलकर रह सकते हैं। इसे स्याद्वाद, अनेकांतवाद या विविध भविष्यवाणियों के सिद्धांत के रूप में जाना जाता है।`,
  },
  {
    id: "story26",
    name: "King Megharath (राजा मेघरथ)",
    imageUrl: "",
    content: `एक बार इंद्र (स्वर्गीय स्वर्गदूतों के प्रमुख) के दरबार में चर्चा चल रही थी। देवताओं में से एक ने कहा कि पृथ्वी पर बहादुर और दयालु राजा हैं जो उनकी शरण में आने वालों की रक्षा के लिए अपने जीवन का बलिदान देने में संकोच नहीं करेंगे। एक अन्य देवता को उनके कथन पर संदेह हुआ। दोनों बहस करने लगे और इसलिए इंद्र ने हस्तक्षेप करते हुए उन्हें पृथ्वी पर जाकर स्वयं देखने के लिए कहा। दोनों देवताओं ने एक कार्ययोजना बनाई। उनमें से एक ने कबूतर का रूप लेने का फैसला किया, और दूसरे ने बाज का रूप लिया।

    पृथ्वी पर राजा मेघरथ अपने दरबार में अपने दरबारियों से घिरा हुआ बैठा था। तभी एक कबूतर खुली खिड़की से उड़कर हॉल के अंदर चक्कर लगाने लगा. राजा को आश्चर्य हुआ जब वह उसकी गोद में गिरा। राजा समझ गया कि कबूतर डर के मारे वहाँ आया है।
    
    उसी समय, एक बाज़ राजा के दरबार में भी उड़ गया। उसने राजा से कहा, “यह कबूतर मेरा शिकार है।” राजा को एक पक्षी की बात सुनकर आश्चर्य हुआ। हालाँकि, उसने उत्तर दिया, "यह सच है कि यह कबूतर आपका शिकार है, लेकिन मैं आपको कुछ और भोजन दे सकता हूँ।"
    
    उसने अपने सेवकों को मिठाइयों की एक टोकरी लाने का आदेश दिया। लेकिन बाज़ ने कहा, “मैं इंसान नहीं हूं। मैं शाकाहारी नहीं हूं. मुझे अपने भोजन के लिए मांस की आवश्यकता है।
    
    राजा ने कहा, "मैं इस कबूतर के मांस के बदले तुम्हें अपना मांस दे दूं।" यह सुनकर दरबारियों में से एक ने कहा, “महाराज, आप अपना मांस क्यों देंगे? चलो कसाई की दुकान से मांस ले आओ।”
    
    
    राजा ने उत्तर दिया, "नहीं, क्योंकि जिस प्रकार हलवाई का व्यवसाय तब फलता-फूलता है जब हम मिठाइयाँ खाते हैं, कसाई का व्यवसाय तब फलता-फूलता है जब हम मांस का उपयोग करते हैं। हमें मांस की आपूर्ति करने के लिए कसाई को किसी अन्य जानवर को मारना पड़ सकता है। इस कबूतर ने शरण मांगी है और इसकी रक्षा करना मेरा कर्तव्य है। साथ ही यह देखना भी मेरा कर्तव्य है कि इस प्रक्रिया में किसी और को नुकसान न हो. इसलिए, मैं अपना मांस बाज को दे दूँगा।”
    
    इन शब्दों के साथ, उसने अपना खंजर निकाला और अपनी जाँघ से मांस का एक टुकड़ा काटकर बाज को दे दिया। पूरा दरबार स्तब्ध रह गया. परन्तु बाज़ ने राजा से कहा, “हे राजा! मुझे कबूतर के बराबर ही मांस चाहिए।”
    
    इसलिए, अदालत में एक तराजू लाया गया। राजा ने कबूतर को एक तरफ रख दिया और अपने मांस के टुकड़े को दूसरी तरफ रख दिया। राजा अपना अधिक से अधिक मांस तराजू पर डालता रहा, लेकिन फिर भी वह पर्याप्त नहीं था। अंततः राजा अपना पूरा शरीर तराजू पर रखने के लिए तैयार हो रहा था। दरबार में यह सुगबुगाहट गूंज उठी कि राजा एक तुच्छ पक्षी के लिए अपनी जान दे रहा है। लेकिन राजा ने इसे अपना कर्तव्य और धर्म सब से ऊपर माना। वह तराजू में कबूतर के सामने वाली तरफ बैठ गया, अपनी आँखें बंद कर लीं और शांति से ध्यान करने लगा।
    
    जैसे ही राजा ध्यान में उतरे, कबूतर और बाज ने अपना मूल दिव्य रूप धारण कर लिया। दोनों देवताओं ने राजा को प्रणाम किया और कहा, “हे महान राजा! तुम धन्य हो। हमें विश्वास है कि आप एक बहादुर और दयालु व्यक्ति हैं।
    
    इन शब्दों के साथ उन्होंने राजा की पुनः प्रशंसा और अभिवादन किया और चले गये। पूरा दरबार हर्षित शब्दों से गूंज उठा, "राजा मेघरथ दीर्घायु हों।"
    
    आगे चलकर राजा मेघरथ की आत्मा ही सोलहवें तीर्थंकर शांतिनाथ बनी।
    
    दयालु व्यक्ति वह होता है जो न केवल दूसरों के दुख और पीड़ा को देखकर प्रभावित होता है, बल्कि एक कदम आगे बढ़कर दर्द को कम करने का प्रयास करता है। वह उन लोगों को आर्थिक सहायता देता है जो गरीबी से त्रस्त हैं और जो भूखे और जरूरतमंद हैं उन्हें भोजन देता है। एक दयालु व्यक्ति खुद को बढ़ावा देने के लिए दूसरों को नुकसान नहीं पहुँचाएगा बल्कि इसके विपरीत, दूसरों की जान बचाने के लिए अपनी जान तक का बलिदान दे देगा।`,
  },
  {
    id: "story27",
    name: "GautamSwami (गौतमस्वामी)",
    imageUrl: "",
    content: `607 ईसा पूर्व में, गोबरगांव गांव में, वसुभूति और पृथ्वी गौतम (परिवार का नाम) नामक एक ब्राह्मण जोड़े का इंद्रभूति नाम का एक बेटा था। वह लंबा और सुंदर था. उनके अग्निभूति और वायुभूति नाम के दो छोटे भाई थे। ये तीनों कम उम्र में ही वेदों और अन्य अनुष्ठानों में पारंगत हो गए थे। वे मगध राज्य में बहुत लोकप्रिय और महान विद्वान थे। उनमें से प्रत्येक के 500 शिष्य थे।

    एक बार अपापा नगर में सोमिल नाम का एक ब्राह्मण अपने घर पर यज्ञ करा रहा था। इस अवसर पर चार हजार से अधिक ब्राह्मण उपस्थित थे और उनमें ग्यारह लोकप्रिय विद्वान थे।
    
    इंद्रभूति एक चमकते सितारे के रूप में उभरे। सोमिल ब्राह्मण दर्शन के कट्टर समर्थक थे और समारोह के दौरान बहुत खुश थे। पूरा शहर इस आयोजन से उत्साहित था जिसमें वे भेड़ और बकरियों की बलि देने जा रहे थे। अचानक, सोमिल ने देखा कि कई दिव्य प्राणी उसके यज्ञ स्थल की ओर आ रहे हैं। उन्होंने सोचा कि इससे उनका भेंट समारोह इतिहास में सबसे लोकप्रिय हो जाएगा। उन्होंने लोगों से कहा, "आसमान की ओर देखो, देवदूत भी हमें आशीर्वाद देने आ रहे हैं।" पूरा शहर उत्सुकता से आसमान की ओर देख रहा था।
    
    उन्हें यह देखकर आश्चर्य हुआ कि आकाशीय प्राणी अपने स्थान पर नहीं रुके, बल्कि वे और नीचे चले गए। सोमिल का अहंकार दूर हो गया जब उसे पता चला कि दिव्य प्राणी भगवान महावीर को श्रद्धांजलि दे रहे थे, जो महासेन वन के पास आए थे। इस घटना से इंद्रभूति बहुत क्रोधित हुआ और उसके अहंकार को ठेस पहुंची। वह मन ही मन सोचने लगा, "यह कौन सा महावीर है जो समृद्ध संस्कृत का भी प्रयोग नहीं करता, परन्तु जनसामान्य की भाषा अर्धमागधी बोलता है।" समारोह में उपस्थित सभी लोग भगवान महावीर की उपस्थिति मात्र से अभिभूत हो गये। इन्द्रभूति ने एक बार फिर सोचा, “महावीर पशुबलि का विरोध करते हैं, और यदि वे सफल हो गये तो हम ब्राह्मण अपनी आजीविका खो देंगे। मैं उनसे बहस करूंगा.'' वह उसे चुनौती देने के लिए निकल पड़ा.
    
    महावीर ने इंद्रभूति का स्वागत उसके नाम से पुकारकर किया, भले ही वे पहले कभी नहीं मिले थे। इंद्रभूति को आश्चर्य हुआ, लेकिन फिर उसने मन ही मन कहा, “मुझे कौन नहीं जानता? मुझे आश्चर्य नहीं हुआ कि वह मेरा नाम जानता था। मुझे आश्चर्य है कि क्या वह जानता है कि मैं क्या सोच रहा हूँ।” सर्वज्ञ महावीर जानते थे कि इंद्रभूति के मन में क्या चल रहा है। इंद्रभूति, भले ही एक महान विद्वान थे, उन्हें आत्मा के अस्तित्व पर संदेह था और वह मन ही मन सोच रहे थे, "क्या महावीर बता सकते हैं कि मुझे आत्मा के अस्तित्व पर संदेह है?" अगले ही पल महावीर ने कहा, "इंद्रभूति, आत्मा वहां है और तुम्हें इस पर सवाल नहीं उठाना चाहिए।" इंद्रभूति को आश्चर्य हुआ और वह महावीर के बारे में बहुत अच्छा सोचने लगा। फिर, उनके बीच दार्शनिक चर्चा हुई और इंद्रभूति ने अपनी मान्यताएँ बदल दीं और वे महावीर के पहले और प्रमुख शिष्य बन गए। उस समय इंद्रभूति पचास वर्ष के थे, और तभी से उन्हें गौतमस्वामी कहा जाने लगा, क्योंकि वे गौतम परिवार से थे।
    
    इस बीच शहर में, सोमिल और अन्य विद्वान बहस के अपेक्षित विजेता इंद्रभूति का स्वागत करने के लिए इंतजार कर रहे थे। उन्हें यह जानकर आश्चर्य हुआ कि इंद्रभूति महावीर का शिष्य बन गया है। अन्य दस ब्राह्मण विद्वान भी, जो महावीर से शास्त्रार्थ करने गये थे, इन्द्रभूति की तरह ही उनके शिष्य बन गये। सोमिल के घर पर मौजूद लोग जाने लगे और सोमिल ने समारोह रद्द कर दिया और सभी जानवरों को खुला छोड़ दिया।
    
    एक समय, गौतमस्वामी गोचरी (भोजन या भिक्षा लेने) के बाद वापस जा रहे थे, और उन्होंने देखा कि कई लोग दूसरी दिशा में जा रहे थे। उसने उनसे पूछा कि क्या हो रहा है। उन्होंने कहा, “हम आनंद श्रावक से मिलने जा रहे हैं। वह तपस्या कर रहा है और उसे एक विशेष ज्ञान (अवधिज्ञान) प्राप्त हुआ है।” आनंद श्रावक महावीर के अनुयायी थे, इसलिए गौतमस्वामी ने उनसे मिलने जाने का फैसला किया। जब आनंद ने गौतमस्वामी को अपने घर आते देखा, तो वह बहुत खुश हुआ कि उसके गुरु (आध्यात्मिक शिक्षक) आ रहे थे। हालाँकि, अपनी तपस्या के कारण बहुत कमज़ोर होने के बावजूद, वह उठे और गौतमस्वामी का स्वागत किया। गौतमस्वामी ने उनका हाल पूछा। आनंद ने जवाब दिया, "आपके आशीर्वाद से मैं ठीक हूं।" कुछ समय बाद, आनंद ने गौतमस्वामी से आदरपूर्वक कहा, "आदरणीय गुरु, मुझे अवधिज्ञान प्राप्त हो गया है जिसके कारण मैं चौदहवें स्वर्ग के समान ऊँचा और सातवें नरक के समान निचला भाग देख सकता हूँ।" गौतमस्वामी ने सोचा, "एक श्रावक अवधिज्ञान प्राप्त कर सकता है, लेकिन इस सीमा तक नहीं।" उन्होंने जोर से आनंद से कहा, "आपको अपनी कल्पना के लिए प्रायश्चित (प्रायश्चित) करना चाहिए।" आनंद हैरान था. वह जानता था कि वह क्या देख सकता है, लेकिन उसके शिक्षक ने उसे यह बताने के लिए प्रायश्चित करने को कहा। इसलिए, उन्होंने विनम्रतापूर्वक गौतमस्वामी से पूछा, "क्या सच बोलने के लिए प्रायश्चित करना पड़ता है?" गौतमस्वामी ने उत्तर दिया, "नहीं," और फिर यह सोचते हुए वहां से चले गए, "मैं भगवान महावीर से इसकी पुनः पुष्टि करूंगा।"
    
    गौतमस्वामी भगवान महावीर के पास लौटे, जो अपने अन्य शिष्यों के साथ बैठे थे, और आनंद के बारे में पूछा। महावीर ने कहा, “गौतम, आनंद सच कह रहा था। आप जैसा इतना ज्ञान रखने वाला व्यक्ति ऐसी गलती कैसे कर सकता है? तुम्हें अपनी गलती का प्रायश्चित करना चाहिए।” महावीर सत्य में विश्वास करते थे, और वे अपने समूह को अच्छा दिखाने के लिए कभी भी अपने शिष्य की गलती को नहीं छिपाते थे। गौतमस्वामी ने अपनी भिक्षा एक तरफ रख दी, और तुरंत अपने संदेह के लिए क्षमा मांगने के लिए आनंद के घर गए। आनंद को अपने विनम्र शिक्षक पर गर्व था, जिन्हें अपने अनुयायियों के सामने अपनी गलती स्वीकार करने में कोई आपत्ति नहीं थी।

एक अन्य अवसर पर, गौतमस्वामी भिक्षा के लिए शहर गए। वह एक पात्र में खीर (चावल और दूध से बनी मिठाई) लेकर लौट रहा था, तभी उसने पंद्रह सौ साधुओं को देखा। गौतमस्वामी को लगा कि वे भूखे हैं और उन्होंने उन्हें खीर दी। वे सोचने लगे कि गौतमस्वामी उन सभी को कैसे भोजन देंगे। गौतमस्वामी ने सभी साधुओं से बैठने का अनुरोध किया, और फिर उन्होंने अक्षेनमहंसि (घटती नहीं) लब्धि (विशेष शक्ति) की मदद से सभी को खीर परोसी। खीर परोसते समय उसने अपना अंगूठा खीर में रख दिया. सभी को यह देखकर आश्चर्य हुआ कि उन्हें छोटे पात्रा (कटोरी) से अच्छी तरह परोसा गया। सभी साधु गौतमस्वामी से इतने प्रभावित हुए कि सभी पंद्रह सौ साधुओं ने भगवान महावीर से दीक्षा (त्याग) लेने का फैसला किया।

उन साधुओं सहित कई साधुओं को केवलज्ञान प्राप्त हुआ, लेकिन गौतमस्वामी अभी भी इसे प्राप्त करने में असमर्थ थे। उन्हें चिंता थी कि उन्हें कभी केवलज्ञान प्राप्त नहीं होगा। एक दिन, गौतमस्वामी ने भगवान महावीर से पूछा, "हममें से ग्यारह (मुख्य शिष्य - गणधर) थे जिन्होंने दीक्षा स्वीकार की और उनमें से अधिकांश ने केवलज्ञान प्राप्त कर लिया है। मैं इतना अभागा क्यों हूँ कि केवलज्ञान प्राप्त नहीं कर पा रहा हूँ?” भगवान महावीर ने उत्तर दिया, “गौतम, तुम्हें मुझसे बहुत अधिक स्नेह है। केवलज्ञान प्राप्त करने के लिए आपको आसक्ति पर विजय प्राप्त करनी होगी। इसलिए, जब तक तुम मेरे प्रति अपनी आसक्ति नहीं छोड़ोगे, तब तक तुम्हारे लिए केवलज्ञान प्राप्त करना संभव नहीं होगा।”

  जिस दिन महावीर को निर्वाण (मुक्ति) प्राप्त करना था, महावीर ने गौतमस्वामी को देवशर्मा नामक व्यक्ति को उपदेश देने के लिए भेजा। वापस जाते समय, गौतमस्वामी को पता चला कि भगवान महावीर ने निर्वाण प्राप्त कर लिया है और मोक्ष तक पहुँच गए हैं। गौतमस्वामी सदमे और दुःख की स्थिति में आ गए और विलाप करते हुए बोले, “भगवान महावीर जानते थे कि यह होने वाला है। उसने मुझे दूर क्यों भेज दिया।” गौतमस्वामी अपने आँसू नहीं रोक सके और रोने लगे। कुछ ही मिनटों में वह वापस अपने होश में आ गया और सोचने लगा, “शायद यही नियति में ऐसा ही होना लिखा था। कोई भी सदैव जीवित नहीं रह सकता; कोई भी रिश्ता स्थाई नहीं होता. मुझे महावीर से इतना लगाव क्यों था?” उन्होंने विचार किया कि वे गलत थे और उन्होंने महावीर के प्रति मोह त्याग दिया। इस गहन चिंतन के दौरान, उन्होंने अपने घटी कर्मों को जला दिया और अस्सी वर्ष की आयु में केवलज्ञान प्राप्त किया।

गौतमस्वामी ने अगले बारह वर्षों तक जैन सिद्धांतों की शिक्षा दी और उनका प्रसार किया। उन्होंने 515 ईसा पूर्व में 92 वर्ष की आयु में मोक्ष प्राप्त किया।`,
  },
  {
    id: "story28",
    name: "Acharya Hemchandra (आचार्य हेमचन्द्र)",
    imageUrl: "",
    content: `आचार्य हेमचन्द्र का जन्म 1088 ई. में हुआ था। गुजरात राज्य के अहमदाबाद शहर से साठ मील दूर धंधुका शहर में मोधा वणिक (व्यापारी) जाति में। उनके माता-पिता चाचादेव और पाहिनी थे। जब पाहिनी गर्भवती थी तो उसने एक सुंदर सपना देखा। उन्होंने अपना स्वप्न आचार्य देवसूरी को सुनाया, जो उस समय धंधुका में थे। आचार्य ने कहा कि पाहिनी को एक पुत्र को जन्म देना था जो आध्यात्मिक ज्ञान, अंतर्ज्ञान और आचरण के क्षेत्र में महान प्रगति करेगा। जन्म के बाद बच्चे का नाम चांगदेवा रखा गया।

    अगली बार जब आचार्य देवसूरी धंधुका में थे, तो उन्होंने पाहिनी को अपने बेटे को ले जाते हुए देखा। उन्होंने पाहिनी से कहा, “मुझे इस प्रतिभाशाली बेटे की देखभाल करने दो। उनका एक महान आध्यात्मिक नेता बनना तय है।” हालाँकि, वह उसे अपना बेटा देने के लिए मना नहीं सका। आचार्य पीछा करते रहे और याद दिलाते रहे कि उनका बेटा एक प्रसिद्ध भिक्षु बनेगा और जैन संप्रदाय का गौरव बढ़ाएगा। उन्होंने फिर अनुरोध किया कि उन्हें लोगों की भलाई के लिए अपने स्वार्थ और बच्चे के प्रति प्यार का त्याग कर देना चाहिए। अंततः पाहिनी ने आचार्य को अपने पुत्र को अपने साथ ले जाने दिया।
    
    उन्होंने चांगदेव को भिक्षुणी की दीक्षा दी और उसका नाम सोमचंद्र रखा। शिष्य बहुत बुद्धिमान था और उसने जल्द ही दर्शन, शास्त्र, न्याय, व्याकरण आदि में महारत हासिल कर ली। साथ ही, उसने सहनशीलता, सहनशीलता, पवित्रता, सादगी, अनुशासन, शुद्धता और उदारता जैसे उत्कृष्ट गुणों का विकास किया। प्रशासन एवं कार्यकुशलता में सोमचन्द्र अतुलनीय थे। आचार्य देवसूरि ने सोमचन्द्र को तब आचार्य बनाया जब वे केवल इक्कीस वर्ष के थे। उस समय उन्हें हेमचन्द्र आचार्य नाम दिया गया।
    
    हेमचंद्र की प्रभावकारिता और ज्ञान की प्रसिद्धि धीरे-धीरे हर जगह फैल गई। हेमचन्द्र की योग्यता तथा गुजरात के राजा सिद्धराज के सहयोग से गुजरात में कुलीन संस्कृति का विकास हो रहा था। राजा सिद्धराज का उत्तराधिकारी कुमारपाल बना। हेमचन्द्र ने सात वर्ष पहले ही भविष्यवाणी कर दी थी कि कुमारपाल राजा बनेगा। साथ ही, आचार्य ने एक बार कुमारपाल की जान भी बचाई थी। अत: कुमारपाल हेमचन्द्र को अपना आध्यात्मिक गुरु (गुरू) तथा दानी मानते थे। कुमारपाल ने उन्हें असाधारण सम्मान दिया और गुजरात में अपने राज्य को आकार देने में उनकी सलाह मांगी। बहुत ही कम समय में गुजरात अहिंसा, विद्या और सुसंस्कृति का केंद्र बन गया।
    
    हेमचन्द्र ने न केवल अपने करियर के विकास के बारे में सोचा, बल्कि हमेशा सार्वभौमिक कल्याण के बारे में सोचा। इसके बावजूद कुछ ब्राह्मणों को इससे बहुत ईर्ष्या थी और वे हेमचंद्राचार्य और जैन धर्म को अपमानित करने का प्रयास कर रहे थे। इसलिए, कुछ ब्राह्मण राजा कुमारपाल के पास पहुंचे और कहा, "हेमचंद्राचार्य बहुत अहंकारी व्यक्ति हैं और वह हिंदू देवताओं का सम्मान नहीं करते हैं।" राजा कुमारपाल अपने आध्यात्मिक गुरु हेमचंद्राचार्य के बारे में इन विचारों को मानने के लिए तैयार नहीं थे। ब्राह्मणों ने राजा कुमारपाल से अनुरोध किया कि उन्हें हेमचंद्राचार्य को भगवान शिव (संहार के देवता) के मंदिर में आने के लिए आमंत्रित करना चाहिए। इसका उद्देश्य हेमचंद्राचार्य को अपमानित करना था क्योंकि उन्हें लगा कि वह भगवान शिव के मंदिर में जाकर उन्हें प्रणाम नहीं करेंगे। जब हेमचन्द्राचार्य आये तो राजा कुमारपाल ने कहा, “हम भगवान शिव के मन्दिर में जायेंगे।” उन्होंने बिना किसी हिचकिचाहट के प्रस्ताव स्वीकार कर लिया। ब्राह्मण यह सोचकर मन ही मन खुश हुए कि आज वे अपनी बात रख सकेंगे और अपने धर्म का महिमामंडन कर सकेंगे। फिर भी, वे गलत थे। उन्होंने हेमचंद्राचार्य को कम आंका। उन ब्राह्मणों को आश्चर्य हुआ, जब हेमचंद्राचार्य भगवान शिव के सामने झुक गए लेकिन उन्होंने कहा,
    
    “भवबीजस्कुराजानन रागदयः क्षयमुपगत यस्य; ब्रह्मा वा विष्णुर्व हरो जिनो वा नमस्तस्मै।” अर्थात, "मैं उस भगवान को प्रणाम कर रहा हूं, जिसने सांसारिक जीवन के कारण राग (राग) और घृणा (द्वेष) जैसे जुनून को नष्ट कर दिया है, चाहे वह ब्रह्मा, विष्णु या जिन हो।"
    
    इससे पता चला कि वास्तव में आचार्य प्रतिभाशाली थे और बुनियादी जैन सिद्धांतों के आधार पर उनका दृष्टिकोण व्यापक था। हेमचन्द्र के प्रभाव से राजा कुमारपाल ने जैन धर्म स्वीकार कर लिया। उन्होंने अपने राज्य में हिंसा और किसी भी जानवर की हत्या पर रोक लगा दी। राजा कुमारपाल ने जैन धर्म का पोषण करने वाले अनेक कानून बनाये। शाकाहार केवल जैनियों में ही नहीं, बल्कि गुजरात के सभी लोगों में पाया जाता था। जैन धर्म क्षेत्र की भूमि बन गई।
    
    हेमचंद्र ने कई साहित्यिक कृतियों की रचना की जिनमें कई छंद शामिल थे। आचार्य अहिंसा को राजनीतिक मंच पर रखने वाले पहले व्यक्ति थे। वह गुजरात की महानता और एकता के वास्तुकार थे। तत्वमीमांसा के क्षेत्र में वे एक योगी थे। उनकी कृति योग-शास्त्र, योग पर एक ग्रंथ, बहुत प्रसिद्ध है। लोग उन्हें 'कलि-काल सर्वज्ञ' कहते थे जिसका अर्थ है 'अंधकार काल में सर्वज्ञ'। 1173 ई. में चौरासी वर्ष की आयु में उनकी मृत्यु हो गई। महान आचार्य हेमचंद्र द्वारा योगदान किए गए साहित्यिक कार्यों के प्रभाव के कारण, जैन संस्कृति अभी भी गुजरात में चमकती है।`,
  },
  {
    id: "story29",
    name: "Dreams of Maa Trishla (माता त्रिशला के स्वप्न)",
    imageUrl: "",
    content: `राजकुमार वर्धमान के रूप में जन्म लेने से पहले तीर्थंकर महावीर की आत्मा दसवें स्वर्ग में एक देवदूत थी। आषाढ़ के शुक्ल पक्ष की षष्ठी तिथि की आधी रात को उनका आयुष्य कर्म समाप्त हो गया और देवदूत के रूप में उनका जीवन भी समाप्त हो गया। उनकी आत्मा पृथ्वी पर आई और देवानंद नामक एक ब्राह्मण महिला के गर्भ में पली। उस रात देवानंद ने 14 असामान्य और महान सपने देखे। वह उठी और अपने पति को सपने के बारे में बताया। उन्होंने उससे कहा कि उनका बेटा एक महान होगा और कई गुणों से संपन्न होगा। 82 दिनों के बाद, आसो महीने के तेरहवें दिन, देवदूतों के राजा सौधर्म इंद्र अपने दरबार में थे। उनका सिंहासन हिलने लगा, इसलिए उन्होंने यह देखने के लिए कि क्या हो रहा है, अपने अवधिज्ञान, एक विशेष मानसिक शक्ति जिसके माध्यम से कोई दूर की चीजों को देख सकता है, का उपयोग किया। उन्हें पता चला कि भगवान महावीर की आत्मा देवानंद के गर्भ में पली थी। एक पल के लिए वह हैरान रह गए, लेकिन फिर उन्हें एहसास हुआ कि यह भगवान महावीर के पिछले जन्म के गोत्र कर्मों का परिणाम है। उन्होंने मन ही मन कहा, “नहीं, तीर्थंकर भगवान का जन्म कभी भी निम्न स्तर के परिवार में नहीं होता है। महावीर के साथ ऐसा नहीं होना चाहिए. मैं उसकी आत्मा को एक उच्च दर्जे वाले परिवार में ले जाऊंगा। सौधर्म ने देवदूत हरि-नैगमेसिन को अपने दरबार में बुलाया और उसे देवानंद के गर्भ से भ्रूण को राजा सिद्धार्थ की पत्नी रानी त्रिशला के गर्भ में प्रत्यारोपित करने और रानी त्रिशला के भ्रूण को देवानंद के गर्भ में डालने का आदेश दिया।

    देवदूत हरि-नैगमेसिन ने देवानंद के घर जाने के लिए राजा सौधर्म इंद्र के दरबार को छोड़ दिया। अपनी दिव्य गति के साथ, वह जल्द ही देवानंद के बिस्तर के पास पहुंचे और भगवान महावीर की आत्मा के प्रति अपनी श्रद्धा व्यक्त की। अपनी दिव्य शक्ति से, उन्होंने देवानंद को गहरी नींद में डाल दिया, भ्रूण को हटा दिया और फिर रानी त्रिशला के महल में चले गए।
    
    फिर वह अपनी दिव्य गति से बहुत ही कम समय में रानी त्रिशला के महल में पहुँच गया। उसने अपनी दैवीय शक्ति का उपयोग करके रानी त्रिशला को गहरी नींद में सुला दिया और फिर उसने भ्रूणों की अदला-बदली की। उन्होंने एक बार फिर भगवान महावीर की आत्मा को नमन किया। फिर वह रानी त्रिशला के भ्रूण को लेकर चला गया और उसके गर्भ में पल रहे भ्रूण को बदलने के लिए देवानंद के घर चला गया। (दिगंबर भ्रूण स्थानांतरण भाग में विश्वास नहीं करते हैं।) उस रात रानी त्रिशला ने वे चौदह महान स्वप्न देखे। सपनों ने उसे आश्चर्य और खुशी से भर दिया। उसने अपने पति राजा सिद्धार्थ को जगाया और उसे बताया कि उसने चौदह सपनों में क्या देखा था। उसने उससे कहा कि वे सपने बहुत शुभ लगते हैं। अगले दिन राजा सिद्धार्थ ने विद्वानों को अपने दरबार में बुलाया और उनसे इन सपनों का अर्थ पूछा।
    
    (दिगंबर संप्रदाय यह नहीं मानता कि राजकुमार वर्धमान का गर्भाधान देवानंद ने किया था।)
    
    रानी त्रिशला का पहला सपना एक हाथी का था। वह बड़ा, लंबा और चार दाँतों वाला तेज तर्रार था। वह एक शुभ हाथी था और उत्कृष्टता के सभी वांछनीय चिह्नों से संपन्न था।
    
    इस सपने ने संकेत दिया कि वह असाधारण उच्च चरित्र वाले बच्चे को जन्म देगी। चार दाँतों ने संकेत दिया कि वह आध्यात्मिक रथ को उसके चार घटकों के साथ निर्देशित करेगा: भिक्षु, नन, आम आदमी और आम महिला।
    
    रानी त्रिशला का दूसरा सपना एक बैल का था। बैल कुलीन, भव्य और राजसी कूबड़ वाला था। इसके शरीर पर बारीक, चमकीले और मुलायम बाल थे। उसके सींग शानदार और तेज़ नुकीले थे।
    
    इस सपने ने संकेत दिया कि उसका बेटा अत्यधिक धार्मिक और एक महान आध्यात्मिक शिक्षक होगा। वह धर्म की खेती में मदद करेगा.
    
    रानी त्रिशला का तीसरा सपना एक शानदार शेर का था। उसके पंजे सुंदर और सुडौल थे। शेर का सिर बड़ा गोल और नुकीले दांत थे। उसके होंठ एकदम सही थे और उसकी आँखें तेज़ और चमकीली थीं। उसकी पूँछ प्रभावशाली रूप से लंबी और सुडौल थी। रानी ने देखा कि यह शेर उसकी ओर आ रहा है और उसके मुँह में घुस रहा है।
    
    इस सपने ने संकेत दिया कि उसका पुत्र शेर के समान शक्तिशाली और ताकतवर होगा। वह निडर, सर्वशक्तिमान और दुनिया पर शासन करने में सक्षम होगा।
    
      रानी त्रिशला का चौथा सपना धन, समृद्धि और शक्ति की देवी देवी लक्ष्मी का था। वह कमल पर बैठी थी और उसने पन्ना के साथ मोतियों की कई पंक्तियाँ और सोने की माला पहनी हुई थी। झुमके की एक जोड़ी उसके कंधों पर चकाचौंध सुंदरता के साथ लटक रही थी।
    
    इस सपने ने संकेत दिया कि उसका बेटा बहुत धन और वैभव का आनंद उठाएगा। वह तीर्थंकर होगा, सबका परम हितैषी होगा।
    
      रानी त्रिशला का पांचवां सपना आकाश से उतरती हुई एक सुंदर माला का था। इसमें विभिन्न फूलों की मिश्रित सुगंध आ रही थी। फूल अलग-अलग मौसमों में खिलते थे। सारा ब्रह्माण्ड उनकी सुगंध से भर गया।
    
    इस सपने ने संकेत दिया कि उनके बेटे की शिक्षा की खुशबू पूरे ब्रह्मांड में फैलेगी और सभी उसका सम्मान करेंगे।
    
    रानी त्रिशला का छठा सपना पूर्णिमा का था। यह बहुत ही शुभ दृश्य था. चंद्रमा अपने पूरे शबाब पर था. वह तारे के समान चमकीला था। इसने लिली को पूरी तरह खिलने के लिए जगा दिया।
    
    इस सपने ने संकेत दिया कि बच्चा सभी जीवित प्राणियों की पीड़ा को कम करने में मदद करेगा। वह विश्व में शांति लाएगा। वह बड़े पैमाने पर संपूर्ण मानवता की आध्यात्मिक प्रगति में मदद करेंगे।
    
    रानी त्रिशला का सातवाँ सपना उज्ज्वल सूर्य का था। सूर्य अंधकार को नष्ट करने के लिए चमक रहा था। वह जंगल की आग की लपटों के समान उज्ज्वल थी। सूर्य उदय हुआ और रात में पनपने वाले प्राणियों की बुरी गतिविधियों को समाप्त कर दिया।

इस सपने ने संकेत दिया कि उसके बेटे को सर्वोच्च ज्ञान प्राप्त होगा और वह भ्रम के अंधेरे को दूर कर देगा।


रानी त्रिशला का आठवां सपना एक सुनहरी छड़ी पर लहराते हुए एक बड़े झंडे का था। ध्वज मंद हवा में धीरे-धीरे और मंगलमय ढंग से लहरा रहा था। इसने सभी का ध्यान अपनी ओर आकर्षित किया. उस पर एक दीप्तिमान सिंह का चित्र बना हुआ था।

इस सपने ने संकेत दिया कि उसका बेटा धर्म का ध्वज उठाएगा। वह पूरे ब्रह्मांड में धार्मिक व्यवस्था को बहाल करेगा।


रानी त्रिशला का नौवां सपना साफ पानी से भरे एक स्वर्ण कलश का था। यह एक भव्य, सुंदर और चमकीला फूलदान था। इसे माला से सजाया गया था.

इस सपने ने संकेत दिया कि उसका बेटा सभी गुणों में परिपूर्ण होगा और सभी जीवित प्राणियों के लिए दया से भरा होगा। वह परम धार्मिक व्यक्तित्व होगा।

रानी त्रिशला का दसवां सपना कमल से भरी झील का था। झील में हजारों कमल तैर रहे थे, और वे सभी सूर्य की किरणों के स्पर्श से खिल गए और खुल गए। कमलों की सुगंध बहुत मधुर थी।

इस सपने ने संकेत दिया कि उसका बेटा सांसारिक मोह-माया से परे होगा। वह उन मनुष्यों को मुक्त करने में मदद करेंगे जो जन्म, मृत्यु और दुख के चक्र में उलझे हुए थे।

रानी त्रिशला का ग्यारहवां सपना एक महासागर का था। इसका पानी सभी दिशाओं में काफी ऊंचाई तक बढ़ गया। हवा धीरे-धीरे चली और लहरें पैदा हुईं।

इस सपने ने संकेत दिया कि उसका बेटा एक शांत और सुखद व्यक्तित्व वाला होगा। वह अनंत धारणा और ज्ञान प्राप्त कर लेगा और सांसारिक जीवन से बच जाएगा जो जन्म और मृत्यु और दुख का सागर है। यह उसकी आत्मा को मोक्ष (मुक्ति) की ओर ले जाएगा।

रानी त्रिशला का बारहवाँ सपना एक दिव्य विमान का था। विमान दिव्य संगीत से गूंज उठा। यह धूप की सुखद और आध्यात्मिक सुगंध से संतृप्त था।

इस सपने ने संकेत दिया कि स्वर्ग के सभी देवदूत उसके बेटे की आध्यात्मिक शिक्षाओं का सम्मान, सम्मान और सलाम करेंगे।


रानी त्रिशला का तेरहवां सपना रत्नों के एक बड़े ढेर का था। यह सभी प्रकार के रत्नों और बहुमूल्य पत्थरों का मिश्रण था।

इस सपने ने संकेत दिया कि उसके बेटे में अनंत गुण और ज्ञान होंगे और वह सर्वोच्च आत्मा को प्राप्त करेगा।

रानी त्रिशला का चौदहवाँ सपना धुंआ रहित अग्नि का था। आग बहुत तीव्रता से जल रही थी, लेकिन धुआं नहीं था।

इस सपने ने संकेत दिया कि उसका बेटा सुधार करेगा और धार्मिक व्यवस्था को बहाल करेगा। वह अंधविश्वास और रुढ़िवादी कर्मकांडों को दूर करेंगे। इसके अलावा, वह अपने कर्मों को जला देगा या नष्ट कर देगा और मोक्ष प्राप्त करेगा।

कुछ ग्रंथों में कहा गया है कि रानी त्रिशला ने सोलह स्वप्न देखे थे।

पंद्रहवाँ सपना मछली के एक जोड़े का था जो दर्शाता है कि उसका बेटा बेहद सुंदर होगा।

सोलहवाँ सपना एक ऊँचे सिंहासन का था जो दर्शाता था कि उसके बेटे की आध्यात्मिक स्थिति बहुत ऊँची होगी।

इन सभी सपनों का संकेत संक्षेप में यह है कि जन्म लेने वाला बच्चा बहुत मजबूत, साहसी और गुणों से भरा होगा। वह बहुत धार्मिक होगा और एक महान राजा या आध्यात्मिक नेता बनेगा। वह धार्मिक व्यवस्था में सुधार और पुनर्स्थापन करेंगे और ब्रह्मांड के सभी प्राणियों को मोक्ष प्राप्त करने के लिए मार्गदर्शन करेंगे। उसकी भी मुक्ति हो जायेगी.

भगवान महावीर का जन्म विक्रम संवत से पांच सौ तैंतालीस साल पहले यानी 599 ईसा पूर्व चैत्र माह के शुक्ल पक्ष के तेरहवें दिन हुआ था।`,
  },
  {
    id: "story30",
    name: "Tirthankara Bhagwan Mahavira (तीर्थंकर भगवान महावीर)",
    imageUrl: "",
    content: `तीर्थंकर महावीर इस युग के अंतिम और चौबीसवें तीर्थंकर थे। उनसे पहले तेईस तीर्थंकर हुए थे। जी। ऋषभदेव एवं अन्य।

    भगवान अनंत हैं, लेकिन एक युग में और भरतक्षेत्र में तीर्थंकर चौबीस ही हैं। प्रत्येक तीर्थंकर, एक नियम के रूप में, एक भगवान है, लेकिन हर भगवान एक तीर्थंकर नहीं है। तीर्थंकर बने बिना भी आत्मा को देवत्व की प्राप्ति हो सकती है। हर आत्मा भगवान बन सकती है. जो पूर्णता की प्राप्ति की ओर ले जाता है उसे तीर्थ कहा जाता है और जो स्वयं उस सर्वोच्च स्थिति तक पहुंचते हैं और दूसरों को मुक्ति का मार्ग दिखाते हैं वे तीर्थंकर कहलाते हैं।
    
    भगवान का जन्म नहीं होता, वे बड़े होकर एक हो जाते हैं। कोई भी व्यक्ति जन्म से ही भगवान नहीं होता। महावीर भी अपने जन्म के बाद से भगवान नहीं थे। वह भगवान बन गया, जब उसने स्वयं पर विजय प्राप्त कर ली। मोह, राग और द्वेष पर विजय प्राप्त करना स्वयं पर विजय प्राप्त करना है।
    
    यद्यपि भगवान महावीर द्वारा प्रतिपादित सिद्धांत बहुत गहरे, जटिल, प्रभावशाली और स्वीकार्य हैं, उनका जीवन बहुत आसान, सीधा और घटना रहित है; इसमें किस्मों के लिए कोई जगह नहीं है. उनके जीवन की कथा संक्षेप में यह है कि उन्होंने जीवन के प्रथम तीस वर्ष धन-वैभव के बीच जल में कमल की भाँति उदासीन भाव से व्यतीत किये। अगले बारह वर्षों तक वह परमात्मा की खोज में लगे रहे और गहन ध्यान में जंगलों में रहे और उपवास के तीस वर्षों के दौरान, उन्होंने सर्वोदय अर्थात सभी जीवित प्राणियों के कल्याण का प्रचार किया, इसका प्रचार किया और इसे चारों कोनों में फैलाया। भूमि, महावीर का जीवन घटनापूर्ण नहीं है। घटनाओं के क्रम में उनके व्यक्तित्व की खोज करना व्यर्थ है। हालाँकि, ऐसी कोई घटना नहीं हो सकती जो उन अनंत पिछले जन्मों में न घटी हो, जिनसे वह गुजरा था।
    
    महावीर का जन्म वैशाली गणराज्य के प्रसिद्ध नेता लिच्छवी राजा सिद्धार्थ की पत्नी रानी त्रिशला के गर्भ से कुंडग्राम में हुआ था। उनकी मां वैशाली गणराज्य के राष्ट्रपति राजा चेटक की बेटी थीं। उनका जन्म 2600 वर्ष पूर्व चैत्र मास के द्वितीय पक्ष के तेरहवें दिन क्षत्रिय कुल के नाथ परिवार में हुआ था। उनके निरंतर विकास को देखते हुए उनके माता-पिता ने उनका नाम वर्धमान रखा।
    
    उनके जन्म का उत्सव न केवल उनके माता-पिता, रिश्तेदारों और राज्य की प्रजा द्वारा, बल्कि देवताओं और उनके प्रभुओं द्वारा भी बड़े उत्साह के साथ मनाया गया, क्योंकि वह तीर्थंकर बनने वाले थे। इस उत्सव को जन्म कल्याणक महोत्सव कहा जाता है। देवताओं के स्वामी इंद्र ने उन्हें एरावत हाथी पर बिठाया और बड़े धूमधाम और शो के साथ उनका अभिषेक समारोह किया। जैन महाकाव्य ग्रंथों में इस घटना का सजीव वर्णन मिलता है।
    
    उनके माता के गर्भ में आने से पहले ही पता चल गया था कि तीर्थंकर का जन्म होने वाला है। एक रात, अंतिम घंटों में, माँ प्रियाकारिणी त्रिशला ने अपनी शान्त निद्रा में निम्नलिखित सोलह स्वप्न देखे जो अत्यंत शुभ घटित होने के सूचक थे।-
    
    1. नशे से पागल हाथी।
    
    2. ऊँचे कंधों वाला एक सफेद बैल।
    
    3. गरजने वाला शेर.
    
    4. धन की देवी लक्ष्मी, कमल के सिंहासन पर विराजमान हैं।
    
    5. दो सुगंधित मालाएँ।
    
    6. तारों की सभा में चंद्रमा.
    
    7. उगता सूरज.
    
    8. कमल के पत्तों से ढके दो सोने के घड़े।
    
    9. दो मछलियाँ टैंक में खेल रही हैं।
    
    10. साफ पानी से लबालब भरा एक टैंक।
    
    11. गरजता हुआ सागर.
    
    12. रत्नजड़ित सिंहासन।
    
    13. रत्नों से प्रकाशित देवताओं का रथ।
    
    14. धरणेन्द्र के निवास को छूता हुआ विशाल आकाश।
    
    15. रत्नों का ढेर, और
    
    16. बिना धुंए की आग.
    
    सुबह की व्यस्तताओं से मुक्त होकर, माँ त्रिशला राजा सिद्धार्थ के पास गईं और उन्हें सोलह सपनों के बारे में बताया। वह उनका प्रभाव जानना चाहती थी। राजा निमित्त शास्त्र (वाद्य कारणों का शास्त्र) में पारंगत थे। स्वप्न के बारे में जानकर वह बहुत प्रसन्न हुआ। अत्यंत सुखद स्वप्न का शुभ प्रभाव उनके अत्यंत प्रसन्न चेहरे के भावों से माता त्रिशला तक पहुंच गया। उन्होंने उससे कहा कि उसे एक पुत्र का आशीर्वाद मिलने वाला है, जो तीर्थंकर बनेगा और तीनों लोकों के प्राणियों के दिलों पर राज करेगा, मुक्ति के सिद्धांतों का प्रचार करेगा और बहुत भाग्यशाली होगा। त्रिशला का गर्भ मरुदेवी के समान पवित्र हो गया, जिसने प्रथम तीर्थंकर आदिनाथ या ऋषभदेव को जन्म दिया था।
    
    कुल मिलाकर, ये सपने संकेत करते हैं कि त्रिशला से पैदा होने वाला पुत्र फूलों की पत्तियों के समान कोमल, चंद्रमा के समान शीतल, सूर्य के समान तेजस्वी, अज्ञान के अंधकार को नष्ट करने वाला, हाथी के समान शक्तिशाली, सक्रिय होगा। बैल के समान, समुद्र के समान गहरा, रत्नों के ढेर के समान पवित्र और निर्धूम अग्नि की लौ के समान उज्ज्वल।
    
    आषाढ़ मास की द्वितीया की षष्ठी तिथि को बालक वर्धमान ने अपनी माता के गर्भ में प्रवेश किया।
    
    बालक वर्धमान जन्म से ही स्वस्थ, सुन्दर और आकर्षक व्यक्तित्व का स्वामी था। उन्होंने अपने दिए गए वर्धमान नाम को उचित ठहराया, जो कि शुक्ल पक्ष के दूसरे दिन चंद्रमा के अंक की तरह बढ़ता गया। उनकी सोने जैसी काया ने सभी को आकर्षित किया। देवताओं के स्वामी ने स्वयं भगवान के फ्रेम की सुंदरता को गहराई से पीने के लिए एक हजार आंखें धारण कीं।
    
    वह एक संवेदनशील, विचारशील, विवेकशील और निडर लड़का था। उसे कोई डर नहीं मालूम था. वह साहस की प्रतिमूर्ति थे। इसलिए उन्हें बचपन से ही वीर और अतिवीर के नाम से जाना जाता था। उनके पांच नाम प्रसिद्ध हैं-वीर, अतिवीर, सन्मति, वर्धमान और महावीर।

वह तत्पर और तत्पर थे और कठिनाइयों में कभी अपना संतुलन नहीं खोते थे। एक दिन बालक वर्धमान अपनी बालसुलभ चंचलता से अपने माता-पिता तथा नगरवासियों को प्रसन्न करते हुए अन्य राजकुमारों के साथ उद्यान में खेल रहा था। वह चंचल भाव में एक पेड़ पर चढ़ गया। इतने में एक भयानक काले साँप ने पेड़ के तने को घेर लिया और क्रोध के मारे ऐसा धुआँ छोड़ने लगा कि बड़े-बड़े बलवान भी काँप जाएँ। स्वयं को विपरीत परिस्थितियों में पाकर बच्चे भय से काँपने लगे, परंतु वह भयानक साँप धैर्यवान एवं बलशाली बालक महावीर को परेशान नहीं कर सका। महावीर निडर होकर और बिना किसी हिचकिचाहट के उसके पास आये, क्रोधित साँप ने क्रोध छोड़ दिया और अपने रास्ते चला गया।

इसी प्रकार एक बार एक हाथी बन गया और जिस भवन में हाथियों को रखा जाता है, उसके खम्भे को तोड़कर नगर में उत्पात मचाने लगा। पूरा शहर त्राहि-त्राहि कर उठा और लोग घबराकर एक जगह से दूसरी जगह भागने लगे। हालाँकि, राजकुमार वर्धमान ने अपनी सूझबूझ नहीं खोई और अपनी शक्ति और चतुराई से हाथी को नियंत्रित कर लिया। राजकुमार की बहादुरी और धैर्य की चर्चा शहर के आम लोगों में होने लगी।

वह एक प्रतिभाशाली व्यक्ति थे और बड़ी-बड़ी समस्याओं को आसानी से हल कर सकते थे। वह स्वभाव से शान्त था; युवावस्था में प्रवेश के साथ ही गंभीरता बढ़ती गई। उसे अकेलापन पसंद था. वह हमेशा जीवन और मृत्यु के मूल सिद्धांतों पर विचार करने में व्यस्त रहते थे और गहन विचार-विमर्श में लगे रहते थे। सत्य तक पहुँचने के इच्छुक लोगों ने उनके सामने अपनी शंकाएँ रखीं और उन्होंने कुछ ही समय में उनका समाधान कर दिया। उनकी शांत मुद्रा को देखकर अधिकांश शंकाओं और भ्रांतियों का समाधान हो गया। उनके शारीरिक गठन को देखने मात्र से ही बड़े-बड़े भिक्षुओं के धर्म के मूल सिद्धांतों के बारे में बड़े-बड़े संदेह दूर हो गये थे। इन भ्रांतियों का समाधान वे स्वयं थे।

एक दिन वह अपने महल की चौथी मंजिल पर बैठा हुआ गहन चिंतन में लीन था। उनके साथियों ने आकर माता त्रिशला से पूछा कि वर्धमान कहाँ हैं। अपनी गृहस्थी में व्यस्त माँ ने बस ऊपरी मंजिल की ओर इशारा किया। लड़के सातवीं मंजिल पर भागे, लेकिन वर्धमान को वहां नहीं पाया। जब उन्होंने धार्मिक ग्रंथों का अध्ययन कर रहे राजा सिद्धार्थ से पूछा कि वर्धमान कहाँ हैं, तो उन्होंने निचली मंजिलों की ओर इशारा किया। पिता और माता की विरोधाभासी बातें सुनकर लड़के असमंजस में पड़ गये। उन्होंने हर मंजिल की तलाशी ली और चौथी मंजिल में वर्धमान को पढ़ते हुए पाया। लड़कों ने शिकायत की कि उन्होंने महल की सभी मंजिलों की तलाशी ली है और महावीर एक दार्शनिक के रूप में वहां छिपे हुए हैं। वर्धमान ने उनसे पूछा कि उन्होंने माँ से यह बताने के लिए क्यों नहीं पूछा कि वह कहाँ थे। लड़कों ने कहा कि सारी परेशानी पूछने से पैदा हुई. मां ने बताया कि वह ऊपर है, जबकि पिता ने बताया कि वह नीचे है. समस्या यह थी कि सत्य कहाँ खोजा जाए और सत्य कहाँ है। वर्धमान ने उन्हें बताया कि दोनों सही थे; कि वह चौथी मंजिल पर था, माँ के दृष्टिकोण से ऊपर और पिता के दृष्टिकोण से नीचे। मां पहली मंजिल पर थीं, जबकि पिता सातवीं मंजिल पर। नीचे और ऊपर की स्थितियाँ सापेक्ष हैं। सापेक्षता के बिना नीचे या ऊपर की ओर जाने का कोई सवाल ही नहीं है। यद्यपि पदार्थ की प्रकृति का किसी अन्य पदार्थ से कोई संबंध नहीं है तथापि वर्णन सापेक्ष है। इस प्रकार बालक वर्धमान बालकों को ऊँचे सिद्धान्त आसानी से समझा देते थे।

दुनिया ने उन्हें अपने रास्ते पर चलने के लिए मनाने की कोशिश की लेकिन महावीर अपनी आत्मा की गहराइयों में डूबे हुए थे इसलिए दुनिया उन्हें अपने रास्ते पर चलने के लिए नहीं उलझा सकी। युवाओं ने उस पर अपना पासा फेंका, लेकिन व्यर्थ। माता-पिता के स्नेह ने उसका रास्ता रोकने की कोशिश की, लेकिन वह अपनी माँ के आँसुओं के सैलाब में नहीं डूबा।

तदनुसार, उन्होंने अपनी युवावस्था के तीसवें वर्ष में, मगसिर के पहले भाग के दसवें दिन, अपना घर छोड़ दिया। वह नग्न हो गया और उस एकान्त वन में आत्मसाधना में लग गया। लौकांतिक देवता स्वर्ग से आए और उनके संकल्प की बड़ी श्रद्धा से प्रशंसा की। भिक्षु वर्धमान चुप रहते थे और किसी से बात नहीं करते थे। वे सदैव अपनी आत्मा के चिंतन में लीन रहते थे। उसे यह भी याद नहीं रहा कि उसे नहाने या दाँतों की सफाई की जरूरत है। वह पहाड़ों की गुफाओं में दोस्तों और दुश्मनों को समान रूप से पकड़कर आराम करता था और मौसम की प्रतिकूलताओं से परेशान नहीं होता था।

जंगल के क्रूर जानवरों ने शांत मुद्रा, प्राकृतिक सहजता और अहिंसक जीवन देखा और अपनी स्वाभाविक शत्रुता को भूल गए और दोस्त बन गए। साँप और नेवले, बाघ और गायें एक ही घाट पर पानी पीते थे। वे जहां भी ठहरते थे, पूरा वातावरण शांति और सुकून से भरा होता था।

यदि कभी-कभी उसे भोजन का शौक होता, तो वह अजीब मानसिक झिझक के साथ निकटतम शहर में चला जाता। यदि कोई गृहस्थ उसे शास्त्र की आज्ञा के अनुसार और नौ प्रकार के अनुष्ठानों के साथ शुद्ध भोजन देता था, तो वह भोजन ग्रहण करता था और जल्द ही जंगल में लौट जाता था। उन्होंने दु:खी सती चंदनबाला के हाथों एक बार भोजन भी स्वीकार किया।

इस प्रकार बाह्य और आंतरिक तपस्या में संलग्न होकर उन्होंने बारह वर्ष व्यतीत किये। बयालीस साल की उम्र में गहन आत्म-अवशोषण की इस स्थिति में उन्होंने सूक्ष्म लगाव को नष्ट कर दिया और अपने अस्तित्व की पूरी तरह से अलग स्थिति प्राप्त की। आध्यात्मिक विकास की इस अवस्था के साथ उन्हें सर्वज्ञता भी प्राप्त हुई। मोह, राग और द्वेष रूपी शत्रुओं पर पूर्णतः विजय प्राप्त कर वे वास्तविक महावीर बन गये। वह सर्वज्ञ और पूर्णतः विरक्त होकर भगवान बन गये। तीर्थंकर नामकर्म के फलस्वरूप उन्हें वह पद प्राप्त हुआ और वे भगवान महावीर कहलाये। के प्रथम दिन सबसे पहले उनका दिव्य सन्देश दिया गया। श्रावण मास के कारण इस दिन को पूरे भारत में वीर शासन जयंती के रूप में मनाया जाता है।

देवताओं के भगवान ने कुबेर को सांसारिक प्राणियों के लिए भगवान महावीर के दिव्य संदेश को सुनने और मिलने के लिए समवशरण नामक एक विशाल बैठक-कक्ष का निर्माण करने का आदेश दिया था। प्रत्येक प्राणी को वहां जाकर सन्देश सुनने का अधिकार था। छोटे-बड़े का कोई भेद नहीं था। जिसका आचरण अहिंसक है, जिसने पदार्थों की अंतर्निहित प्रकृति को छू लिया है, जिसने अपने आप में गहराई से गोता लगा लिया है, वह न केवल मनुष्यों से बल्कि देवताओं से भी बड़ा है, भले ही वह निम्न कुल में पैदा हुआ हो।

उनकी धार्मिक सभा में राजा और आम, अमीर और गरीब, काले और गोरे, सभी एक साथ बैठते थे और उनका संदेश सुनते थे। देवताओं और मनुष्यों के साथ-साथ जानवर भी वहाँ बैठकर भगवान की दिव्य शिक्षाएँ सुनते थे। संसार के प्राणियों में ऐसी समानता अन्यत्र कठिन है। भगवान के चतुर्गुण संघ में भिक्षु, भिक्षुणी, पुरुष और महिला गृहस्थ थे।

उनके विरोधी कई विद्वान उनके सार्वभौमिक प्रेम और सद्भावना के संदेश से प्रभावित होकर, अपनी गलत धारणाओं को छोड़कर उनके शिष्य बन गये। उनमें प्रमुख थे उनके प्रमुख शिष्य इन्द्रभूति गौतम। उन्हें भगवान के प्रथम गुरु के रूप में स्वीकार किया गया और वे गौतम स्वामी के नाम से प्रसिद्ध हुए। उनके दिगंबर जैन साधुत्व में दीक्षित होने की कहानी काफी दिलचस्प है।

इंद्रभूति गौतम वेद और वेदांग में पारंगत थे। उनके पाँच सौ शिष्य थे। जब इंद्र को पता चला कि इंद्रभूति गौतम ही भगवान के मुख्य गुरु बन सकते हैं, तो वह एक बूढ़े ब्राह्मण का भेष बनाकर उनके निवास पर गए, इंद्र ने खुद को महावीर के शिष्य के रूप में पेश किया और गौतम से एक संस्कृत श्लोक का अर्थ पूछा।

इन्द्रभूति विचारमग्न हो गये। “ये छः द्रव्य, नौ द्रव्य, पाँच अस्तिकाय आदि क्या हैं?” उन्होंने अपनी अज्ञानता को अपने अहंकार में छिपा लिया और इंद्र से कहा कि वह अपने स्वामी प्रथम से इस विषय पर चर्चा करना चाहेंगे। ई., भगवान महावीर. उन्होंने इंद्र के साथ उस स्थान पर जाने की इच्छा व्यक्त की जहां भगवान अपना उपदेश दे रहे थे। गौतम के मामले में वास्तविक अध्यात्मवाद को स्वीकार करने और भगवान के लिए धर्म का अपना लंबे समय से प्रतीक्षित संदेश देना शुरू करने का समय आ गया था। जैसे ही इन्द्रभूति गौतम समवशरण के निकट आये उनकी कठोरता सहसा कोमलता में बदल गयी। मानस्तंभ (समवशरण के ठीक सामने एक स्तंभ) को देखते ही उनका गर्व गायब हो गया और वे स्वयं भिक्षु बनने की दीक्षा के अनुरोध के साथ भगवान के पास पहुंचे। अपनी योग्यता और महावीर की उदारता से वे भगवान के प्रथम गणधर बन गये। दस अन्य गांधार थे जिनके नाम थे; (1) अग्निभूति, (2) वायुभूति, (3) आर्यव्यक्त, (4) सुधर्मा, (5) मंडित, (6)मौर्यपुत्र, (7) अकंपित, (8) अचैभृत, (9) मेतर्य और (10) प्रभास।

उनके गृहस्थ शिष्यों में मगध के राजा महाराज श्रेणिक (बिम्बसार) प्रमुख थे।

उन्होंने लगातार तीस वर्षों तक पूरे भारत का भ्रमण किया। विभिन्न प्राणियों ने उनकी शिक्षाओं को अपनी-अपनी भाषाओं में समझा। उनके उपदेशों को दिव्य ध्वनि कहा जाता था। उन्होंने आत्मा और अन्य सभी पदार्थों की स्वतंत्रता को बरकरार रखा है। उन्होंने घोषणा की कि प्रत्येक आत्मा स्वतंत्र है; कोई भी दूसरे पर निर्भर नहीं है; आत्मनिर्भरता ही पूर्ण स्वतंत्रता प्राप्त करने का मार्ग है। स्वावलम्बन और कुछ नहीं बल्कि रंग, मोह और विभाजन से भिन्न अपनी दृष्टि को केवल अपनी आत्मा पर केन्द्रित करना है। स्वतंत्रता केवल अपने बल पर ही प्राप्त की जा सकती है; आप दान में अनंत आनंद और स्वतंत्रता प्राप्त नहीं कर सकते या उन्हें दूसरों के बल पर प्राप्त नहीं कर सकते।

सभी आत्माएं अलग-अलग और स्वतंत्र हैं, एक नहीं बल्कि एक जैसी हैं, एक जैसी हैं, कोई छोटा-बड़ा नहीं है। इसलिए, उन्होंने नियुक्त किया:-

1) अन्य आत्माओं को अपनी आत्मा मानना।

2. सभी आत्माएं समान हैं, लेकिन एक नहीं।

3. यदि हमारे प्रयास सही दिशा में हों तो हर आत्मा को देवत्व की प्राप्ति हो सकती है।

4. हर प्राणी अपनी गलतियों के कारण दुखी होता है और गलतियों को दूर करके खुश हो सकता है।

महावीर ने किसी नवीन सत्य का प्रचार नहीं किया; सत्य में पुराना या नया जैसा कुछ भी नहीं है। उन्होंने जो कुछ कहा वह सत्य एवं शाश्वत है। उन्होंने सत्य की स्थापना नहीं की; उन्होंने ही इसका उद्घाटन किया था. उन्होंने कोई नया धर्म नहीं खोजा। धर्म पदार्थों का स्वभाव है। पदार्थों का स्वभाव नहीं बनाया जा सकता। जिसका निर्माण किया जा सकता है उसे प्रकृति कैसे कहा जा सकता है? इसे सिर्फ जाना जा सकता है. कर्म करने के अभिमान से दूर रहकर और स्वयं को गैर-स्वयं से अलग करके जो स्वयं और अन-स्व को जानता है, किसी भी तरह से दूसरों से प्रभावित हुए बिना और उनके सभी दृष्टिकोणों से, वह भगवान है। तीर्थंकर भगवान वस्तुओं के स्वरूप को जानते और उजागर करते हैं, उनकी रचना नहीं करते।

वे तीर्थंकर थे। उन्होंने तीर्थ अर्थात आत्मा की मुक्ति का मार्ग प्रतिपादित किया। आचार्य सामंत भद्र ने अपनी शिक्षाओं को सर्वोदय तीर्थ (सभी जीवित प्राणियों के कल्याण का उपदेश देने वाला धर्म) कहा है।

हे भगवान महावीर - आपका धर्म सभी के कल्याण के लिए है। आपकी शिक्षाओं में कोई विरोधाभास नहीं है, केवल आप जो कुछ भी कहते हैं वह सापेक्ष है अर्थात विभिन्न दृष्टिकोणों से वर्णित है, संदर्भों के अनुसार एक दूसरे पर हावी रहता है; अन्य उपदेशकों के दावे, सापेक्ष न होने के कारण, चीजों की प्रकृति को वैसे ही प्रतिपादित करने में सक्षम नहीं हैं जैसे वे हैं। जीवन के सत्य का आपका प्रतिपादन इस संसार के सभी दुखों और दुर्भाग्य को नष्ट करने और सांसारिक प्राणियों को उनके परम सुख की ओर ले जाने में सक्षम है और इस प्रकार यह सर्वोदय तीर्थ यानी सभी जीवित प्राणियों के कल्याण के लिए धर्म है।

जिससे सबका कल्याण हो वही सर्वोदय है। भगवान महावीर द्वारा प्रतिपादित सभी के कल्याण के लिए धर्म और जीवन और अमरता के सत्य की व्याख्या में कोई संकीर्णता या सीमा नहीं है। आत्मा का धर्म सभी प्राणियों के लिए है। धर्म को केवल मनुष्य से जोड़ना एक प्रकार की संकीर्णता है। यह सभी प्राणियों का धर्म है। "मनुष्य का धर्म" शब्द भी पर्याप्त उदार नहीं है। यह धर्म के दायरे को केवल मानव समुदाय तक सीमित करता है, जबकि धर्म का विस्तार समस्त संवेदनशील विश्व तक है, क्योंकि सभी प्राणी शांति और खुशी से रहना चाहते हैं।

तीर्थंकर भगवान महावीर ने प्रत्येक पदार्थ का पूर्ण स्वतंत्र अस्तित्व प्रतिपादित किया है और कहा है कि प्रत्येक पदार्थ अपना परिवर्तन स्वयं करता है। इस प्राकृतिक प्रक्रिया में कोई अन्य पदार्थ हस्तक्षेप नहीं कर सकता। यहां तक कि ईश्वर, सर्वशक्तिमान, भी चीजों के इस अस्तित्व का निर्माता या विनाशक नहीं है। महावीर के उपदेशों ने न केवल जीवित प्राणियों की, बल्कि उन सभी परमाणुओं की स्वतंत्रता को बरकरार रखा, जो पदार्थ के सबसे छोटे (अविभाज्य) कण या इकाइयाँ हैं और जिन्हें आगे विभाजित नहीं किया जा सकता है। दूसरों की गतिविधियों में हस्तक्षेप करने की इच्छा मिथ्या है, व्यर्थ है और दुख का कारण बनती है, क्योंकि दूसरों को अन्य प्राणियों के सुख और दुख, जीवन और मृत्यु का निर्माता या विनाशक मानना सरासर अज्ञानता है।

यह अच्छी तरह से कहा गया है कि यदि किसी व्यक्ति को दूसरों के सुख-दुख, जीवन और मृत्यु का निर्माता माना जाता है तो हमारे अपने गुण और अवगुण निरर्थक होंगे। सवाल यह है कि क्या कोई, चाहे वह कितना भी ताकतवर क्यों न हो, हमें खुश कर सकता है, भले ही हम अवगुणों में लिप्त हों? इसी प्रकार, यदि हम स्वयं को पुण्य कार्यों में व्यस्त रखते हैं, तो क्या कोई, चाहे वह स्वयं ईश्वर ही क्यों न हो, हमें हानि पहुँचा सकता है? यदि हां, तो अच्छा करना और बुरे से डरना बेकार होगा, क्योंकि किसी के कर्मों का फल भोगना जरूरी नहीं है। यदि यह सच है कि हमें अपने अच्छे और बुरे कर्मों का फल स्वयं ही भोगना पड़ता है, तो किसी भी हस्तक्षेप की अवधारणा निरर्थक है। इसी सत्य को आचार्य अमितगति ने भावना द्वात्रिंशतिका के श्लोक 30-31 में व्यक्त किया है।

अंत में, बहत्तर वर्ष की आयु में, दीपावली के दिन, इस युग के अंतिम तीर्थंकर भगवान महावीर ने इस भौतिक शरीर को त्याग दिया और निर्वाण (पूर्ण मुक्ति) प्राप्त की। उसी दिन, उनके प्रमुख शिष्य इंद्रभूति गौतम को सर्वज्ञता प्राप्त हुई। जैन परंपरा के अनुसार, दीपावली का महान त्योहार भगवान महावीर की मुक्ति और उनके प्रमुख शिष्य गौतम द्वारा पूर्ण सजा प्राप्त करने के सम्मान में मनाया जाता है।`,
  },
  {
    id: "story31",
    name: "Jambu Swami (जम्बू स्वामी)",
    imageUrl: "",
    content: `(हाथ में पाठ जम्बू स्वामी चरित पर आधारित है।)

    बहन : अंतिम तीर्थंकर भगवान महावीर पूर्णतया निष्काम एवं सर्वज्ञ थे। क्या ऐसी ही कोई और शख्सियत थी?
    
    भाई : हाँ. महावीर के बाद गौतम स्वामी, सुदबर्माचार्य और जम्बू स्वामी पूर्णतया सर्वज्ञ एवं निष्काम थे। इस युग के अंतिम सर्वज्ञ जम्बू स्वामी थे।
    
    बहन : क्या जम्बू स्वामी भी महावीर स्वामी की तरह राजकुमार थे?
    
    भाई : नहीं बहन, वह राजगृह के एक धनी व्यापारी का पुत्र था। उनके पिता अरहदास और माता जिनमती थीं। उनका जन्म फाल्गुन मास के अंतिम दिन हुआ था।
    
    जम्बू कुमार का राजा श्रेणिक के दरबार तथा तत्कालीन समुदाय में महत्वपूर्ण स्थान था। शहर के कई धनी व्यक्ति अपनी बेटियों का विवाह जम्बू कुमार से करना चाहते थे और ऐसी चार लड़कियों की मंगनी भी उनसे हो चुकी थी, लेकिन...
    
    बहन : लेकिन क्या?
    
    भाई : लेकिन बचपन से ही उन्हें सांसारिक संपत्ति से सख्त नफरत थी। उनका मन मानसिक सुख के लिए व्याकुल रहता था और इसी कारण उन्होंने विवाह करने से इंकार कर दिया।
    
    बहन ने मना कर दिया? सगाई के बाद त्याग दिए रिश्ते? विवाह नहीं किया ?
    
    भाई : वह तो शादी ही नहीं करना चाहता था, लेकिन जब लड़कियों को यह पता चला तो उन्होंने जम्बू कुमार के अलावा किसी और से शादी करने या अन्यथा अविवाहित रहने का फैसला किया।
    
    बहन : फिर..,
    
    भाई : जम्बू कुमार के माता-पिता और। चारों लड़कियों ने जम्बू कुमार से विनती की कि वे शादी से इंकार कर दें। उन्होंने विवाह समारोह के बाद उसे भिक्षु बनने की अनुमति दे दी, क्योंकि वे जानते थे कि चारों सुंदर लड़कियाँ जम्बू कुमार का मन मोह लेंगी और फिर वह संसार त्यागना भूल जायेगा। लेकिन…।
    
    बहन: क्या?
    
    भाई : जम्बू कुमार विवाह के लिए राजी हो गया, परंतु वह सांसारिक विषय भोगों की ओर आकर्षित नहीं हो सका?
    
    बहन: क्या शादी नहीं हो पाई?
    
    भाई का विवाह तो हुआ, परंतु अगले ही दिन जम्बू कुमार ने घर, पारिवारिक संबंध, धन-संपत्ति और सभी चार देवी-तुल्य पत्नियों को छोड़ दिया और जैन भिक्षुओं के संघ में दीक्षित हो गए।
    
    बहन : उनकी पत्नियों के क्या नाम थे? क्या उन्होंने उसे भिक्षुओं के संघ में शामिल न होने के लिए राजी नहीं किया?
    
    भाई : वे पदमश्री, कमलश्री, विनयश्री और रूपश्री थे। अपने भावपूर्ण हाव-भाव, सुन्दर रूप, सेवा और चतुराई से उन्होंने जम्बू कुमार को घर में रोकने की पूरी कोशिश की, लेकिन वे उसे हिला नहीं सके, क्योंकि वह आत्म-साक्षात्कार द्वारा आध्यात्मिक आनंद का गहरा रस पीना चाहता था।
    
    बहन : ठीक था. सांसारिक लोगों की आसक्ति की भावनाएँ आध्यात्मिक विचारधारा वाले लोगों को प्रभावित नहीं कर सकतीं। चेतना और तप की किरणें आसक्ति और अज्ञान को नष्ट करने के लिए काफी शक्तिशाली हैं।
    
    भाई : तुम सही कह रहे हो. उनकी चेतना और तपस्या ने चोर विद्युतचोर को प्रभावित किया, जो उसी रात चोरी करने के लिए जम्बू कुमार के घर में घुस गया था। जम्बू कुमार की उनकी नवविवाहित पत्नियों के साथ चर्चा सुनने और उनकी त्याग की गहरी भावनाओं को समझने के बाद उन्होंने जैन संतों के आदेश को भी स्वीकार कर लिया।
    
    बहन: उन लड़कियों का क्या हुआ?
    
    भाई: उन्होंने भी खुद को जीवन के ऐन्द्रिक सुखों से तोड़ दिया, त्याग की ओर मुड़ गये और जैन भिक्षुणी के रूप में दीक्षित हो गये। जम्बू कुमार के माता-पिता भी साधुत्व में दीक्षित हुए।
    
    इस प्रकार सारा वातावरण तप से व्याप्त हो गया। भिक्षु जम्बू कुमार गहनता से आध्यात्मिक चिंतन में लीन हो गये। माघ महीने के उत्तरार्ध के 7वें दिन, जिस दिन उनके गुरु सुधर्माचार्य को पूर्ण मुक्ति प्राप्त हुई, उन्होंने सर्वज्ञता प्राप्त की।
    
    बहन: जैसे महावीर की मुक्ति का दिन और गौतम द्वारा सर्वज्ञता प्राप्त करने का दिन, सुधर्माचार्य की मुक्ति का दिन और जम्बू कुमार द्वारा सर्वज्ञता प्राप्त करने का दिन एक ही है।
    
    भाई: उसके बाद जम्बू स्वामी ने मगध से मथुरा तक अठारह वर्षों तक धर्म का प्रचार किया और अंततः चौरासी मथुरा से निर्वाण (परम आनंद) राज्य प्राप्त किया।`,
  },
  {
    id: "story32",
    name: "Balbhadra Ram (बलभद्र राम)",
    imageUrl: "",
    content: `विद्यार्थी: क्या राम और हनुमान भगवान नहीं हैं?

    अध्यापक: कौन कहता है कि वे भगवान नहीं हैं? उन्होंने मांगीतुंगी पर्वत से पूर्ण मुक्ति प्राप्त की और सिद्धों के पूर्ण आनंद का आनंद ले रहे हैं। निर्वाणकांड से हमें पता चलता है कि राम, हनु, सुग्रीव, सुनील, गवा, गवाक्ष, नील, महनील और निन्यानवे करोड़ भिक्षुओं ने मैंगीतुंगी से पूर्ण मुक्ति प्राप्त की, जो हमारे लिए पूजा स्थल है।
    
    जिज्ञासु : क्या सुग्रीव तथा अन्य वानरों तथा नल, नील तथा अन्य रीछों को भी परम मुक्ति प्राप्त हुई है? क्या वे भी भगवान बन गये?
    
    अध्यापक- न हनुमान और सुग्रीव वानर थे, न नल और नील भालू। वे बहुत सुंदर और महान व्यक्तित्व वाले थे और उन्होंने अपने सर्वोच्च प्रयास से अपने जीवन में पूर्ण वैराग्य और सर्वज्ञता प्राप्त की।
    
    जिज्ञासु : फिर इन्हें बंदर आदि क्यों कहा जाता है?
    
    अध्यापक: वे जिस कबीले के थे उसे बानर (बंदर) कहा जाता था। इसी प्रकार रावण भी कोई विशालकाय नहीं था। वह राक्षस कुल का था और तीन प्रदेशों का राजा था।
    
    विद्यार्थी : लोग कहते हैं कि उसके दस मुँह थे। क्या यह सही है ?
    
    टीचर: क्या कोई ऐसा आदमी है जिसके दस मुँह हों? उसका नाम दशमुख था। इसका कारण यह था कि बचपन में वह नौ रत्नों वाला हार पहना करते थे। उसके मुख का प्रतिबिंब इन मणियों पर पड़ा और ऐसा प्रतीत हुआ मानो उसके दस मुख हों। इसी कारण लोग उन्हें दशमुख कहने लगे।
    
    विद्यार्थी: राम का जन्म कहाँ हुआ था?
    
    अध्यापक : बालक राम का जन्म अयोध्या के राजा दशरथ की रानी कौशल्या के गर्भ से हुआ था। अपनी आत्मा की खोज से वह भगवान राम बन गये।
    
    राजा दशरथ की चार रानियाँ थीं। इनमें से कौशल्या ने राम, सुमित्रा ने लक्ष्मण, कैकेयी ने भरत और सुप्रभा ने शत्रुघ्न को जन्म दिया।
    
    जिज्ञासु : तो राम के तीन और भाई थे। और…। ?
    
    अध्यापक : राम का विवाह राजा जनक की पुत्री सीता से हुआ था। एक बार राजा दशरथ ने सोचा कि उनका पुत्र अब राज्य का भार उठाने में सक्षम है और इसलिए उन्होंने राज्य का शासन राम को सौंपकर स्वयं को आत्म-साधना में लीन करना चाहा। उन्होंने राम के राज्याभिषेक समारोह की तारीख की भी घोषणा की, लेकिन...
    
    विद्यार्थी : लेकिन, क्या?
    
    अध्यापक : रानी कैकेयी अपने पुत्र भरत को राजा बनाना चाहती थी। इसलिए, उसने दो वरदान मांगे जिनका राजा ने उससे वादा किया था। पहला यह कि राम को चौदह वर्ष का वनवास दिया जाए और दूसरा यह कि भरत को अयोध्या का राजा घोषित किया जाए। यह सुनकर दशरथ को दुःख हुआ, लेकिन वे अपने वचन से बंधे थे और राम को जंगल में जाना पड़ा। सीता और लक्ष्मण उनके साथ थे।
    
    जिज्ञासु: तो क्या भरत राजा बने?
    
    अध्यापक : दरअसल, उन्हें राजा बनना पसंद नहीं था।
    
    विद्यार्थी : राम को जंगल में कितनी कठिनाइयों का सामना करना पड़ा होगा?
    
    शिक्षक: राम और लक्ष्मण को जंगल में जीवन की रोजमर्रा की सामान्य कठिनाइयों की चिंता नहीं थी, लेकिन जब सीता का अपहरण हुआ तो वे बहुत परेशान हो गए।
    
    विद्यार्थी: सीता का अपहरण किसने किया?
    
    अध्यापक : लंका के राजा रावण ने सीता का अपहरण कर लिया था। हनुमान, सुग्रीव और अन्य लोग उसकी संप्रभुता के अधीन राजा थे, लेकिन इस नीच कृत्य के कारण उन्होंने उसके प्रति अपनी वफादारी छोड़ दी। उनके भाई विभीषण ने उन्हें सीता को राम को लौटाने के लिए मनाने की कोशिश की, लेकिन उनके भाग्य में कष्ट सहना लिखा था, इसलिए उन्होंने उनकी एक भी बात नहीं सुनी। अंततः विभीषण ने भी उनका दरबार छोड़ दिया।
    
    छात्र: आगे क्या?
    
    अध्यापक: राम और लक्ष्मण ने लंका पर आक्रमण किया। विभीषण, सुग्रीव, नल, नील, हनुमान और विभिन्न क्षेत्रों के अन्य राजाओं ने राम और लक्ष्मण का पक्ष लिया और दुष्ट रावण को उसी भाग्य का सामना करना पड़ा जिसके वह हकदार था। वह मारा गया और राम और लक्ष्मण ने मैदान जीत लिया। सीता को राम ने वापस ले लिया। चौदह वर्ष पूरे हुए और राम और लक्ष्मण वापस अयोध्या आकर राज्य करने लगे।
    
    विद्यार्थी : अच्छा हुआ दुर्भाग्य समाप्त हो गया। तो फिर सीता और राम ने ऐशो-आराम का जीवन बिताया होगा?
    
    अध्यापक: क्या सांसारिक सुखों में कोई सुख है? इन्हें दुखों का निवास स्थान माना गया है। जब तक आत्मा में भ्रम, राग और द्वेष हैं, तब तक चारों ओर दुःख ही दुःख हैं। वे कुछ दिनों तक ही सुख से रहे, जिसके बाद सार्वजनिक बदनामी के कारण राम ने गर्भवती सीता को निर्वासित कर दिया। पुण्डरीकपुर के राजा वज्रजंघ ने सीता को अपनी बहन के रूप में स्वीकार किया और उन्हें आश्रय दिया। यदि उसने ऐसा न किया होता...
    
    विद्यार्थी : फिर....?
    
    अध्यापक : सीता ने पुण्डरीकपुर में जुड़वाँ भाइयों लव और कुश को जन्म दिया। दोनों भाई राम और लक्ष्मण की तरह ही बलशाली, शांत और वैभवशाली थे। उन्होंने राम और लक्ष्मण पर भी युद्ध किया।
    
    छात्र: कौन जीता?
    
    अध्यापक : दोनों दल अजेय रहे। इससे पहले कि हार-जीत का फैसला हो पाता, दोनों पक्षों को पता चल गया कि यह पिता-पुत्रों के बीच की लड़ाई है. इसलिए, युद्धक्षेत्र को पारिवारिक मिलन मैदान में बदल दिया गया।
    
    जिज्ञासु : क्या सीता के दुर्भाग्य का अंत हो गया?
    
    अध्यापक : राग-द्वेष की पृष्ठभूमि में दुर्भाग्य का अंत नहीं हो सकता। वैराग्य ही दुर्भाग्य को समाप्त करने का एकमात्र उपाय है।
    
    छात्र: आगे क्या हुआ?
    
    शिक्षक: राम ने सीता की पवित्रता की परीक्षा के लिए उन्हें अग्नि में तपाए बिना स्वीकार करने से इनकार कर दिया।
    
    विद्यार्थी : फिर ?
    
    अध्यापक: महान सीता ने अग्नि में प्रवेश किया और अपनी पवित्रता साबित की। तेज जलती आग ठंडे और शांत पानी में बदल गई. स्वर्गीय प्राणियों ने शुद्ध जीवन की गरिमा स्थापित करने के लिए यह चमत्कार किया।

जिज्ञासु : तो फिर राम ने सीता को स्वीकार कर लिया होगा?

अध्यापक : हां, राम तो उसे अपनी रानी के रूप में स्वीकार करने को तैयार थे, लेकिन वह स्वयं गृहस्थी की भट्ठी में जलना पसंद नहीं करती थी, क्योंकि उसे यह एहसास हो गया था कि इंद्रियों के सुख में कोई आनंद नहीं है। वैराग्य का मार्ग ही परम सुख का एकमात्र मार्ग है। इसलिए, उसने खुद को आत्मा की खोज में तल्लीन कर लिया।

विद्यार्थी : और राम....?

अध्यापक: कुछ समय बाद राम को भी सांसारिक जीवन की क्षणभंगुरता का एहसास हुआ और वे एक विरक्त साधु बन गए। उन्होंने राग और द्वेष को नष्ट कर दिया और अपने आत्म-साक्षात्कार के उच्चतम बिंदु पर पहुँचकर एक सर्वज्ञ प्राणी बन गए।

विद्यार्थी : राम की कहानी बहुत ही रोचक और शिक्षाप्रद है। मैंने इसका आनंद लिया और कई नई चीजें सीखीं। क्या आप इसे अधिक विस्तार से नहीं बता सकते?

अध्यापक : घटनाओं का विस्तार से वर्णन करने का समय नहीं है। यदि आप अधिक विस्तार से जानना चाहते हैं तो आपको रविसेनाचार्य के पदम पुराण का अध्ययन करना चाहिए।

छात्र: यह संस्कृत में होना चाहिए?

अध्यापक : हां, मूल पाठ तो संस्कृत में है, लेकिन पंडित दौलतरामजी कासलीवाल ने इसका हिंदी में भी अनुवाद किया है।

छात्र: हमें यह कहां मिलेगा?

टीचर : मंदिर में. पदम पुराण आपको हर जैन मंदिर में मिल जाएगा, जहां लोग रोजाना इसका पाठ करते हैं।`,
  },
  {
    id: "story33",
    name: "Akroshparishahe Kshapak  (आक्रोशपरिषहे क्षपक)",
    imageUrl: "",
    content: `किसी गाँव में एक तेजस्वी साधु मासखमण आदि की अत्यंत कठिन तपस्या कर रहा था।

    कोई देवी उनके गुणों से प्रभावित होकर उन्हें प्रणाम करती थी और कामना करती थी कि वह उन्हें उनके और उनके लिए भी उपयुक्त कुछ करने का आदेश दें।
    
    एक बार की बात है कि किसी ब्राह्मण ने उन्हें बुरा-भला कहा और गालियां दीं, जिसे सुनकर साधु क्रोधित होकर उनसे झगड़ने लगा।
    
    तब बलशाली ब्राह्मण ने भूख से दुर्बल उस पर फुवे की मुक्के से प्रहार करके उसे भूमि पर गिरा दिया।
    
    वह ब्राह्मण उसे बार-बार बेरहमी से पीटने लगा और फिर जाने दिया। वह साधु भी बड़े कष्ट से अपने स्थान पर वापस आया।
    
    परंतु उस संत ने उनसे कुछ भी नहीं कहा तब देवी ने स्वयं उस मौन संत से इस प्रकार पूछा।
    
    महाराज! मैंने कैसा अपराध किया है? तुम मुझसे बात क्यों नहीं करते? उस समय मौन रहने के लिए प्रतिबद्ध होते हुए भी उसने जोर से उससे ऐसा कहा।
    
    हे देवी! कुछ ब्राह्मणों ने मुझे मारा, लेकिन आपने मेरी रक्षा नहीं की और न ही उसे दंडित किया, जिसने मुझे बहुत परेशान किया।
    
    इसलिए मैं केवल ऊपरी तौर पर आदर दिखाकर आपसे कुछ नहीं बोलता, उसकी ऐसी बातें सुनकर वह मुस्कुराकर बोली।
    
    महाराज! जब तुम आपस में झगड़ रहे थे तो मैं वहां आनंद ले रहा था। तुम दोनों क्रोधवश ऐसे मिल गये थे इसलिये मैं यह निर्णय नहीं कर सका कि कौन ब्राह्मण है और कौन साधु है।
    
    मैं यह निर्णय नहीं कर सका कि तुम दोनों में कौन साधु है और कौन ब्राह्मण। इसलिए मैंने न तो तुम्हारा बचाव किया और न ही उसे दण्ड दिया। उसकी बातें सुनकर संत का क्रोध शांत हो गया और वे इस प्रकार बोले।
    
    तब देवी ने उन्हें आदरपूर्वक प्रणाम किया और अपने स्थान पर चली गईं। इस प्रकार क्रोध के कारण साधु भी बालक के समान मूर्ख और मूर्ख बन जाता है इसलिए साधु को दुराचारी व्यक्ति पर भी क्रोध नहीं करना चाहिए।`,
  },
];

export default storiesData;
