import React, { useEffect } from "react";
import { Link } from "react-router-dom";
import "./Sallekhna.scss";

function Sallekhna() {
  useEffect(() => {
    ScrollHeight();
    window.addEventListener("resize", ScrollHeight);

    return () => {
      window.removeEventListener("resize", ScrollHeight);
    };
  }, []);

  function ScrollHeight() {
    var content = document.querySelector("#parchment");
    var container = document.querySelector("#containingPart");
    if (content && container) {
      content.style.height = container.offsetHeight + "px";
    }
  }

  return (
    <>
      <div>
        <div
          className="flx"
          style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
          }}
        >
          <div
            style={{
              display: "flex",
              justifyContent: "center",
              alignItems: "center",
              marginTop: "20px",
              textDecoration: "none",
            }}
          >
            <Link to="/">
              <button
                style={{
                  backgroundImage:
                    "url(https://images.unsplash.com/photo-1546484396-fb3fc6f95f98?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80)",
                  borderRadius: "5px",
                  width: "150px",
                  cursor: "pointer",
                  textDecoration: "none",
                  color: "#fff",
                }}
              >
                Home
              </button>{" "}
            </Link>
          </div>
        </div>
        <div className="verywellknownMain">
          <main>
            <div id="parchment"></div>
            <div id="containingPart">
              <p className="inkTitle">Sallekhna ( सल्लेखना )</p>
              <p id="labarum">
                <img
                  src="https://tse4.mm.bing.net/th?id=OIP.5RwoZeDvcpBoAdqZULgBggHaEK&pid=Api&P=0&h=180"
                  alt="sallekhna"
                  style={{
                    marginBottom: "50px",
                  }}
                />
              </p>
              <p className="paragraphTagging">
                सल्लेखना स्वेच्छा से मृत्यु का आलिंगन कर रही है जब गृहस्थ और
                संन्यासी दोनों को यह अनुमान होता है कि बुढ़ापे, असाध्य रोग,
                भयंकर अकाल, शत्रु या जंगली जानवर के हमले आदि के कारण जीवन का अंत
                बहुत निकट है। ऐसे समय में व्यक्ति सभी पर विजय प्राप्त कर लेता
                है। धीरे-धीरे भोजन और पानी से दूर रहने और आत्मा के शरीर से अलग
                होने तक स्वयं के वास्तविक स्वरूप पर ध्यान देने जैसी तपस्याओं का
                पालन करके जुनून और सभी सांसारिक लगावों का त्याग करता है। उपवास
                की प्रकृति को समायोजित करने के लिए जीवन की शेष अवधि का अनुमानित
                आकलन आवश्यक है। उसे सभी कष्ट सहने चाहिए, लेकिन यदि वह बीमार पड़
                जाता है या किसी अन्य कारण से मन की शांति बनाए नहीं रख पाता है,
                तो उसे सल्लेखना छोड़ देना चाहिए और भोजन और अन्य गतिविधियों को
                फिर से शुरू करना चाहिए।
              </p>
              <br />
              <p className="paragraphTagging">
                सल्लेखना करना एक बहुत ही विशेष व्रत है। इस व्रत के पीछे सिद्धांत
                यह है कि एक व्यक्ति बिना किसी डर के पूर्ण शांति, शांति और धैर्य
                के साथ इस शरीर का त्याग करता है, न केवल नए कर्मों के आगमन को
                रोकता है, बल्कि इससे जुड़े पुराने कर्मों को भी शुद्ध करता है।
                आत्मा।
              </p>
              <br />
              <p className="paragraphTagging">
                सल्लेखना को संन्यास-मरण, समाधि-मरण आदि नामों से भी जाना जाता है।
              </p>
              <br />
              <p className="paragraphTagging">
                जो गृहस्थ इस व्रत को शुद्ध मन से स्वीकार करता है, वह मित्रता,
                शत्रुता और परिग्रह को त्याग देता है। उसे अपने रिश्तेदारों,
                साथियों और नौकरों या परिचितों को माफ कर देना चाहिए और उनसे पिछले
                सभी अप्रिय कार्यों के लिए माफी मांगनी चाहिए। उसे अपने बोधकर्ता
                के साथ अपने द्वारा किए गए सभी पापों या उन पापों के बारे में
                ईमानदारी से चर्चा करनी चाहिए, जो उसने दूसरों को करने के लिए कहा
                था, या जो पाप उसने दूसरों को करने के लिए प्रोत्साहित किया था। इस
                व्रत की अवधि के दौरान उसे अपने मन से सभी दुःख, भय, पश्चाताप,
                स्नेह, घृणा, पूर्वाग्रह, जुनून आदि को पूरी तरह से दूर कर देना
                चाहिए।
              </p>
              <br />
              <p className="paragraphTagging">
                प्रारंभ में धीरे-धीरे भोजन छोड़कर केवल तरल पदार्थ लेना चाहिए और
                अंत में तरल पदार्थ त्यागकर केवल उबला हुआ पानी ही लेना चाहिए तथा
                अपनी क्षमता के अनुसार उपवास करना चाहिए। उसे सभी वासनाओं और
                मानसिक दुर्बलताओं का भी त्याग कर देना चाहिए। वह शरीर पर ध्यान
                दिए बिना ध्यान में लीन रहेगा। उसे पाँच अपराधों से बचना चाहिए।
                <br /> वे हैं: <br />
                1) कामना करना कि मृत्यु थोड़ी देर से आए, <br /> 2) शीघ्र मृत्यु
                की कामना करना, <br /> 3) यह डर मन में रखना कि वह मृत्यु का सामना
                कैसे करेगा, <br /> 4) मृत्यु के समय दोस्तों और रिश्तेदारों को
                याद करना, और <br />
                5) कामना करना इस व्रत के परिणामस्वरूप एक निश्चित इनाम के लिए।
              </p>
              <br />
              <p className="paragraphTagging">
                यह सलाह दी गई है कि इस व्रत को सफलतापूर्वक करने के लिए संन्यासी
                या गृहस्थ को ऐसे स्थान का चयन करना चाहिए जहां सरकार को इस व्रत
                पर आपत्ति न हो और लोगों में ऐसे निर्णयों के प्रति सम्मान और समझ
                हो। यह इस व्रत के पालन के दौरान किसी भी प्रकार की गड़बड़ी या
                रुकावट से सावधानी के लिए है। व्रत की अवधि के दौरान बाहरी शांति
                और आंतरिक शांति सुनिश्चित करने के लिए ऐसी सावधानी आवश्यक है।
              </p>
              <br />
              <p className="paragraphTagging">
                यह जाने बिना कि मृत्यु बहुत निकट या आसन्न है, सल्लेखना व्रत
                अपनाने के विरुद्ध स्पष्ट और निश्चित निर्देश हैं। इसका एक
                शास्त्रीय उदाहरण स्वयं आचार्य सामंतभद्र का है। भस्मरोग नामक
                असाध्य रोग से पीड़ित होने के कारण धार्मिक प्रतिबंधों के अनुसार
                जीवन जीने की असंभवता के कारण उन्होंने यह प्रतिज्ञा लेने की इच्छा
                की। वह अनुमति के लिए अपने गुरु (गुरु) के पास पहुंचे। उनके गुरु
                ने अपने सहज ज्ञान से महसूस किया कि वह लंबे समय तक जीवित रहेंगे
                और उनमें जैन साहित्य में बहुत महत्वपूर्ण योगदान देने की क्षमता
                है। इसलिए उन्होंने अनुमति देने से इनकार कर दिया.
              </p>
              <br />
              <p className="paragraphTagging">
                कई सल्लेखना आत्महत्या को लेकर भ्रमित हैं क्योंकि आत्महत्या शब्द
                में सभी स्वयं-आरोपित मौतें शामिल हैं। स्वयं द्वारा अपनाये गये
                साधनों द्वारा स्वयं को मारना ही आत्महत्या है। संस्कृत में
                आत्महत्या के लिए समरूप शब्द आत्मघात या आत्महत्या (आत्म-विनाश)
                है। आत्महत्या आम तौर पर किसी का अपना बनाया हुआ दुर्भाग्य है।
                आत्महत्या का शिकार व्यक्ति या तो अपनी मानसिक कमजोरी का शिकार
                होता है या बाहरी परिस्थितियों का, जिनसे वह बचने में सक्षम नहीं
                होता है। आधुनिक समय में व्यक्तिगत अथवा किसी भी सामाजिक समूह में
                मानसिक एवं नैतिक शक्ति का तेजी से ह्रास हो रहा है। हमारी सभ्यता
                बड़ी संख्या में मनोवैज्ञानिक और सामाजिक समस्याएं लेकर आई है,
                जिनसे केवल मजबूत व्यक्ति ही बच सकते हैं। व्यक्तिगत जीवन में
                निराशा और हताशा, वैवाहिक जीवन या प्रेम-संबंधों में भावनात्मक या
                भावनात्मक टूटन, व्यापार या व्यवसाय में अप्रत्याशित और असहनीय
                आर्थिक हानि, निकटतम और प्रियजन की मृत्यु के कारण अचानक और
                हृदय-विदारक दुःख, की उपस्थिति। ऐसी बीमारी जो लाइलाज है या
                सामाजिक रूप से निंदनीय है, अवसाद का अचानक विकसित होना, सार्वजनिक
                अपमान या स्वयं या परिवार का अपमान, किसी महत्वाकांक्षा को पूरा
                करने में विफलता के कारण अप्रत्याशित झटका और कई अन्य असामान्य
                कारकों को व्यक्तिगत या संचयी रूप से ध्यान में रखा जा सकता है। ,
                जो किसी व्यक्ति को अचानक आवेग के प्रभाव में आत्महत्या करने के
                लिए प्रेरित करता है। स्थितियों की बार-बार पुनरावृत्ति, जो
                निराशा, अवसाद, मानसिक और भावनात्मक संघर्ष की भावनाओं को जन्म
                देती है, पीड़ित को आत्महत्या के भयानक कदम तक ले जाती है।
              </p>
              <br />
              <p className="paragraphTagging">
                दूसरी ओर सल्लेखना में इस व्रत को अपनाने या उसकी पूर्ति में
                उपरोक्त कोई भी मनोवैज्ञानिक या समाजशास्त्रीय विशेषता नहीं मिलती।
                उसी प्रकार इरादों, स्थितियों, अपनाए गए साधनों और कार्य के परिणाम
                या उसके परिणामों में भी बड़ा अंतर होता है। दूसरी ओर सल्लेखना में
                इस व्रत को अपनाने में उपरोक्त मनोवैज्ञानिक या समाजशास्त्रीय
                विशेषताओं में से कोई भी नहीं पाई जाती है। या उसकी पूर्ति में.
                उसी प्रकार इरादों, स्थितियों, अपनाए गए साधनों और कार्य के परिणाम
                या उसके परिणामों में भी बड़ा अंतर होता है।
              </p>
              <br />
              <p className="paragraphTagging">
                इस व्रत को अपनाने वाले व्यक्ति का एकमात्र इरादा आध्यात्मिक है और
                निश्चित रूप से अस्थायी नहीं है। प्रतिज्ञा को अपनाने से पहले कुछ
                वर्षों तक अभ्यास करके सभी वासनाओं पर विजय प्राप्त करके मन की
                शुद्धि की जाती है। इस व्रत को अपनाने वाला व्यक्ति कर्म के बंधन
                से मुक्त होना चाहता है, जो इस दुनिया में उसकी सभी बुराइयों और
                विभिन्न राज्यों (गति) में पुनर्जन्म के चक्र के लिए जिम्मेदार है।
                आत्मघाती इरादे के विपरीत, किसी हिंसक या आपत्तिजनक तरीके से जीवन
                को तुरंत समाप्त करने की कोई इच्छा नहीं होती है। किसी भी शर्म,
                हताशा या भावनात्मक उत्तेजना से बचने का कोई सवाल ही नहीं है।
                स्वयं को या अपने परिवार के किसी सदस्य को नुकसान पहुंचाने का कोई
                इरादा नहीं है। जिन परिस्थितियों में प्रतिज्ञा अपनाई जानी चाहिए
                वे अच्छी तरह से परिभाषित हैं। व्रत को आध्यात्मिक गुरु (गुरु) की
                अनुमति से ही अपनाया जाना चाहिए।
              </p>
              <br />
              <p className="paragraphTagging">
                इस व्रत की पूर्ति के लिए क्या उपाय अपनाए जाते हैं? वे फांसी
                देना, जहर देना, छुरा घोंपना, गोली मारना, गहरे पानी में डुबाना या
                ऊंचाई से कूदना जैसे हिंसक साधन नहीं हैं। उसे सुनियमित सिद्धांतों
                के अनुसार उपवास करना होता है। उसे अपने उपवास के दिनों को
                धीरे-धीरे बढ़ाना होगा। उसे ठोस आहार से लेकर तरल पदार्थ तक खाना
                पड़ता है जब तक कि वह पानी पीना भी नहीं छोड़ देता। उसे
                धर्मग्रंथों को पढ़ने या सुनने, ध्यान और आत्म-निरीक्षण में समय
                बिताना होगा। तपस्वी या विद्वान गृहस्थ अपने समय का कुछ हिस्सा ऐसे
                भक्तों को धर्म का प्रचार करने में लगा सकते हैं जो वहां मौजूद हो
                सकते हैं। उसे मृत्यु में न तो जल्दबाजी करनी चाहिए और न ही देर
                करनी चाहिए। उसे शांति से प्राकृतिक समय की प्रतीक्षा करनी चाहिए,
                पूर्ण वैराग्य और आंतरिक एकाग्रता के साथ गहन ध्यान में लीन हो
                जाना चाहिए।
              </p>
              <br />
              <p className="paragraphTagging">
                सल्लेखना द्वारा की गई मृत्यु का परिणाम न तो किसी के लिए दुखद है
                और न ही दुखद, क्योंकि इस व्रत को अपनाने से पहले सभी प्रकार के
                संबंधों को आम सहमति से समाप्त कर दिया गया है। इसका तात्कालिक
                परिणाम धर्म के प्रति श्रद्धा और विश्वास जगाने वाला होता है। शव
                के आस-पास और आस-पास का माहौल अच्छी श्रद्धा वाला होता है। न कोई
                दुःख है, न शोक है। इस अवसर को पूजा, भजन और धार्मिक मंत्रों के
                पाठ के साथ एक धार्मिक उत्सव के रूप में माना जाता है। दुःख के लिए
                कोई जगह नहीं है लेकिन खुशी है। कई लोग दिवंगत लोगों द्वारा
                प्राप्त की गई आध्यात्मिक ऊंचाइयों, जिस शांति और शांति के साथ
                मृत्यु का सामना किया गया और उस सर्वोच्च घटना से जागृत हुई नई
                प्रेरणा और भक्ति की प्रशंसा करते हैं।
              </p>
              <br />
              <p className="paragraphTagging">
                कुछ पश्चिमी लेखकों ने कहा है कि संलेखना भूख से की गई आत्महत्या
                है। न्यायमूर्ति टी.के. तुलोक की राय में, "वे एक धार्मिक दर्शन के
                तहत पैदा हुए और पले-बढ़े हैं जो दुनिया को भगवान की रचना के रूप
                में बताता है और उपवास से मृत्यु की बात करता है, हालांकि, यह एक
                प्राचीन धार्मिक दर्शन के सिद्धांतों के अनुसार है जो ऐसा नहीं
                करता है किसी भी रचनाकार-ईश्वर को पहचानना, ईश्वर की इच्छा के
                विरुद्ध आत्म-विनाश है। ऐसा प्रतीत होता है कि उन्होंने सल्लेखना
                और आत्महत्या के बीच अंतर के विभिन्न बिंदुओं पर कोई ध्यान नहीं
                दिया है।
              </p>
              <br />
              <p className="paragraphTagging">
                इस प्रकार, आत्महत्या और सल्लेखना के बीच कुछ भी समान नहीं है,
                सिवाय इसके कि दोनों मामलों में मृत्यु होती है। आत्महत्या के
                मामले में, मृत्यु आपत्तिजनक तरीकों से की जाती है क्योंकि नुकसान
                स्वयं के शरीर और रिश्तेदारों और दोस्तों के हितों और भावनाओं को
                होता है। सल्लेखना में मृत्यु को बहुत शांतिपूर्ण प्रक्रिया के साथ
                गले लगाया जाता है, जिससे इसमें शामिल सभी लोगों के लिए मन की
                शांति बनी रहती है।
              </p>
              <br />
              <p className="paragraphTagging">
                सल्लेखना व्रत को अपनाना प्रत्येक व्यक्ति के लिए असंभव है क्योंकि
                इसके लिए भक्त को यह दृढ़ विश्वास होना आवश्यक है कि आत्मा और शरीर
                अलग-अलग हैं। यह व्रत उस व्यक्ति द्वारा अपनाया जाता है जिसने
                तपस्या, पश्चाताप और क्षमा द्वारा अपने मन और शरीर को शुद्ध कर
                लिया है; उसने स्वयं को सभी वासनाओं और कष्टों से मुक्त कर लिया
                है; और मित्रों तथा सम्बन्धियों से उसका कोई लगाव नहीं रहा। वह
                मृत्यु का स्वागत खुशी और शांति के साथ करता है।
              </p>
              <p className="cachet">
                <img src="https://i.postimg.cc/4NBYNqCR/22.png" alt="Cachet" />
              </p>
            </div>
          </main>

          <svg>
            <filter id="wavy2">
              <feTurbulence
                x="0"
                y="0"
                baseFrequency="0.02"
                numOctaves="5"
                seed="1"
              />
              <feDisplacementMap in="SourceGraphic" scale="20" />
            </filter>
          </svg>
        </div>
      </div>
    </>
  );
}

export default Sallekhna;
